
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十二章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter13.html" />
    
    
    <link rel="prev" href="chapter11.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十二章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6F14;&#x620F;5">&#x6F14;&#x620F;[5]</h2>
<p>&#x90A3;&#x9996;&#x6B4C;&#x542C;&#x5B8C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x6211;&#x548C;&#x8001;&#x5F20;&#x542F;&#x52A8;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x4E0A;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x540E;&#x95E8;&#x7A0B;&#x5E8F;&#x7684;&#x54CD;&#x5E94;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x63A7;&#x5236;&#x4F4F;&#x4E86;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x3002;&#x6309;&#x7167;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x62A4;&#x624B;&#x6BB5;&#x6765;&#x770B;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x901A;&#x8FC7;&#x8FD9;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x5165;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x6700;&#x597D;&#x4E0D;&#x8981;&#x8BA9;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x3002;&#x6700;&#x540E;&#x5982;&#x679C;&#x4E0D;&#x884C;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x641E;&#x66B4;&#x529B;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#x4E0A;&#x90A3;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x8FDE;&#x7FFB;&#x770B;&#x4ED6;&#x4EEC;&#x673A;&#x5668;&#x4E0A;&#x6587;&#x4EF6;&#x7684;&#x5174;&#x8DA3;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x5EFA;&#x4E86;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x3002;&#x662F;&#x4E2A;&#x4FEE;&#x6539;&#x4E86;&#x7684;proxy&#xFF0C;&#x6211;&#x4EEC;&#x9690;&#x85CF;&#x4E86;&#x5B83;&#x7684;&#x754C;&#x9762;&#x3002;</p>
<p>&#x53EF;&#x80FD;&#x4ED6;&#x4EEC;&#x505A;&#x68A6;&#x4E5F;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x6211;&#x4EEC;&#x4F1A;&#x641E;&#x5230;&#x4ED6;&#x4EEC;&#x4E0B;&#x9762;&#x6307;&#x6325;&#x90E8;&#x7684;ip&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6210;&#x529F;&#x653B;&#x9677;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x53EA;&#x8981;&#x770B;&#x770B;&#x8FDB;&#x7A0B;&#x5217;&#x8868;&#x5C31;&#x80FD;&#x53D1;&#x73B0;&#x7684;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x4ED6;&#x4EEC;&#x4E5F;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x3002;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x4ED6;&#x4EEC;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x53BB;&#x53D1;&#x73B0;&#x3002;&#x4EBA;&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x9632;&#x5907;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x662F;&#x4E0D;&#x4F1A;&#x53D1;&#x73B0;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x518D;&#x7CBE;&#x660E;&#x7684;&#x4EBA;&#xFF0C;&#x5728;&#x5927;&#x610F;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x72AF;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x51ED;&#x826F;&#x5FC3;&#x8BF4;&#xFF0C;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x591A;&#x4E48;&#x5389;&#x5BB3;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x5BF9;&#x65B9;&#x538B;&#x6839;&#x5C31;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x8981;&#x65AD;&#x6389;&#x6211;&#x4EEC;&#x7B80;&#x76F4;&#x662F;&#x4E3E;&#x624B;&#x4E4B;&#x52B3;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x518D;&#x63A5;&#x518D;&#x52B1;&#xFF0C;&#x9A6C;&#x4E0A;&#x4F20;&#x4E86;&#x4E00;&#x4E2A;&#x952E;&#x76D8;&#x6355;&#x83B7;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x4E14;&#x542F;&#x52A8;&#x4E86;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x767B;&#x9646;&#x4ED6;&#x4EEC;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x5BC6;&#x7801;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5F20;&#x5C31;&#x7D27;&#x5F20;&#x5730;&#x7B49;&#x5F85;&#x7740;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x505C;&#x5730;&#x67E5;&#x770B;&#x6355;&#x83B7;&#x7684;&#x952E;&#x76D8;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x76F4;&#x5C31;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x51E0;&#x4E2A;&#x53EF;&#x4EE5;&#x7684;&#x952E;&#x76D8;&#x7EC4;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x9A6C;&#x4E0A;&#x901A;&#x8FC7;&#x4EE3;&#x7406;&#x8FDB;&#x5165;&#x4ED6;&#x4EEC;&#x7684;&#x4E3B;&#x673A;&#x8BD5;&#x56FE;&#x8FDB;&#x5165;&#x4ED6;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#xFF0C;&#x90FD;&#x5931;&#x8D25;&#x4E86;&#x3002;</p>
<p>&#x65F6;&#x95F4;&#x5728;&#x6211;&#x4EEC;&#x7126;&#x6025;&#x7684;&#x7B49;&#x5F85;&#x4E2D;&#x6D41;&#x901D;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5230;&#x4E0B;&#x5348;&#x9EC4;&#x660F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7EC8;&#x4E8E;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E00;&#x7EC4;&#x53EF;&#x4EE5;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6211;&#x4EEC;&#x6BEB;&#x65E0;&#x610F;&#x8BC6;&#x4F8B;&#x884C;&#x516C;&#x4E8B;&#x7684;&#x628A;&#x5B83;&#x8F93;&#x5165;&#x5230;&#x767B;&#x9646;&#x7F51;&#x9875;&#xFF0C;&#x5E76;&#x4E14;&#x6572;&#x51FB;&#x4E86;&#x56DE;&#x8F66;&#x3002;</p>
<p>&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x7EC8;&#x4E8E;&#x8FDB;&#x53BB;&#x4E86;&#xFF01;</p>
<p>&#x6211;&#x548C;&#x8001;&#x5F20;&#x695E;&#x4E86;10&#x79D2;&#x949F;&#x90FD;&#x6CA1;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x601D;&#x7EF4;&#x5B9A;&#x5F0F;&#x5DF2;&#x7ECF;&#x5C31;&#x662F;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x6211;&#x4EEC;try&#x7684;&#x6B21;&#x6570;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x601D;&#x7EF4;&#x90FD;&#x673A;&#x68B0;&#x4E86;&#x3002;</p>
<p>10&#x79D2;&#x949F;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5927;&#x558A;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x54C8;&#x54C8;&#x5927;&#x7B11;&#x3002;&#x8001;&#x5F20;&#x51E0;&#x4E4E;&#x624B;&#x821E;&#x8DB3;&#x8E48;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4F60;&#x60F3;&#x6211;&#x4EEC;&#x62FC;&#x547D;&#x4E3A;&#x4E4B;&#x5DE5;&#x4F5C;&#x7684;&#x76EE;&#x7684;&#x7EC8;&#x4E8E;&#x8FBE;&#x5230;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x4E0D;&#x9AD8;&#x5174;&#x5417;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x90FD;&#x56F4;&#x4E0A;&#x6765;&#x4E86;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x4E5F;&#x4ECE;&#x9694;&#x58C1;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x95EE;&#xFF1A;&#x201C;&#x600E;&#x4E48;&#x5566;&#xFF0C;&#x600E;&#x4E48;&#x5566;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x8001;&#x5F20;&#x653B;&#x7834;98&#x7684;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x6F0F;&#x6D1E;&#xFF0C;&#x6211;&#x4EEC;&#x8FDB;&#x5165;&#x4E86;&#x5BF9;&#x65B9;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x201D;&#x6211;&#x5174;&#x594B;&#x7684;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x5BF9;&#x5440;&#xFF0C;&#x6211;&#x548C;&#x5C0F;&#x738B;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x4E86;&#x5BF9;&#x65B9;&#x8FDB;&#x5165;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x4E86;&#x3002;&#x201D;&#x8001;&#x5F20;&#x770B;&#x8D77;&#x6765;&#x5C45;&#x7136;&#x50CF;&#x4E2A;&#x5B69;&#x5B50;&#x3002;</p>
<p>&#x6211;&#x98DE;&#x5FEB;&#x5730;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6572;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;ip&#xFF0C;&#x719F;&#x7EC3;&#x7684;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x4E3B;&#x83DC;&#x5355;&#x8FDB;&#x5165;&#x5927;&#x5BB6;&#x7684;&#x773C;&#x5E18;&#x3002;</p>
<p>&#x5218;&#x961F;&#x957F;&#x548C;&#x5176;&#x4ED6;&#x5144;&#x5F1F;&#x4EEC;&#x695E;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x7ACB;&#x523B;&#x6B22;&#x547C;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x505A;&#x4E86;&#x4EE3;&#x7406;&#xFF1F;&#x201D;&#x5218;&#x961F;&#x957F;&#x58F0;&#x97F3;&#x90FD;&#x6709;&#x70B9;&#x53D1;&#x98A4;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x5BF9;&#x5440;&#x3002;&#x201D;&#x6211;&#x7B54;&#x3002;</p>
<p>&#x5218;&#x961F;&#x957F;&#x9A6C;&#x4E0A;&#x5C31;&#x5230;&#x901A;&#x8BAF;&#x5BA4;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5218;&#x961F;&#x56DE;&#x6765;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5F00;&#x4F1A;&#x3002;&#x5927;&#x5BB6;&#x7684;&#x5174;&#x594B;&#x51E0;&#x4E4E;&#x6D0B;&#x6EA2;&#x5728;&#x6574;&#x4E2A;&#x5C4B;&#x5B50;&#x3002;</p>
<p>&#x8FD9;&#x4E48;&#x4E45;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5C0F;&#x7EC4;&#x7EC8;&#x4E8E;&#x53D6;&#x5F97;&#x7A81;&#x7834;&#x6027;&#x8FDB;&#x5C55;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x975E;&#x5E38;&#x9AD8;&#x5174;&#x3002;</p>
<p>&#x5218;&#x961F;&#x5F00;&#x59CB;&#x90E8;&#x7F72;&#x4E0B;&#x4E00;&#x6B65;&#x7684;&#x8BA1;&#x5212;&#x3002;</p>
<p>&#x867D;&#x7136;&#xFF0C;&#x5218;&#x961F;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x65BD;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x7684;&#x601D;&#x7EF4;&#x4E0D;&#x662F;&#x4E00;&#x822C;&#x5316;&#x7684;&#x3002;</p>
<p>&#x201C;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x7EDD;&#x5BF9;&#x7684;&#x4E3B;&#x52A8;&#x3002;&#x521A;&#x624D;&#x5C0F;&#x738B;&#x83B7;&#x5F97;&#x4E86;&#x5341;&#x51E0;&#x4E2A;&#x5BF9;&#x65B9;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x90E8;&#x7684;ip&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8001;&#x5F20;&#x548C;&#x5C0F;&#x738B;&#x53D1;&#x73B0;&#x7684;&#x6F0F;&#x6D1E;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#xFF0C;&#x4E89;&#x53D6;&#x80FD;&#x653B;&#x514B;&#x66F4;&#x591A;&#x7684;&#x5BF9;&#x65B9;&#x7684;&#x4E0B;&#x5C5E;&#x673A;&#x5668;&#x3002;&#x7136;&#x540E;&#x5EFA;&#x4EE3;&#x7406;&#xFF0C;&#x6355;&#x83B7;&#x5BC6;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x5BF9;&#x5BF9;&#x65B9;&#x7684;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x653B;&#x51FB;&#xFF0C;&#x6211;&#x4EEC;&#x4FDD;&#x6301;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x5C31;&#x597D;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x80FD;&#x770B;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x90E8;&#x5206;&#x7684;&#x884C;&#x52A8;&#x90E8;&#x7F72;&#xFF0C;&#x8FD9;&#x5BF9;&#x6211;&#x4EEC;&#x6F14;&#x4E60;&#x7684;&#x80DC;&#x5229;&#x7684;&#x4F5C;&#x7528;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x3002;</p>
<p>&#x201C;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#xFF0C;&#x9664;&#x4E86;&#x6D3E;&#x4E00;&#x4E2A;&#x4EBA;&#x76D1;&#x89C6;&#x6211;&#x65B9;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x548C;&#x5907;&#x4EFD;&#x7CFB;&#x7EDF;&#x4E4B;&#x5916;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4EBA;&#x5168;&#x90E8;&#x8FDB;&#x653B;&#x5BF9;&#x65B9;&#x7684;&#x4E0B;&#x5C5E;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x540C;&#x65F6;&#x628A;&#x653B;&#x514B;&#x4E86;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x770B;&#x5230;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x60C5;&#x62A5;&#x5168;&#x90E8;&#x4F20;&#x56DE;&#x6765;&#x3002;&#x6211;&#x4EEC;&#x653E;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x90E8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x3002;&#x3002;&#x3002; &#x3002;&#x3002;&#x3002;&#x201D;</p>
<p>&#x5218;&#x961F;&#x957F;&#x8BF4;&#x7684;&#x6CA1;&#x9519;&#xFF0C;&#x4ED6;&#x4EEC;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x4E5F;&#x662F;&#x6709;&#x6743;&#x9650;&#x7684;&#x3002;&#x4E0B;&#x5C5E;&#x5355;&#x4F4D;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x8D44;&#x6599;&#x90FD;&#x80FD;&#x770B;&#x5230;&#xFF0C;&#x90FD;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x548C;&#x81EA;&#x5DF1;&#x90E8;&#x961F;&#x6709;&#x5173;&#x7684;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x5176;&#x4ED6;&#x65E0;&#x5173;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x662F;&#x770B;&#x4E0D;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5149;&#x53EA;&#x6709;&#x4E00;&#x53F0;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x83B7;&#x5F97;&#x592A;&#x591A;&#x60C5;&#x62A5;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x7EE7;&#x7EED;&#x653B;&#x514B;&#x66F4;&#x591A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x5BF9;&#x65B9;&#x4E5F;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x8BA9;&#x4E0B;&#x5C5E;&#x5355;&#x4F4D;&#x77E5;&#x9053;&#x6240;&#x6709;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0B;&#x5C5E;&#x5355;&#x4F4D;&#x5982;&#x679C;&#x88AB;&#x5BF9;&#x65B9;&#x7AEF;&#x4E86;&#xFF0C;&#x540E;&#x679C;&#x4E0D;&#x582A;&#x8BBE;&#x60F3;&#x3002;</p>
<p>&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x4F3C;&#x4E4E;&#x89C9;&#x5F97;&#x80DC;&#x5229;&#x5C31;&#x5728;&#x773C;&#x524D;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5176;&#x5B83;ip&#x8981;&#x653B;&#x9677;&#x4E5F;&#x662F;&#x8FDF;&#x65E9;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5F20;&#x611F;&#x89C9;&#x8F7B;&#x677E;&#xFF0C;&#x6211;&#x751A;&#x81F3;&#x542C;&#x5230;&#x8001;&#x5F20;&#x8FB9;&#x5439;&#x53E3;&#x54E8;&#x8FB9;&#x6572;&#x952E;&#x76D8;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x5144;&#x5F1F;&#x4EEC;&#x90FD;&#x5728;&#x653B;&#x51FB;&#x5176;&#x5B83;ip&#x6240;&#x5728;&#x5B50;&#x7F51;&#x7684;&#x5176;&#x5B83;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4EE5;&#x4FBF;&#x5229;&#x7528;&#x8001;&#x5F20;&#x90A3;&#x4E2A;&#x653B;&#x51FB;&#x7A0B;&#x5E8F;&#xFF0C;&#x53D6;&#x5F97;&#x76EE;&#x6807;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7EDD;&#x5BF9;&#x6743;&#x9650;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x5185;&#x884C;&#xFF0C;&#x65B9;&#x6CD5;&#x4E00;&#x65E6;&#x516C;&#x5F00;&#xFF0C;&#x4E0D;&#x7528;&#x591A;&#x8D39;&#x53E3;&#x820C;&#xFF0C;&#x5404;&#x81EA;&#x90FD;&#x5728;&#x8FDB;&#x653B;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x5218;&#x961F;&#x957F;&#x5728;&#x901A;&#x8BAF;&#x5BA4;&#x548C;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#x5BA4;&#x8FDB;&#x8FDB;&#x51FA;&#x51FA;&#xFF0C;&#x4E0D;&#x505C;&#x5730;&#x4ECE;&#x653B;&#x514B;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x4F20;&#x56DE;&#x5BF9;&#x65B9;&#x7684;&#x5404;&#x79CD;&#x8D44;&#x6599;&#xFF0C;&#x7136;&#x540E;&#x53CA;&#x65F6;&#x7684;&#x5411;&#x4E0A;&#x7EA7;&#x62A5;&#x544A;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x7D27;&#x5F20;&#x800C;&#x6709;&#x5E8F;&#x7684;&#x5FD9;&#x788C;&#x7740;&#x3002;</p>
<p>&#x6377;&#x62A5;&#x4E0D;&#x65AD;&#x4F20;&#x6765;&#xFF0C;&#x5C0F;&#x8D75;&#x548C;&#x5C0F;&#x4F59;&#x90FD;&#x6210;&#x529F;&#x653B;&#x514B;&#x4E86;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8001;&#x5F20;&#x4E5F;&#x653B;&#x514B;&#x4E86;&#x4E00;&#x53F0;&#x3002;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x519B;&#x4EBA;&#x4EEC;&#x4E5F;&#x4E0D;&#x662F;&#x7B49;&#x95F2;&#x4E4B;&#x8F88;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x6210;&#x529F;&#x7684;&#x8FDB;&#x5165;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x5230;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x627E;&#x5230;&#x5341;&#x51E0;&#x4E2A;ip&#x653B;&#x514B;&#x4E86;&#x5927;&#x534A;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x4FE1;&#x606F;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x5FD9;&#x7684;&#x5218;&#x961F;&#x8DD1;&#x8FDB;&#x8DD1;&#x51FA;&#x7684;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x6109;&#x5FEB;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x5BF9;&#x6297;&#x4E2D;&#x53EF;&#x4EE5;&#x8BF4;&#x83B7;&#x5F97;&#x7684;&#x7EDD;&#x5BF9;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x4ED6;&#x4EEC;&#x5BF9;&#x6297;&#x5206;&#x961F;&#x518D;&#x5389;&#x5BB3;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x4E86;&#x4ED6;&#x4EEC;&#x5927;&#x91CF;&#x7684;&#x60C5;&#x62A5;&#x3002;&#x6211;&#x731C;&#x4ED6;&#x4EEC;&#x80AF;&#x5B9A;&#x7EB3;&#x95F7;&#xFF0C;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x4E0D;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x884C;ddos&#x653B;&#x51FB;&#x4E86;&#xFF1F;</p>
<p>&#x4ED6;&#x4EEC;&#x76D1;&#x89C6;&#x8FDE;&#x63A5;&#x4E2D;&#x5168;&#x662F;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;ip&#xFF0C;&#x4ED6;&#x4EEC;&#x5F53;&#x7136;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x4ED6;&#x4EEC;&#x4E0B;&#x5C5E;&#x7684;&#x673A;&#x5668;&#x83B7;&#x5F97;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x60C5;&#x62A5;&#x3002;&#x54C8;&#x54C8;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x8D77;&#x773C;&#x7684;&#x5730;&#x65B9;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5931;&#x8D25;&#x3002;&#x771F;&#x7684;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5B89;&#x5168;&#x65B9;&#x9762;&#xFF0C;&#x4EFB;&#x4F55;&#x5C0F;&#x7684;&#x500F;&#x5FFD;&#xFF0C;&#x90FD;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x81F4;&#x547D;&#x7684;&#x540E;&#x679C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5F88;&#x591A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x5BF9;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x597D;&#x4E8B;&#x3002;&#x5C3D;&#x7BA1;&#x5F88;&#x591A;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x5BF9;&#x4ED6;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x548C;&#x7CFB;&#x7EDF;&#x975E;&#x5E38;&#x719F;&#x6089;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x7684;&#x5FFD;&#x7565;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x79CD;&#x4E0B;&#x7978;&#x6839;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x5F88;&#x591A;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x8BBA;&#x575B;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x6709;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x6709;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;&#x90FD;&#x662F;&#x4FEE;&#x4FEE;&#x8865;&#x8865;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x521D;&#x671F;&#xFF0C;&#x5F88;&#x5C11;&#x4EBA;&#x8003;&#x8651;&#x8FC7;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x8F6F;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#x8BBE;&#x8BA1;&#x975E;&#x5E38;&#x4F18;&#x79C0;&#xFF0C;&#x4F46;&#x662F;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x5DEE;&#x3002;</p>
<p>&#x6211;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x7684;&#x662F;&#x67D0;&#x4E2A;&#x53EB;XX&#x4FDD;&#x9556;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4FDD;&#x62A4;&#x8F6F;&#x4EF6;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x529F;&#x80FD;&#x6211;&#x5F88;&#x4F69;&#x670D;&#xFF0C;&#x6211;&#x4E5F;&#x641E;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x6709;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4EBA;&#x51E0;&#x4E4E;&#x4E0D;&#x8D39;&#x5439;&#x7070;&#x4E4B;&#x529B;&#x7684;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x8D85;&#x7EA7;&#x7528;&#x6237;&#x7684;&#x53E3;&#x4EE4;&#xFF01;</p>
<p>&#x6211;&#x5012;&#x3002;&#x6211;&#x60F3;&#x8BBE;&#x8BA1;&#x4EBA;&#x662F;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x65B9;&#x9762;&#x7684;&#x9AD8;&#x624B;&#xFF0C;&#x800C;&#x4E14;&#x5BF9;&#x5E95;&#x5C42;&#x975E;&#x5E38;&#x7684;&#x6E05;&#x695A;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x7EDD;&#x5BF9;&#x662F;&#x4E2A;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x65B0;&#x624B;&#xFF0C;&#x5B89;&#x5168;&#x610F;&#x8BC6;&#x975E;&#x5E38;&#x8584;&#x5F31;&#xFF0C;&#x79CD;&#x4E0B;&#x8FD9;&#x6837;&#x7684;&#x7978;&#x6839;&#xFF01;</p>
<p>&#x90A3;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x7761;&#x5F97;&#x5F88;&#x9999;&#x3002;</p>
<p>&#x63A5;&#x8FDE;&#x7684;&#x51E0;&#x5929;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x8FC7;&#x7684;&#x975E;&#x5E38;&#x8F7B;&#x677E;&#xFF0C;&#x5218;&#x961F;&#x8138;&#x4E0A;&#x603B;&#x6302;&#x7740;&#x5FAE;&#x7B11;&#x3002;</p>
<p>&#x4ED6;&#x4E0D;&#x505C;&#x7684;&#x7ED9;&#x6211;&#x4EEC;&#x8BF4;&#x6F14;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x84DD;&#x65B9;&#x73B0;&#x5728;&#x638C;&#x63E1;&#x4E86;&#x7EDD;&#x5BF9;&#x7684;&#x4E3B;&#x52A8;&#x6743;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x8FD9;&#x662F;&#x5F53;&#x7136;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x6F14;&#x4E60;&#xFF0C;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x62FC;&#x547D;&#x3002;&#x8C01;&#x638C;&#x63E1;&#x4E86;&#x60C5;&#x62A5;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x8C01;&#x5C31;&#x80DC;&#x5229;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x6BD4;&#x5BF9;&#x65B9;&#x7684;&#x67D0;&#x4E9B;&#x4E0B;&#x5C5E;&#x5355;&#x4F4D;&#x638C;&#x63E1;&#x7684;&#x60C5;&#x62A5;&#x8FD8;&#x591A;&#xFF0C;&#x4F60;&#x8BF4;&#x5BF9;&#x65B9;&#x80FD;&#x73A9;&#x5F97;&#x8FC7;&#x6211;&#x4EEC;&#x84DD;&#x519B;&#x5417;&#xFF1F;</p>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5B50;&#x5C31;&#x6BD4;&#x8F83;&#x597D;&#x8FC7;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x5F00;&#x59CB;&#x653E;&#x677E;&#x4E86;&#x3002;&#x8FDE;&#x8001;&#x5F20;&#x90FD;&#x653E;&#x5F03;&#x4E86;&#x5BF9;&#x5BF9;&#x65B9;&#x670D;&#x52A1;&#x5668;&#x5B9E;&#x65BD;&#x653B;&#x51FB;&#x7684;&#x60F3;&#x6CD5;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x83B7;&#x5F97;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x63A7;&#x5236;&#x6743;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6700;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x7684;&#x90FD;&#x8FBE;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x8FD8;&#x8981;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x8FD9;&#x6837;&#xFF0C;&#x5BF9;&#x65B9;&#x53C8;&#x4E0D;&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x60F3;&#x8981;&#x7684;&#x4E00;&#x5207;&#x3002;</p>
<p>&#x6211;&#x5077;&#x5077;&#x7684;&#x6253;&#x5F00;QQ&#xFF0C;&#x54C7;&#xFF0C;&#x5929;&#xFF0C;&#x6211;&#x5931;&#x8E2A;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x5929;&#xFF0C;QQ&#x4E0A;&#x7684;&#x5C0F;&#x654F;&#x7684;&#x5934;&#x50CF;&#x95EA;&#x52A8;&#x4E0D;&#x505C;&#x3002;&#x8FD8;&#x6709;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x7684;&#x3002;</p>
<p>&#x770B;&#x770B;&#x5C0F;&#x654F;&#x7ED9;&#x6211;&#x7559;&#x7684;&#x8BDD;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x8FD8;&#x597D;&#x5417;&#xFF1F;&#x201C;</p>
<p>&#x201C;&#x5F53;&#x5175;&#x4E0D;&#x80FD;&#x4E0A;&#x7F51;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x600E;&#x4E48;&#x8FD8;&#x4E0D;&#x56DE;&#x8BDD;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x6655;&#xFF0C;&#x624B;&#x673A;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x77ED;&#x6D88;&#x606F;&#x770B;&#x5230;&#x4E86;&#x6CA1;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x54CE;&#x3002;&#x3002;&#x3002;&#x3002;&#x6709;&#x70B9;&#x60F3;&#x4F60;&#x4E86;&#x3002;&#x201D;</p>
<p>&#x201C;&#x4F60;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x56DE;&#x6765;&#x5440;&#xFF1F;&#x201D;</p>
<p>&#x6211;&#x7684;&#x9F3B;&#x5B50;&#x6709;&#x70B9;&#x9178;&#x9178;&#x7684;&#x3002;&#x8FD9;&#x4E48;&#x591A;&#x5929;&#x6765;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x548C;&#x4E16;&#x754C;&#x9694;&#x7EDD;&#x4E86;&#x3002;&#x6211;&#x7684;&#x624B;&#x673A;&#x653E;&#x5230;&#x519B;&#x533A;&#x62DB;&#x5F85;&#x6240;&#x91CC;&#x9762;&#x4E86;&#x3002;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x51C6;&#x5E26;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5C0F;&#x654F;&#x4F60;&#x8FD8;&#x597D;&#x5417;&#xFF1F;&#x6211;&#x5BB6;&#x91CC;&#x7684;&#x90A3;&#x628A;&#x5409;&#x4ED6;&#xFF0C;&#x4E5F;&#x597D;&#x4E45;&#x6CA1;&#x6709;&#x6478;&#x4E86;&#x3002;</p>
<p>&#x7136;&#x540E;&#x770B;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x7684;&#x8BDD;&#x3002;</p>
<p>&#x5979;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x5230;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x5979;&#x95EE;&#x7684;&#x90FD;&#x662F;&#x4E9B;&#x6280;&#x672F;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x770B;&#x5230;&#x6211;&#x6CA1;&#x6709;&#x56DE;&#x8BDD;&#x3002;</p>
<p>&#x540E;&#x9762;&#x8DDF;&#x4E86;&#x51E0;&#x6761;&#xFF1A;&#x201C;&#x4EBA;&#x5462;&#xFF1F;&#xFF1F;&#xFF1F;&#xFF1F;&#x201D;</p>
<p>&#x5C31;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x540E;&#x8BDD;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x98DE;&#x5FEB;&#x7684;&#x7ED9;&#x5C0F;&#x654F;&#x7559;&#x4E0B;&#x201C;&#x6211;&#x5F88;&#x597D;&#xFF0C;&#x8FC7;&#x51E0;&#x5929;&#x5C31;&#x56DE;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x7684;&#x624B;&#x673A;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#xFF0C;QQ&#x4E5F;&#x662F;&#x6211;&#x5077;&#x7740;&#x7528;&#x7684;&#x3002;&#x201D;</p>
<p>&#x7ED9;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x7559;&#x4E0B;&#xFF1A;&#x201C;&#x51FA;&#x5DEE;&#x4E2D;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x201D;</p>
<p>&#x7136;&#x540E;&#x98DE;&#x5FEB;&#x7684;&#x5173;&#x6389;QQ&#x3002;</p>
<p>&#x70B9;&#x5F00;&#x4E00;&#x9996;&#x6C34;&#x6728;&#x7684;&#x5893;&#x5FD7;&#x94ED;&#xFF0C;&#x5F00;&#x59CB;&#x53D1;&#x5446;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x6211;&#x6709;&#x70B9;&#x60F3;&#x5BB6;&#x4E86;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter11.html" class="navigation navigation-prev " aria-label="Previous page: 第十一章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter13.html" class="navigation navigation-next " aria-label="Next page: 第十三章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十二章","level":"1.13","depth":1,"next":{"title":"第十三章","level":"1.14","depth":1,"path":"chapter13.md","ref":"chapter13.md","articles":[]},"previous":{"title":"第十一章","level":"1.12","depth":1,"path":"chapter11.md","ref":"chapter11.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter12.md","mtime":"2017-02-27T04:05:38.444Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

