
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十三章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter14.html" />
    
    
    <link rel="prev" href="chapter12.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十三章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6F14;&#x620F;6">&#x6F14;&#x620F;[6]</h2>
<p>&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x4E2D;&#xFF0C;&#x6211;&#x5230;&#x90E8;&#x961F;&#x5DF2;&#x7ECF;&#x6709;20&#x5929;&#x4E86;&#x5427;&#x3002;&#x5177;&#x4F53;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x5728;&#x610F;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x51E0;&#x5929;&#xFF0C;&#x592A;&#x8FC7;&#x7D27;&#x5F20;&#xFF0C;&#x592A;&#x8FC7;&#x5174;&#x594B;&#x4E86;&#x3002;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#x592A;&#x7D27;&#x5F20;&#xFF0C;&#x6700;&#x8FD1;&#x83B7;&#x5F97;&#x5BF9;&#x65B9;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8BA9;&#x6211;&#x53C8;&#x592A;&#x8FC7;&#x5174;&#x594B;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x548C;&#x8001;&#x5F20;&#x90FD;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x6C47;&#x7F16;&#x7EA7;&#x522B;&#x7684;&#x8C03;&#x8BD5;&#x3002;&#x5176;&#x5B9E;&#x73B0;&#x5728;&#x628A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x53CD;&#x7F16;&#x8BD1;&#x6210;&#x76F8;&#x5E94;&#x8BED;&#x8A00;&#x7684;&#x5DE5;&#x5177;&#x4E5F;&#x4E0D;&#x5C11;&#x3002;&#x5927;&#x90E8;&#x5206;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;c&#x5199;&#x7684;&#x3002;windows&#x4E0B;&#x7684;&#x4E00;&#x4E9B;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x5C11;&#x662F;VB&#x5199;&#x7684;&#x3002;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x4ECE;&#x6E90;&#x7A0B;&#x5E8F;&#x53BB;&#x5206;&#x6790;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x627E;&#x4E0D;&#x5230;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x6F0F;&#x6D1E;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x5728;&#x6D4B;&#x8BD5;&#x9636;&#x6BB5;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x88AB;&#x68C0;&#x67E5;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x628A;&#x4ED6;&#x76F4;&#x63A5;&#x53CD;&#x6210;&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#xFF0C;&#x6709;&#x4E9B;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x6CA1;&#x6709;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#xFF0C;&#x51FD;&#x6570;&#x81EA;&#x5DF1;&#x8BBE;&#x8BA1;&#x7684;bug&#x7B49;&#x7B49;&#x95EE;&#x9898;&#x6742;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x6F0F;&#x6D1E;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x3002;</p>
<p>&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#x771F;&#x7684;&#x662F;&#x82E6;&#x5DEE;&#x4E8B;&#x3002;&#x73B0;&#x5728;&#x65B0;&#x4E00;&#x8F88;&#x7684;&#x540C;&#x884C;&#x4EEC;&#xFF0C;&#x80FD;&#x5403;&#x8FD9;&#x4E2A;&#x82E6;&#x7684;&#x4EBA;&#x786E;&#x5B9E;&#x4E0D;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x4F60;&#x770B;&#x7F51;&#x4E0A;&#x90A3;&#x4E9B;&#x7814;&#x7A76;&#x8C03;&#x8BD5;&#x548C;&#x6C47;&#x7F16;&#x7684;&#x7F51;&#x7AD9;&#x7684;&#x4EBA;&#x6C14;&#xFF0C;&#x4F60;&#x5C31;&#x660E;&#x767D;&#x4E86;&#x3002;&#x6211;&#x4EE5;&#x524D;&#x559C;&#x6B22;&#x7684;&#x51E0;&#x4E2A;&#x7AD9;&#x70B9;&#x5230;&#x73B0;&#x5728;&#x90FD;&#x57FA;&#x672C;&#x8F6C;&#x884C;&#x505A;&#x5176;&#x4ED6;&#x7684;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x6B21;&#x5230;&#x90E8;&#x961F;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x540E;&#x6094;&#x3002;&#x6211;&#x8BA4;&#x8BC6;&#x4E86;&#x4E00;&#x4E2A;&#x5F3A;&#x4EBA;&#xFF0C;&#x8001;&#x5F20;&#x3002;&#x8001;&#x5F20;&#x662F;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x3002;&#x4ED6;&#x6709;&#x7740;&#x65E0;&#x6BD4;&#x7684;&#x8010;&#x529B;&#x548C;&#x624E;&#x5B9E;&#x7684;&#x529F;&#x5E95;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x542C;&#x5230;&#x8001;&#x5F20;&#x5728;&#x6211;&#x9762;&#x524D;&#x5938;&#x8000;&#x4ED6;&#x66FE;&#x7ECF;&#x9ED1;&#x8FC7;&#x4EC0;&#x4E48;&#x7F51;&#x7AD9;&#x3002;&#x771F;&#x7684;&#xFF0C;&#x4E00;&#x6B21;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x8001;&#x5F20;&#x77EE;&#x77EE;&#x7684;&#xFF0C;&#x80D6;&#x80D6;&#x7684;&#xFF0C;&#x6234;&#x6DF1;&#x5EA6;&#x8FD1;&#x89C6;&#x773C;&#x955C;&#x3002;&#x8D70;&#x5728;&#x8857;&#x4E0A;&#xFF0C;&#x4F60;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x4ED6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4ED6;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x3002;</p>
<p>&#x9ED1;&#x5BA2;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x4EA7;&#x751F;&#xFF0C;&#x5C31;&#x4E0D;&#x662F;&#x4EE3;&#x8868;&#x7834;&#x574F;&#xFF0C;&#x4ED6;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x9AD8;&#x8D85;&#x7684;&#x6280;&#x672F;&#x3002;&#x73B0;&#x5728;&#x90A3;&#x4E9B;&#x4EE5;&#x653B;&#x51FB;&#x522B;&#x4EBA;&#x7F51;&#x7AD9;&#xFF0C;&#x7834;&#x574F;&#x522B;&#x4EBA;&#x7684;&#x6570;&#x636E;&#x4E3A;&#x4E50;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x3002;</p>
<p>&#x8001;&#x5F20;&#x624E;&#x5B9E;&#x7684;&#x6C47;&#x7F16;&#x529F;&#x5E95;&#xFF0C;&#x548C;&#x5BF9;windows&#x7CFB;&#x7EDF;&#x7684;&#x9AD8;&#x8D85;&#x7684;&#x8C03;&#x8BD5;&#x80FD;&#x529B;&#xFF0C;&#x8BA9;&#x6211;&#x611F;&#x5230;&#x4F69;&#x670D;&#x3002;&#x5C3D;&#x7BA1;&#xFF0C;&#x6211;&#x5728;&#x8001;&#x5F20;&#x5FC3;&#x4E2D;&#x7684;&#x5730;&#x4F4D;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x8001;&#x5F20;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x8BA9;&#x6211;&#x6700;&#x662F;&#x4F69;&#x670D;&#x7684;&#x5C31;&#x662F;&#x4ED6;&#x90A3;&#x79CD;&#x9AA8;&#x5B50;&#x91CC;&#x9762;&#x900F;&#x9732;&#x51FA;&#x6765;&#x7684;&#x90A3;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x6C14;&#x8D28;&#x3002;</p>
<p>&#x5BF9;&#xFF0C;&#x5C31;&#x662F;&#x6C14;&#x8D28;&#x3002;&#x90A3;&#x79CD;&#x540C;&#x884C;&#x4EBA;&#xFF0C;&#x5373;&#x4F7F;&#x4E0D;&#x8BF4;&#x8BDD;&#x90FD;&#x80FD;&#x611F;&#x53D7;&#x5230;&#x7684;&#x90A3;&#x79CD;&#x5927;&#x5BB6;&#x7684;&#x6C14;&#x8D28;&#xFF01;</p>
<p>&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E13;&#x4E1A;&#x8BA1;&#x7B97;&#x673A;&#x4EBA;&#x7684;&#x90A3;&#x79CD;&#x6C14;&#x8D28;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x6F14;&#x5458;&#x80FD;&#x591F;&#x8868;&#x6F14;&#x51FA;&#x6765;&#x7684;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x73B0;&#x5728;&#x7684;&#x8868;&#x73B0;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x8005;&#x90A3;&#x4E9B;&#x5F71;&#x89C6;&#x4F5C;&#x54C1;&#x65E0;&#x6CD5;&#x53E6;&#x4EBA;&#x6EE1;&#x610F;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x770B;&#x8FC7;&#x4E00;&#x90E8;&#x8FDE;&#x7EED;&#x5267;&#x53EB;&#x300A;&#x4E00;&#x7F51;&#x60C5;&#x6DF1;&#x300B;&#x662F;&#x9646;&#x5E05;&#x54E5;&#x7684;&#x4E3B;&#x6F14;&#xFF0C;&#x81F3;&#x4E8E;&#x91CC;&#x9762;&#x4EBA;&#x5BB6;&#x7F51;&#x7EBF;&#x90FD;&#x6CA1;&#x6709;&#x63D2;&#xFF0C;&#x5C31;&#x9760;&#x4E00;&#x4E2A;email&#x5730;&#x5740;&#xFF0C;&#x5C31;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x767B;&#x9646;&#xFF0C;&#x7136;&#x540E;3&#x6B21;&#x5C31;&#x6210;&#x529F;&#x83B7;&#x5F97;&#x5BC6;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x4E0D;&#x80FD;&#x8FDE;&#x63A5;&#xFF0C;&#x6700;&#x540E;&#x7ED3;&#x8BBA;&#x662F;&#x522B;&#x4EBA;&#x6CA1;&#x6709;&#x5F00;&#x673A;&#xFF01;&#x8FD9;&#x4E9B;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#x3002;&#x5C31;&#x662F;&#x8BBA;&#x6C14;&#x8D28;&#xFF0C;&#x9646;&#x5E05;&#x54E5;&#x4E5F;&#x4E0D;&#x50CF;&#x662F;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x8005;&#x3002;&#x771F;&#x7684;&#x4E0D;&#x50CF;&#xFF0C;&#x90A3;&#x79CD;&#x6C14;&#x8D28;&#x88C5;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x8001;&#x5F20;&#x73B0;&#x5728;&#x975E;&#x5E38;&#x60A0;&#x95F2;&#xFF0C;&#x4E0D;&#x8FC7;&#x5373;&#x4F7F;&#x4ED6;&#x4F11;&#x95F2;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ECD;&#x7136;&#x8BA9;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x4ED6;&#x5728;&#x8BA4;&#x771F;&#x7684;&#x505A;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4ED6;&#x5728;&#x7EE7;&#x7EED;&#x7814;&#x7A76;&#x7EA2;&#x5E3D;&#x5B50;9.0&#x7684;&#x7CFB;&#x7EDF;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7BEE;&#x519B;&#x5728;&#x6F14;&#x4E60;&#x4E2D;&#x53D6;&#x5F97;&#x4E86;&#x7EDD;&#x5BF9;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x7684;&#x60C5;&#x62A5;&#xFF0C;&#x57FA;&#x672C;&#x7EA2;&#x519B;&#x5C31;&#x5904;&#x4E8E;&#x6328;&#x6253;&#x5730;&#x4F4D;&#x3002;&#x8FD9;&#x662F;&#x5218;&#x961F;&#x8BF4;&#x7684;&#x3002;&#x4ED6;&#x8138;&#x4E0A;&#x7B11;&#x5BB9;&#x5F88;&#x707F;&#x70C2;&#x3002;</p>
<p>&#x6211;&#x8FD8;&#x5728;&#x7EE7;&#x7EED;&#x626B;&#x63CF;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x540C;&#x65F6;&#x6211;&#x91CD;&#x70B9;&#x7684;&#x76D1;&#x63A7;&#x6211;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x6211;&#x53EF;&#x4E0D;&#x60F3;&#x8981;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x88AB;&#x5BF9;&#x65B9;&#x6E17;&#x5165;&#x3002;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#xFF0C;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5947;&#x8FF9;&#x3002;&#x5947;&#x8FF9;&#x4E00;&#x822C;&#x51FA;&#x73B0;&#x5728;&#x5F71;&#x89C6;&#x4F5C;&#x54C1;&#x4E2D;&#x3002;&#x751F;&#x6D3B;&#x5C31;&#x662F;&#x751F;&#x6D3B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x53EA;&#x662F;&#x5F00;&#x4E86;80&#xFF0C;&#x5176;&#x4ED6;&#x6211;&#x4EEC;&#x57FA;&#x4E8E;&#x5305;&#x8FC7;&#x6EE4;&#x68C0;&#x67E5;ip&#xFF0C;&#x6709;&#x4EBA;24&#x5C0F;&#x65F6;&#x503C;&#x5B88;&#xFF0C;&#x5BF9;&#x65B9;&#x6CA1;&#x6709;&#x7A81;&#x7834;&#x7684;&#x53EF;&#x80FD;&#x3002;</p>
<p>&#x6211;&#x4F30;&#x8BA1;&#x7EA2;&#x519B;&#x8FD9;&#x4E24;&#x5929;&#x7684;&#x65E5;&#x5B50;&#x4E0D;&#x597D;&#x8FC7;&#xFF0C;&#x4ED6;&#x4EEC;&#x80AF;&#x5B9A;&#x5728;&#x62FC;&#x547D;&#x7684;&#x68C0;&#x67E5;&#x4ED6;&#x4EEC;&#x7684;&#x60C5;&#x62A5;&#x5982;&#x4F55;&#x6CC4;&#x6F0F;&#x51FA;&#x53BB;&#x7684;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x6297;&#x5206;&#x961F;&#x8FD9;&#x51E0;&#x5929;&#x53EF;&#x80FD;&#x5728;&#x62FC;&#x547D;&#x68C0;&#x67E5;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x6E17;&#x5165;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x522B;&#x5FD9;&#x4E86;&#xFF0C;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x795E;&#x4ED9;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x6E17;&#x5165;&#x4F60;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x6B63;&#x5982;&#x4F60;&#x4EEC;&#x65E0;&#x6CD5;&#x6E17;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x642D;&#x4E0A;&#x4E86;&#x4F60;&#x4EEC;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x90E8;&#x7684;&#x4FBF;&#x8F66;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x90A3;&#x4E9B;ip&#xFF0C;&#x6240;&#x4EE5;&#x601D;&#x7EF4;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x5F80;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x60F3;&#x3002;&#x4E00;&#x65E6;&#x601D;&#x7EF4;&#x53D1;&#x751F;&#x504F;&#x5DEE;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x770B;&#x6765;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x60F3;&#x4E5F;&#x80FD;&#x8BA9;&#x4ED6;&#x4EEC;&#x611F;&#x5230;&#x4E0D;&#x53EF;&#x601D;&#x4E49;&#x3002;</p>
<p>&#x65F6;&#x95F4;&#x5C31;&#x8FD9;&#x6837;&#x8FC7;&#x53BB;&#xFF0C;&#x79BB;&#x5F00;&#x6F14;&#x4E60;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x95F4;&#x5269;&#x4E0B;&#x4E86;&#x4E24;&#x5929;&#x4E86;&#xFF01;</p>
<p>&#x6211;&#x4EEC;&#x5C0F;&#x7EC4;&#x7684;&#x4EBA;&#x90FD;&#x611F;&#x5230;&#x9AD8;&#x5174;&#xFF0C;&#x7EC8;&#x4E8E;&#x53EF;&#x4EE5;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x5C4B;&#x5B50;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x4E48;&#x591A;&#x5929;&#xFF0C;&#x6211;&#x4EEC;&#x8DDF;&#x5173;&#x7981;&#x95ED;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x5E78;&#x597D;&#x6211;&#x4EEC;&#x6709;&#x7535;&#x8111;&#x3002;&#x5BF9;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x7535;&#x8111;fans&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x7535;&#x8111;&#x6709;&#x7F51;&#x7EDC;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<p>&#x5218;&#x961F;&#x53C8;&#x5F00;&#x4E86;&#x4E2A;&#x4F1A;&#x3002;&#x8FD9;&#x6B21;&#x5F00;&#x4F1A;&#x6BD4;&#x4E0A;&#x6B21;&#x6C14;&#x6C1B;&#x81EA;&#x7136;&#x4E0D;&#x540C;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x662F;&#x80DC;&#x5229;&#x5728;&#x63E1;&#x4E86;&#x3002;</p>
<p>&#x6C14;&#x6C1B;&#x5F88;&#x8F7B;&#x677E;&#xFF0C;&#x5218;&#x961F;&#x5E03;&#x7F6E;&#x4E86;&#x6700;&#x540E;&#x4E24;&#x5929;&#x7684;&#x90E8;&#x7F72;&#x3002;</p>
<p>&#x6700;&#x540E;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x8BA9;&#x5BF9;&#x65B9;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF01;&#x56E0;&#x4E3A;&#xFF0C;&#x6F14;&#x4E60;&#x57FA;&#x672C;&#x7ED3;&#x675F;&#x4E86;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x60C5;&#x62A5;&#x57FA;&#x672C;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x4E86;&#xFF0C;&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x6211;&#x4EEC;&#x5BF9;&#x6297;&#x5206;&#x961F;&#x7684;&#x5B9E;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x6765;&#x7ED3;&#x675F;&#x6211;&#x4EEC;&#x7684;&#x6F14;&#x4E60;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x5C55;&#x793A;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x529B;&#xFF0C;&#x8BA9;&#x4E0A;&#x7EA7;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x6210;&#x679C;&#xFF01;</p>
<p>&#x5BF9;&#x4E8E;&#x662F;&#x5426;&#x653B;&#x51FB;&#x6211;&#x4EEC;&#x6E17;&#x5165;&#x7684;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x90E8;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5218;&#x961F;&#x72B9;&#x8C6B;&#x4E86;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6700;&#x540E;&#x51B3;&#x5B9A;&#x4E0D;&#x5BF9;&#x6211;&#x4EEC;&#x6E17;&#x5165;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#x3002;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x5728;&#x6700;&#x540E;&#x7684;&#x65F6;&#x5019;&#x5F7B;&#x5E95;&#x6E05;&#x9664;&#x6211;&#x4EEC;&#x7559;&#x4E0B;&#x7684;&#x540E;&#x95E8;&#x3002;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x7559;&#x4E0B;&#x4EFB;&#x4F55;&#x75D5;&#x8FF9;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x5218;&#x961F;&#x957F;&#x53EF;&#x80FD;&#x662F;&#x60F3;&#x4FDD;&#x7559;&#x4E00;&#x70B9;&#x79D8;&#x5BC6;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E0B;&#x6B21;&#x5BF9;&#x6297;&#x7684;&#x6CD5;&#x5B9D;&#x3002;</p>
<p>&#x7F51;&#x7EDC;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x628A;&#x8C1C;&#x5E95;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#xFF0C;&#x4E0B;&#x6B21;&#x4F60;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x7A8D;&#x95E8;&#x4E86;&#x3002;&#x5230;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x4E00;&#x70B9;&#x529E;&#x6CD5;&#x4E5F;&#x6CA1;&#x6709;&#xFF01;</p>
<p>&#x51ED;&#x5FC3;&#x800C;&#x8BBA;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x7684;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x90E8;&#x7684;&#x7A0D;&#x7A0D;&#x52A0;&#x5F3A;&#x76D1;&#x89C6;&#xFF0C;&#x6211;&#x4EEC;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x83B7;&#x5F97;&#x5BF9;&#x65B9;&#x7684;&#x60C5;&#x62A5;&#xFF0C;&#x66F4;&#x4E0D;&#x53EF;&#x80FD;&#x6E17;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x3002;</p>
<p>&#x9ED1;&#x5BA2;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x4F60;&#x653B;&#x5165;&#x4E4B;&#x524D;&#xFF0C;&#x8C01;&#x4E5F;&#x4E0D;&#x6562;&#x4FDD;&#x8BC1;&#x4E00;&#x5B9A;&#x80FD;&#x6210;&#x529F;&#x3002;&#x201C;&#x82CD;&#x8747;&#x4E0D;&#x76EF;&#x65E0;&#x7F1D;&#x7684;&#x86CB;&quot;&#x7528;&#x6765;&#x5F62;&#x5BB9;&#x9ED1;&#x5BA2;&#x548C;&#x7F51;&#x7AD9;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x771F;&#x662F;&#x592A;&#x8D34;&#x5207;&#x4E86;&#x3002;&#x5C3D;&#x7BA1;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x4E0D;&#x662F;&#x82CD;&#x8747;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x6211;&#x73B0;&#x5728;&#x5728;&#x8003;&#x8651;&#x5982;&#x4F55;&#x76F4;&#x63A5;&#x7ED9;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x8D77;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x3002;&#x5982;&#x679C;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x653B;&#x514B;&#x7684;&#x673A;&#x5668;&#x5750;&#x8DF3;&#x677F;&#xFF0C;&#x4E0D;&#x8981;&#x8BF4;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x5C31;&#x662F;&#x6E17;&#x5165;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x52BF;&#x5FC5;&#x4F1A;&#x7ED9;&#x5BF9;&#x65B9;&#x7559;&#x4E0B;&#x75D5;&#x8FF9;&#xFF0C;&#x5BF9;&#x65B9;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x4ED6;&#x4EEC;&#x80AF;&#x5B9A;&#x4F1A;&#x53D1;&#x73B0;&#x6765;&#x81EA;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;ip&#x7684;&#x653B;&#x51FB;&#x8BB0;&#x5F55;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x662F;&#x66B4;&#x9732;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x624B;&#x6BB5;&#x5417;&#xFF1F;&#x5218;&#x961F;&#x8981;&#x6211;&#x4EEC;&#x4E0D;&#x8981;&#x66B4;&#x9732;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x6837;&#x662F;&#x884C;&#x4E0D;&#x901A;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5373;&#x4F7F;&#x4F7F;&#x7528;&#x8001;&#x5F20;&#x53D1;&#x73B0;&#x7684;&#x7EA2;&#x5E3D;&#x5B50;9&#x7684;&#x5185;&#x6838;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#xFF0C;&#x548C;&#x6211;&#x53D1;&#x73B0;&#x7684;apache&#x7684;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x5B9E;&#x73B0;&#x653B;&#x51FB;&#x3002;&#x56E0;&#x4E3A;&#x5BF9;&#x65B9;&#x5DF2;&#x7ECF;&#x641E;&#x4E86;&#x5305;&#x8FC7;&#x6EE4;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5B89;&#x88C5;&#x7684;&#x662F;&#x7684;&#x4E00;&#x4E2A;&#x9632;&#x706B;&#x5899;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x5BF9;&#x65B9;&#x5BF9;&#x6211;&#x4EEC;&#x7684;ip&#x5305;&#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x4E86;&#x8FC7;&#x6EE4;&#x3002;&#x66F4;&#x672C;&#x5C31;&#x4E0D;&#x54CD;&#x5E94;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x6EA2;&#x51FA;&#x5F53;&#x7136;&#x4E5F;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x8981;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x6211;&#x7684;&#x529E;&#x6CD5;&#x591A;&#x7684;&#x662F;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4F7F;&#x7528;tracert&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x5BF9;&#x65B9;&#x670D;&#x52A1;&#x5668;&#x6240;&#x5728;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x5730;&#x5740;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x7ECF;&#x8FC7;&#x7684;&#x8282;&#x70B9;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x76F4;&#x63A5;&#x653B;&#x51FB;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x53EA;&#x8981;&#x4ED6;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x4E0D;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x5475;&#x5475;&#x4ED6;&#x7684;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5916;&#x9762;&#x4E5F;&#x5C31;&#x65AD;&#x4E86;&#x3002;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x5176;&#x4ED6;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6548;&#x679C;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x3002;&#x53EA;&#x662F;&#xFF0C;&#x90A3;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x8F6C;&#x53D1;&#x7684;&#x6240;&#x6709;&#x673A;&#x5668;&#x90FD;&#x4E0D;&#x80FD;&#x4E0A;&#x7F51;&#xFF0C;&#x6253;&#x51FB;&#x9762;&#x592A;&#x5149;&#xFF0C;&#x662F;&#x4E0B;&#x7B56;&#x3002;&#x4E0D;&#x5230;&#x4E07;&#x4E0D;&#x5F97;&#x4EE5;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x4F7F;&#x7528;&#x8FD9;&#x62DB;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x56FD;&#x5185;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x5176;&#x5B9E;&#x8DEF;&#x7531;&#x5668;&#x662F;&#x4E2A;&#x5B89;&#x5168;&#x7684;&#x5927;&#x9690;&#x60A3;&#x3002;&#x7531;&#x4E8E;&#x73B0;&#x5728;&#x7684;&#x90A3;&#x4E9B;&#x559C;&#x6B22;&#x641E;&#x7834;&#x574F;&#x7684;&#x201C;&#x5047;&#x9ED1;&#x5BA2;&#x201D;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x7F51;&#x7EDC;&#x77E5;&#x8BC6;&#x5E76;&#x4E0D;&#x6DF1;&#x539A;&#xFF0C;&#x8FD8;&#x6709;&#x4ED6;&#x4EEC;&#x4E00;&#x822C;&#x7684;&#x4EBA;&#x90FD;&#x65E0;&#x6CD5;&#x63A5;&#x89E6;&#x5230;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x4E86;&#x89E3;&#x51E0;&#x4E4E;&#x7B49;&#x4E8E;0&#xFF0C;&#x5F53;&#x7136;&#x66F4;&#x8C08;&#x4E0D;&#x5230;&#x653B;&#x51FB;&#x3002;&#x7F51;&#x4E0A;&#x7684;&#x653B;&#x51FB;&#x6559;&#x7A0B;&#x80FD;&#x7528;&#x7684;&#x51E0;&#x4E4E;&#x90FD;&#x662F;windows&#x4E0B;&#x7684;&#x653B;&#x51FB;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x539F;&#x56E0;&#x4E86;&#x3002;&#x56E0;&#x4E3A;windows&#x5728;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x5230;&#x5904;&#x90FD;&#x662F;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x8BF4;windows&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x597D;&#x50CF;&#x4E5F;&#x4E0D;&#x592A;&#x516C;&#x5E73;&#xFF0C;&#x6811;&#x5927;&#x62DB;&#x98CE;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x6211;&#x60F3;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x90FD;&#x61C2;&#x3002;&#x3000;&#x8DEF;&#x7531;&#x5668;&#x91CC;&#x9762;&#x5176;&#x5B9E;&#x4E5F;&#x6709;&#x56FA;&#x5316;&#x7684;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x4ED6;&#x7684;&#x8BBE;&#x8BA1;&#x6C34;&#x5E73;&#xFF0C;&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x6BD4;&#x8D77;windows&#x6765;&#x8BF4;&#xFF0C;&#x90FD;&#x8981;&#x7B80;&#x964B;&#x7684;&#x591A;&#x3002;&#x4ED6;&#x7684;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x6BD4;&#x8D77;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x5DEE;&#x8DDD;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x4ED6;&#x529F;&#x80FD;&#x5355;&#x4E00;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x517C;&#x5BB9;&#x6027;&#x548C;&#x6613;&#x7528;&#x6027;&#x7B49;&#xFF0C;&#x6838;&#x5FC3;&#x56FA;&#x5316;&#xFF0C;&#x4E00;&#x822C;&#x7BA1;&#x7406;&#x5458;&#x4E0D;&#x5141;&#x8BB8;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#xFF0C;&#x52A0;&#x4E0A;&#x4E86;&#x89E3;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x4EBA;&#x5C11;&#x7684;&#x5F88;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x7684;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x8FD8;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8868;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x6709;&#x65F6;&#x5019;&#x5076;&#x5C14;&#x51FA;&#x73B0;&#x6B7B;&#x673A;&#x72B6;&#x6001;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x4E00;&#x822C;reboot&#x4ED6;&#x540E;&#xFF0C;&#x4E5F;&#x5C31;ok&#x4E86;&#x3002;</p>
<p>&#x4E5F;&#x6B63;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#xFF0C;&#x5373;&#x4F7F;&#x5F88;&#x591A;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x9664;&#x4E86;&#x719F;&#x6089;&#x90A3;&#x4E9B;&#x547D;&#x4EE4;&#x5916;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x641E;&#x4E0D;&#x6E05;&#x695A;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x56E0;&#x4E3A;&#x8DEF;&#x7531;&#x5668;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x5382;&#x5BB6;&#x8D1F;&#x8D23;&#x7EF4;&#x62A4;&#x7684;&#x3002;</p>
<p>&#x8FDE;unix&#x90FD;&#x6F0F;&#x6D1E;&#x4E0D;&#x5C11;&#xFF0C;&#x4F55;&#x51B5;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF1F;&#x6240;&#x4EE5;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x6F0F;&#x6D1E;&#x5176;&#x5B9E;&#x771F;&#x7684;&#x4E0D;&#x5C11;&#x3002;&#x5F53;&#x7136;&#x8DEF;&#x7531;&#x5668;&#x4E00;&#x822C;&#x662F;&#x65E0;&#x6CD5;&#x6E17;&#x5165;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#xFF0C;&#x4E00;&#x822C;&#x7BA1;&#x7406;&#x5458;&#x90FD;&#x4E0D;&#x4F1A;&#x5F00;&#x7684;&#x3002;&#x4F46;&#x662F;&#x8BA9;&#x8DEF;&#x7531;&#x5668;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x7684;&#x6F0F;&#x6D1E;&#x771F;&#x662F;&#x4E0D;&#x5C11;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x6211;&#x4EEC;&#x56FD;&#x5185;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x6709;&#x4E2A;&#x6BDB;&#x75C5;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F80;&#x5F80;&#x5BF9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8865;&#x4E01;&#x6BD4;&#x8F83;&#x6709;&#x610F;&#x8BC6;&#x6765;&#x8865;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x8DEF;&#x7531;&#x5668;&#x7684;OS&#x7684;&#x8865;&#x4E01;&#xFF0C;&#x5F88;&#x591A;&#x7BA1;&#x7406;&#x5458;&#x66F4;&#x672C;&#x90FD;&#x6CA1;&#x6709;&#x7BA1;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x8FD9;&#x6837;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x8BA9;&#x4ED6;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x771F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x975E;&#x5E38;&#x5927;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x4E00;&#x822C;&#x4F60;&#x653B;&#x51FB;&#x8FC7;&#x540E;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x4E00;&#x822C;&#x4F1A;&#x8BA4;&#x4E3A;&#x662F;&#x7684;&#x4E00;&#x822C;&#x6027;&#x6B7B;&#x673A;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;reboot&#x4E86;&#x4E8B;&#x3002;&#x6839;&#x672C;&#x4E0D;&#x4F1A;&#x53BB;&#x627E;&#x539F;&#x56E0;&#xFF0C;&#x66F4;&#x4E0D;&#x4F1A;&#x6000;&#x7591;&#x662F;&#x6709;&#x4EBA;&#x653B;&#x51FB;&#x3002;</p>
<p>&#x6211;&#x66FE;&#x7ECF;&#x7528;&#x8FC7;&#x4E00;&#x4E2A;&#x67D0;&#x901A;&#x516C;&#x53F8;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x7ECF;&#x5E38;&#x6B7B;&#x6389;&#x3002;&#x540E;&#x6765;&#x6211;&#x53D1;&#x73B0;&#x4ED6;&#x4EEC;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x6709;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x6F0F;&#x6D1E;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x6709;&#x4EBA;&#x653B;&#x51FB;&#x9020;&#x6210;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6BCF;&#x6B21;&#x5BA2;&#x6237;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x90FD;&#x662F;&#x8BA4;&#x4E3A;&#x53EF;&#x80FD;&#x4E0D;&#x7A33;&#x5B9A;&#x9020;&#x6210;&#x7684;&#x3002;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x90A3;&#x4E2A;&#x7F51;&#x7EDC;&#x8FD8;&#x7ECF;&#x5E38;&#x65AD;&#x8C03;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x7BA1;&#x7406;&#x5458;reboot&#x8DEF;&#x7531;&#x5668;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x4F7F;&#x7528;&#x8DEF;&#x7531;&#x5668;&#x653B;&#x51FB;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x6210;&#x529F;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x597D;&#x8981;&#x7EE7;&#x7EED;&#x60F3;&#x529E;&#x6CD5;&#xFF01;</p>
<p>&#x4E5F;&#x8BB8;&#x662F;&#x7684;&#x53D7;&#x5230;&#x521A;&#x624D;&#x601D;&#x7EF4;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x626B;&#x6211;&#x4EEC;&#x5BF9;&#x624B;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6240;&#x5728;&#x5B50;&#x7F51;&#x7684;&#x5176;&#x4ED6;ip&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x5728;&#x90A3;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x6240;&#x5728;&#x7684;&#x5176;&#x4ED6;&#x5B50;&#x7F51;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#xFF0C;&#x653B;&#x51FB;&#x4ED6;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x81EA;&#x5DF1;&#x548C;&#x670D;&#x52A1;&#x5668;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5B50;&#x7F51;&#xFF0C;&#x8FD9;&#x6837;&#x653B;&#x51FB;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C06;&#x5927;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;arp&#x6B3A;&#x9A97;&#x653B;&#x51FB;&#x5BF9;&#x57FA;&#x4E8E;&#x4EA4;&#x6362;&#x7684;&#x7F51;&#x7EDC;&#x6548;&#x679C;&#x975E;&#x5E38;&#x660E;&#x663E;&#xFF0C;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x8FD8;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x6253;&#x5B9A;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x626B;&#x63CF;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B50;&#x7F51;&#x660E;&#x663E;&#x53EF;&#x80FD;&#x662F;&#x7684;&#x519B;&#x961F;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x9632;&#x62A4;&#x90FD;&#x6BD4;&#x8F83;&#x4E25;&#x683C;&#x3002;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x626B;&#x5230;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x4E0D;&#x8FC7;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;2000&#x673A;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#x5F00;&#x7684;&#x7AEF;&#x53E3;&#x4E0D;&#x5C11;&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED9;&#x6211;&#x4E86;&#x5E0C;&#x671B;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>135&#x548C;139&#x7AEF;&#x53E3;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x90FD;&#x5F00;&#x4E86;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x641E;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x60F3;&#x6E17;&#x5165;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x5FC5;&#x987B;&#x8981;&#x53E6;&#x5916;&#x627E;&#x5176;&#x4ED6;&#x9014;&#x5F84;&#x3002;</p>
<p>&#x7EC8;&#x4E8E;&#x6211;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x627E;&#x5230;&#x4E00;&#x4E2A;1433&#x7AEF;&#x53E3;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x731C;&#x9519;&#x7684;&#x8BDD;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;ms sql server&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6709;&#x6267;&#x884C;&#x672C;&#x5730;&#x547D;&#x4EE4;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x5982;&#x679C;&#x5BC6;&#x7801;&#x88AB;&#x6211;&#x7834;&#x8BD1;&#x7684;&#x8BDD;&#xFF0C;&#x4ED6;&#x5C31;&#x6B7B;&#x5B9A;&#x4E86;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x540E;&#x8BB0;&#xFF1A;&#x6211;&#x770B;&#x4E86;&#x770B;&#x4ECA;&#x5929;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x89C9;&#x5F97;&#x4E0D;&#x50CF;&#x5C0F;&#x8BF4;&#x4E86;&#x3002;&#x5B8C;&#x5168;&#x662F;&#x4E00;&#x7BC7;&#x9ED1;&#x5BA2;&#x6559;&#x7A0B;&#x3002;&#x54CE;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x975E;&#x5E38;&#x9057;&#x61BE;&#x3002;&#x7531;&#x4E8E;&#x8003;&#x8651;&#x5230;&#x7F51;&#x53CB;&#x4EEC;&#x63D0;&#x51FA;&#x7684;&#x5F88;&#x591A;&#x89C2;&#x70B9;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x5C31;&#x662F;&#x5728;&#x8BB2;&#x6280;&#x672F;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x60F3;&#x8981;&#x7684;&#x3002;&#x4EE5;&#x540E;&#x6280;&#x672F;&#x7684;&#x4E1C;&#x897F;&#x6211;&#x8981;&#x6E10;&#x6E10;&#x6DE1;&#x5316;&#xFF0C;&#x6211;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8BA9;&#x7A0D;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x77E5;&#x8BC6;&#x7684;&#x4EBA;&#x80FD;&#x770B;&#x61C2;&#x8FD9;&#x7BC7;&#x5C0F;&#x8BF4;&#xFF0C;&#x80FD;&#x559C;&#x6B22;&#x8FD9;&#x7BC7;&#x5C0F;&#x8BF4;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter12.html" class="navigation navigation-prev " aria-label="Previous page: 第十二章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter14.html" class="navigation navigation-next " aria-label="Next page: 第十四章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十三章","level":"1.14","depth":1,"next":{"title":"第十四章","level":"1.15","depth":1,"path":"chapter14.md","ref":"chapter14.md","articles":[]},"previous":{"title":"第十二章","level":"1.13","depth":1,"path":"chapter12.md","ref":"chapter12.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter13.md","mtime":"2017-02-27T04:06:02.984Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

