
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第二章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter3.html" />
    
    
    <link rel="prev" href="chapter1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第二章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6211;&#x653B;&#x7834;&#x4E86;&#x7F8E;&#x519B;&#x6D77;&#x519B;&#x7F51;&#x7AD9;-1">&#x6211;&#x653B;&#x7834;&#x4E86;&#x7F8E;&#x519B;&#x6D77;&#x519B;&#x7F51;&#x7AD9; [1]</h2>
<p>&#x8BA1;&#x7B97;&#x673A;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x6570;&#x5B57;&#x8FD8;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x8DF3;&#x52A8;&#xFF0C;&#x6211;&#x7684;&#x8FD0;&#x6C14;&#x603B;&#x662F;&#x4E0D;&#x597D;&#xFF0C;&#x8FD9;&#x8F88;&#x5B50;&#x4E2D;&#x8FC7;&#x6700;&#x5927;&#x7684;&#x5956;&#x5C31;&#x662F;&#x5B89;&#x6170;&#x5956;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x603B;&#x662F;&#x6CA1;&#x6709;&#x78B0;&#x5230;&#x8FC7;&#x6D4B;&#x8BD5;&#x51E0;&#x5206;&#x949F;&#xFF0C;&#x5BC6;&#x7801;&#x5C31;&#x8DF3;&#x51FA;&#x6765;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x73B0;&#x5728;&#x6211;&#x90FD;&#x4E60;&#x60EF;&#x4E86;&#x3002;&#x7535;&#x89C6;&#x592A;&#x96BE;&#x770B;&#xFF0C;&#x4E2D;&#x592E;&#x67D0;&#x53F0;&#x6B63;&#x5728;&#x4F5C;&#x4E00;&#x4E2A;&#x8282;&#x76EE;&#xFF0C;&#x4E13;&#x95E8;&#x4ECB;&#x7ECD;&#x4ED6;&#x4EEC;&#x8282;&#x76EE;&#x4E2D;&#x7684;&#x521B;&#x65B0;&#xFF0C;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x8BA9;&#x4E00;&#x4E2A;&#x6B4C;&#x661F;&#x53BB;&#x5356;&#x62A5;&#x7EB8;&#xFF0C;&#x7136;&#x540E;&#x8EB2;&#x5728;&#x8F66;&#x91CC;&#x62CD;&#x90A3;&#x4E2A;&#x6B4C;&#x661F;&#x7684;&#x79CD;&#x79CD;&#x7B11;&#x8BDD;&#xFF0C;&#x5E76;&#x628A;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#x5927;&#x7B11;&#x7684;&#x955C;&#x5934;&#x548C;&#x6B4C;&#x661F;&#x7684;&#x955C;&#x5934;&#x4E00;&#x8D77;&#x64AD;&#x51FA;&#xFF0C;&#x4ED6;&#x4EEC;&#x79F0;&#x4E3A;&#x201C;&#x91CD;&#x5927;&#x521B;&#x65B0;&#x201D;&#x3002;&#x4E92;&#x76F8;&#x62CD;&#x9A6C;&#x5C41;&#x62CD;&#x7684;&#x90A3;&#x4E2A;&#x6076;&#x5FC3;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x8FD9;&#x4E9B;&#x624B;&#x6BB5;&#x90FD;&#x662F;&#x53F0;&#x6E7E;&#x7EFC;&#x827A;&#x8282;&#x76EE;&#x7528;&#x7684;&#x4E0D;&#x80FD;&#x518D;&#x7528;&#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x662F;&#x201C;&#x91CD;&#x5927;&#x521B;&#x65B0;&#x201D;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4ED6;&#x4EEC;&#x8138;&#x76AE;&#x539A;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x538B;&#x6839;&#x5C31;&#x4E0D;&#x770B;&#x53F0;&#x6E7E;&#x7684;&#x8282;&#x76EE;&#xFF0C;&#x53EF;&#x80FD;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#x592A;&#x4F4E;&#x7EA7;&#x5427;&#x3002;&#x5C31;&#x8DDF;&#x5F20;&#x96C6;&#x4E2D;&#x6CA1;&#x770B;&#x8FC7;&#x91D1;&#x5EB8;&#x4E5F;&#x6562;&#x62CD;&#x91D1;&#x5EB8;&#x4E00;&#x6837;&#xFF0C;&#x8BA9;&#x4EBA;&#x771F;&#x60F3;&#x63CD;&#x4ED6;&#x4E2B;&#x7684;&#xFF01;</p>
<p>&#x7B97;&#x4E86;&#xFF0C;&#x628A;&#x53F0;&#x8F6C;&#x5230;&#x52A8;&#x7269;&#x4E16;&#x754C;&#x5427;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x505A;&#x5F97;&#x6700;&#x597D;&#x7684;&#x8282;&#x76EE;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x8282;&#x76EE;&#x4E86;&#xFF0C;&#x81F3;&#x5C11;&#x52A8;&#x7269;&#x4E0D;&#x4F1A;&#x88C5;&#xFF0C;&#x8BE5;&#x4F5C;&#x4EC0;&#x4E48;&#x5C31;&#x4F5C;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x6B63;&#x65E0;&#x804A;&#x95F4;&#xFF0C;&#x624B;&#x673A;&#x5600;&#x5600;&#x7684;&#x54CD;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x6709;&#x77ED;&#x4FE1;&#x3002;&#x662F;&#x5C0F;&#x654F;&#x6765;&#x7684;&#x3002;&#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4E0A;QQ&#xFF0C;&#x53C8;&#x5E72;&#x4EC0;&#x4E48;&#x574F;&#x4E8B;&#x5462;&#xFF1F;&#x201D;&#x5973;&#x5B69;&#x5B50;&#x5C31;&#x662F;&#x602A;&#xFF0C;&#x5C0F;&#x654F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x5979;&#x5C31;&#x662F;&#x4E0D;&#x76F4;&#x63A5;&#x7ED9;&#x6211;&#x62E8;&#x7535;&#x8BDD;&#xFF0C;&#x603B;&#x662F;&#x53D1;&#x77ED;&#x4FE1;&#xFF0C;&#x6574;&#x5929;&#x5929;&#x53D1;&#x7A00;&#x5947;&#x53E4;&#x602A;&#x7684;&#x3002;&#x6709;&#x65F6;&#x5019;&#x4E50;&#x6B7B;&#x4F60;&#x3002;&#x8BB0;&#x5F97;&#x4E0A;&#x6B21;&#x6625;&#x8282;&#xFF0C;&#x6211;&#x5728;&#x7236;&#x6BCD;&#x5BB6;&#x91CC;&#x8FC7;&#x5E74;&#xFF0C;&#x5927;&#x5E74;&#x4E09;&#x5341;&#x665A;&#x4E0A;&#x5FEB;&#x5230;12&#x70B9;&#x65F6;&#x5019;&#xFF0C;&#x77ED;&#x4FE1;&#x5230;&#x4E86;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x62DC;&#x5E74;&#x7684;&#x8BDD;&#x4E4B;&#x7C7B;&#x7684;&#x5566;&#xFF0C;&#x6211;&#x6F2B;&#x4E0D;&#x7ECF;&#x5FC3;&#x7684;&#x770B;&#x53BB;&#xFF1A;&#x5929;&#x82CD;&#x82CD;&#xFF0C;&#x91CE;&#x832B;&#x832B;&#xFF0C;&#x6211;&#x4EEC;&#x5408;&#x4F5C;&#x5C31;&#x662F;&#x5F3A;&#x3002;&#x4ECA;&#x665A;&#x7ED3;&#x4F34;&#x53BB;&#x62A2;&#x94F6;&#x884C;&#x3002;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x5F00;&#x59CB;&#x7EB3;&#x95F7;&#x8D77;&#x6765;&#xFF0C;&#x8C01;&#x5440;&#xFF0C;&#x8FD9;&#x662F;&#xFF1F;&#x7EE7;&#x7EED;&#x770B;&#xFF1A;&#x63A5;&#x5934;&#x6697;&#x53F7;&#x662F;&#xFF1A;....happy new year&#xFF01;&#x5C0F;&#x654F;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x9760;&#xFF0C;&#x8FD9;&#x4E2A;&#x6B7B;&#x59AE;&#x5B50;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x5750;&#x7FFB;&#x5728;&#x5730;&#x3002;5&#x5206;&#x949F;&#x624D;&#x56DE;&#x8FC7;&#x795E;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x75AF;&#x72C2;&#x628A;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x53D1;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x4EBA;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x90A3;&#x4E2A;&#x6B7B;&#x59AE;&#x5B50;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x5979;&#x5C45;&#x7136;&#x8FD8;&#x4E00;&#x672C;&#x6B63;&#x7ECF;&#x5730;&#x95EE;&#x6211;&#x6536;&#x5230;&#x5979;&#x7684;&#x795D;&#x8D3A;&#x6CA1;&#x6709;&#xFF1F;&#x6211;&#x6655;&#xFF0C;&#x5F53;&#x65F6;&#x6068;&#x4E0D;&#x5F97;&#x4ECE;&#x7535;&#x8BDD;&#x7EBF;&#x4E0A;&#x4F38;&#x624B;&#x8FC7;&#x53BB;&#x5361;&#x5979;&#x767D;&#x6670;&#x7684;&#x8116;&#x5B50;&#xFF0C;&#x5FC3;&#x91CC;&#x90A3;&#x79CD;&#x751C;&#x751C;&#x611F;&#x89C9;&#x60F3;&#x6765;&#x8FD8;&#x662F;&#x9676;&#x9189;&#x7684;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x5594;&#xFF0C;&#x5C0F;&#x654F;&#x5728;QQ&#x4E0A;&#x7B49;&#x6211;&#x5462;&#x3002;&#x90A3;&#x53F0;amd&#x5C31;&#x8BA9;&#x5B83;&#x5DE5;&#x4F5C;&#x5427;&#x3002;&#x4E0A;&#x7F51;&#x6211;&#x7684;ibm&#x7B14;&#x8BB0;&#x672C;&#x592A;&#x7406;&#x60F3;&#x4E86;&#x3002;&#x628A;&#x6211;&#x7684;ibm&#x7684;&#x672C;&#x672C;&#xFF0C;&#x642C;&#x5230;&#x8336;&#x51E0;&#x4E0A;&#xFF0C;&#x5F00;&#x59CB;&#x542F;&#x52A8;&#x4E0A;&#x7F51;&#x3002;ibm&#x5C3D;&#x7BA1;&#x53EA;&#x662F;&#x4E00;&#x4E2A;c500&#x7684;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x7F51;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x3002;ibm&#x7684;&#x672C;&#x672C;&#x786E;&#x5B9E;&#x725B;&#xFF0C;3&#x5E74;&#x591A;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x672C;&#x672C;&#x4E00;&#x70B9;&#x95EE;&#x9898;&#x90FD;&#x6CA1;&#x6709;&#x51FA;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x4E00;&#x70B9;&#x90FD;&#x6CA1;&#x6709;&#x51FA;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD8;&#x6454;&#x8FC7;3&#x6B21;&#x3002;&#x4E0D;&#x4F69;&#x670D;&#x4E0D;&#x884C;&#xFF0C;&#x4E00;&#x5230;&#x590F;&#x5929;&#x3002;&#x5176;&#x4ED6;&#x672C;&#x672C;&#x57FA;&#x672C;&#x4E0D;&#x6562;&#x653E;&#x819D;&#x76D6;&#x4E0A;&#xFF0C;ibm&#x53EF;&#x4EE5;&#xFF0C;&#x6E29;&#x6E29;&#x70ED;&#xFF0C;&#x6563;&#x70ED;&#x6280;&#x672F;&#x786E;&#x5B9E;&#x72EC;&#x5230;&#x3002;</p>
<p>&#x4E00;&#x5F00;QQ&#xFF0C;&#x5C0F;&#x654F;&#x7684;&#x5934;&#x50CF;&#x72C2;&#x95EA;&#xFF0C;&#x770B;&#x6765;&#x547C;&#x4E86;&#x6211;&#x4E00;&#x9635;&#x4E86;&#x3002;&#x5979;&#x7684;&#x7F51;&#x540D;&#x53EB;MM&#xFF0C;&#x672C;&#x6765;&#x662F;&#x654F;&#x654F;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x6211;&#x5BF9;&#x5979;&#x7684;&#x6635;&#x79F0;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x7F51;&#x4E0A;&#x7684;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x59B9;&#x59B9;&#x7684;&#x610F;&#x601D;&#x3002;&#x5979;&#x4E5F;&#x4E50;&#x610F;&#xFF0C;&#x8BF4;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x4E00;&#x770B;&#x5C31;&#x77E5;&#x9053;&#x662F;&#x7F8E;&#x5973;&#xFF0C;&#x6BD4;&#x8F83;&#x53EF;&#x4EE5;&#x5438;&#x5F15;&#x5E05;&#x54E5;&#x3002;&#x6211;&#x5DEE;&#x70B9;&#x5410;&#x8840;&#x3002;&#x6211;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x53EB;GG&#xFF0C;&#x672C;&#x6765;&#x6211;&#x4EE5;&#x524D;&#x7684;&#x540D;&#x5B57;&#x662F;&#x53EB;superman&#x7684;&#xFF0C;&#x8FD9;&#x4E48;&#x9633;&#x521A;&#x7684;&#x540D;&#x5B57;&#x4E3A;&#x4E86;&#x5979;&#xFF0C;&#x4E5F;&#x987E;&#x4E0D;&#x5F97;&#x4E86;&#x3002;&#x5979;&#x8001;&#x662F;&#x53D6;&#x7B11;&#x6211;&#x5E94;&#x8BE5;GGW&#xFF0C;&#x5C31;&#x662F;&#x683C;&#x683C;&#x5DEB;&#x3002;&#x6211;&#x7FFB;&#x767D;&#x773C;&#xFF0C;&#x5979;&#x5C31;&#x7B11;&#x3002;</p>
<p>&#x6211;&#x7ED9;&#x5979;&#x53D1;&#x6D88;&#x606F;&#xFF1A;&#x201C;&#x5E72;&#x4EC0;&#x4E48;&#x5440;&#xFF1F;&#x4E0D;&#x80FD;&#x6253;&#x7535;&#x8BDD;&#x5417;&#xFF1F;&#x201D;&#x3002;&#x5979;&#x8BF4;&#xFF1A;&#x201C;&#x54FC;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4F60;&#x6700;&#x559C;&#x6B22;&#x7684;&#x65B9;&#x5F0F;&#x5417;&#xFF1F;&#x201D;&#x6211;&#x8BF4;&#xFF1A;&#x201C;&#x563F;&#x563F;&#x201D;&#x3002;&#x201C;&#x660E;&#x5929;&#x80FD;&#x4E0D;&#x80FD;&#x966A;&#x6211;&#x53BB;&#x8DDF;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x53BB;&#x914D;&#x4E2A;&#x7535;&#x8111;&#x5440;&#xFF1F;&#x201D;&#x6211;&#x77E5;&#x9053;&#x662F;&#x4E0D;&#x80FD;&#x62D2;&#x7EDD;&#x7684;&#x3002;&#x60F3;&#x60F3;&#x660E;&#x5929;&#x8BA1;&#x7B97;&#x673A;&#x5E94;&#x8BE5;&#x8FD8;&#x5728;&#x7B97;&#x5BC6;&#x7801;&#xFF0C;&#x53CD;&#x6B63;&#x65E0;&#x804A;&#xFF0C;&#x914D;&#x7535;&#x8111;&#x8FD9;&#x4E48;&#x5C0F;case&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E0D;&#x8FC7;&#x597D;&#x4E45;&#x6CA1;&#x53BB;&#x7535;&#x8111;&#x57CE;&#x4E86;&#xFF0C;&#x53BB;&#x770B;&#x770B;&#x4E5F;&#x597D;&#x5440;&#x3002;&#x201C;&#x6CA1;&#x95EE;&#x9898;&#x201D;&#x6211;&#x56DE;&#x7B54;&#x4E86;&#x3002;&#x201C;&#x563F;&#x563F;&#xFF0C;&#x6211;&#x90A3;&#x4F4D;&#x670B;&#x53CB;&#x7279;&#x522B;&#x6709;&#x94B1;&#xFF0C;&#x5C31;&#x662F;&#x4E0D;&#x61C2;&#x7535;&#x8111;&#xFF0C;&#x4F60;&#x7ED9;&#x4ED6;&#x7528;&#x6700;&#x597D;&#x7684;&#x5C31;&#x884C;&#xFF0C;&#x4E0D;&#x56FE;&#x7701;&#x94B1;&#xFF0C;&#x5C31;&#x56FE;&#x6BD4;&#x522B;&#x4EBA;&#x7684;&#x7535;&#x8111;&#x725B;&#xFF01;&#x201D;&#x3002;&#x6655;&#x6B7B;&#xFF0C;&#x4F30;&#x8BA1;&#x8FD9;&#x662F;&#x5979;&#x90A3;&#x4F4D;&#x670B;&#x53CB;&#x7684;&#x539F;&#x8BDD;&#xFF0C;&#x5426;&#x5219;&#x6211;MM&#x53EF;&#x8BF4;&#x4E0D;&#x4E86;&#x8FD9;&#x6837;&#x98CE;&#x683C;&#x7684;&#x8BDD;&#x3002;&#x540E;&#x6765;&#x77E5;&#x9053;&#x662F;&#x5979;&#x7684;&#x5973;&#x670B;&#x53CB;&#x7684;&#x7537;&#x670B;&#x53CB;&#x7684;&#x8BDD;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7528;&#x6700;&#x597D;&#x7535;&#x8111;&#x7684;&#x4EBA;&#x5927;&#x591A;&#x6570;&#x90FD;&#x662F;&#x4E0D;&#x61C2;&#x7535;&#x8111;&#x7684;&#x4EBA;&#xFF1F;&#x4E3B;&#x554A;&#xFF0C;&#x7ED9;&#x6211;&#x94F6;&#x5B50;&#x5427;&#x3002;</p>
<p>&#x5728;&#x7535;&#x8111;&#x57CE;&#x7684;&#x65F6;&#x95F4;&#x8FC7;&#x7684;&#x5F88;&#x5FEB;&#x3002;&#x5C0F;&#x654F;&#x8DE8;&#x7740;&#x6211;&#x7684;&#x624B;&#xFF0C;&#x9AD8;&#x5174;&#x7684;&#x50CF;&#x4E2A;&#x5C0F;&#x5154;&#x5B50;&#xFF0C;&#x4E00;&#x8E66;&#x4E00;&#x8E66;&#x7684;&#xFF0C;&#x6211;&#x966A;&#x5979;&#x901B;&#x8857;&#x7684;&#x65F6;&#x95F4;&#x592A;&#x5C11;&#x4E86;&#x3002;&#x5C3D;&#x7BA1;&#x5728;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#xFF0C;&#x901A;&#x8FC7;QQ&#x804A;&#x5929;&#x5C45;&#x7136;&#x662F;&#x6211;&#x4EEC;&#x4EA4;&#x6D41;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#x3002;&#x5979;&#x662F;&#x5B66;&#x533B;&#x7684;&#xFF0C;&#x5BF9;&#x7535;&#x8111;&#x7EDD;&#x5BF9;&#x7684;&#x5916;&#x884C;&#x3002;&#x4F46;&#x662F;&#x770B;&#x5230;&#x6211;&#x81EA;&#x4FE1;&#x7684;&#x548C;&#x90A3;&#x4E9B;&#x7535;&#x8111;&#x57CE;&#x7684;&#x5546;&#x4EBA;&#x8BA8;&#x4EF7;&#x8FD8;&#x4EF7;&#xFF0C;&#x8C08;&#x7B11;&#x98CE;&#x58F0;&#x3002;&#x5979;&#x4E5F;&#x5F88;&#x9AD8;&#x5174;&#x3002;&#x6211;&#x60F3;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x770B;&#x8D77;&#x6765;&#x5E94;&#x8BE5;&#x5F88;&#x5E05;&#x3002;&#x5979;&#x7684;&#x670B;&#x53CB;&#x548C;&#x670B;&#x53CB;&#x7684;&#x7537;&#x670B;&#x53CB;&#xFF0C;&#x8DDF;&#x5728;&#x6211;&#x4EEC;&#x5C41;&#x80A1;&#x540E;&#x9762;&#xFF0C;&#x832B;&#x7136;&#x7684;&#x5230;&#x5904;&#x4E71;&#x770B;&#x3002;&#x53CD;&#x6B63;&#x56DE;&#x53BB;&#x4E5F;&#x6CA1;&#x6709;&#x4E8B;&#x60C5;&#xFF0C;&#x5BC6;&#x7801;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x5FEB;&#x5C31;&#x7B97;&#x51FA;&#x6765;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4E5F;&#x4E50;&#x7684;&#x6162;&#x6162;&#x770B;&#xFF0C;&#x6162;&#x6162;&#x6311;&#x3002;&#x5176;&#x5B9E;&#x771F;&#x6B63;&#x914D;&#x673A;&#x5668;&#x4E0D;&#x8FC7;&#x5C31;1&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x3002;&#x4ECE;&#x786E;&#x5B9A;&#x914D;&#x7F6E;&#x5230;&#x88C5;&#x673A;&#x5B8C;&#x6210;&#x3002;&#x90A3;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x5F88;&#x7FA1;&#x6155;&#x3002;&#x786E;&#x5B9E;&#x5F88;&#x725B;&#xFF01;&#x901F;&#x5EA6;&#x6BD4;&#x6211;&#x7684;amd1600+&#x5FEB;&#x591A;&#x4E86;&#x3002;&#x662F;intel&#x7684;&#x82AF;&#x7247;&#x7684;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;amd&#x771F;&#x4E0D;&#x9002;&#x5408;&#x4E0D;&#x61C2;&#x7535;&#x8111;&#x7684;&#x7528;&#x3002;&#x914D;&#x4E86;&#x4E00;&#x5957;&#x9AD8;&#x7EA7;&#x97F3;&#x54CD;&#x548C;&#x4E00;&#x4E2A;&#x9876;&#x7EA7;&#x58F0;&#x5361;&#x3002;&#x5F53;&#x65F6;&#x5C0F;&#x654F;&#x5728;&#x4E0A;&#x9762;&#x6D4B;&#x8BD5;&#x6253;cs&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x770B;&#x7684;&#x6211;&#x90FD;&#x624B;&#x75D2;&#x75D2;&#x7684;&#xFF0C;&#x540E;&#x6765;&#x611F;&#x89C9;&#xFF0C;&#x771F;&#x662F;&#x4E0D;&#x9519;&#x3002;&#x5C0F;&#x654F;&#xFF0C;&#x73A9;&#x7535;&#x8111;&#x5F88;&#x81ED;&#xFF0C;&#x4F46;&#x662F;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x59CB;&#x7EC8;&#x4E0D;&#x662F;&#x5979;&#x7684;&#x5BF9;&#x624B;&#x3002;&#x5979;&#x8BF4;&#x8FD9;&#x8BF4;&#x660E;&#x5176;&#x5B9E;&#x6211;&#x7684;&#x667A;&#x5546;&#x5F88;&#x4F4E;&#x3002;&#x6211;&#x8BF4;&#x6211;&#x7684;&#x4E13;&#x4E1A;&#x4E0D;&#x9519;&#x5440;&#xFF0C;&#x4E0A;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x95E8;&#x95E8;&#x90FD;&#x662F;&#x4F18;&#x5440;&#x3002;&#x5979;&#x8BF4;&#xFF0C;&#x90A3;&#x662F;&#x6B7B;&#x8BFB;&#x4E66;&#xFF0C;&#x4E0D;&#x7B97;&#x3002;&#x5979;&#x662F;&#x5B66;&#x533B;&#x7684;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x5C06;&#x4FE1;&#x5C06;&#x7591;&#xFF0C;&#x6211;&#x7684;&#x667A;&#x5546;&#x662F;&#x4E0D;&#x662F;&#x771F;&#x7684;&#x6709;&#x70B9;&#x4F4E;&#x5440;&#xFF0C;&#x6211;&#x5F88;&#x96BE;&#x731C;&#x51FA;&#x522B;&#x4EBA;&#x7684;&#x5BC6;&#x7801;&#x3002;</p>
<p>&#x9001;&#x8D70;&#x5979;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x563B;&#x563B;&#x54C8;&#x54C8;&#xFF0C;&#x66F4;&#x52A0;&#x4EB2;&#x70ED;&#x3002;&#x5403;&#x4E86;&#x4E00;&#x987F;&#x9EA6;&#x5F53;&#x52B3;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x563B;&#x563B;&#x54C8;&#x54C8;&#x56DE;&#x5230;&#x6211;&#x7684;&#x5C4B;&#x91CC;&#xFF0C;&#x8FD9;&#x662F;&#x5355;&#x4F4D;&#x5206;&#x7684;&#x4E00;&#x5957;&#x4E24;&#x5BA4;&#x4E00;&#x5385;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x5FC3;&#x91CC;&#x4E00;&#x76F4;&#x5C31;&#x518D;&#x60F3;&#xFF0C;&#x5BC6;&#x7801;&#x7834;&#x7684;&#x600E;&#x4E48;&#x6837;&#x4E86;&#x3002;&#x4E00;&#x8FDB;&#x5C4B;&#x91CC;&#xFF0C;&#x7ACB;&#x523B;&#x51B2;&#x8FDB;&#x6211;&#x7684;&#x4E66;&#x623F;&#xFF0C;&#x770B;&#x5C4F;&#x5E55;&#x3002;&#x5C4F;&#x5E55;&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x4FDD;&#x62A4;&#x72B6;&#x6001;&#xFF0C;&#x6211;&#x8001;&#x7EC3;&#x7684;&#x52A8;&#x52A8;&#x9F20;&#x6807;&#x3002;&#x6570;&#x5B57;&#x6CA1;&#x6709;&#x8DF3;&#x52A8;&#x4E86;&#x3002;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x662F;12&#x4F4D;&#x7684;&#x5BC6;&#x7801;&#x3002;&#x5FC3;&#x91CC;&#x4E00;&#x9635;&#x6B23;&#x559C;&#xFF0C;&#x89C9;&#x5F97;&#x5FC3;&#x60C5;&#x597D;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x4ECA;&#x5929;&#x771F;&#x662F;&#x4E0D;&#x9519;&#xFF0C;&#x548C;MM&#x6D6A;&#x6F2B;&#x7684;&#x5EA6;&#x8FC7;&#x4E00;&#x5929;&#xFF0C;&#x8FD8;&#x5230;&#x7535;&#x8111;&#x57CE;&#x53BB;&#x770B;&#x4E86;&#x6211;&#x559C;&#x6B22;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E00;&#x5468;&#x591A;&#x6765;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x7EC8;&#x4E8E;&#x6709;&#x70B9;&#x8FDB;&#x5C55;&#x4E86;&#x3002;&#x4F60;&#x8BF4;&#x4ECA;&#x5929;&#x8FD9;&#x662F;&#x600E;&#x4E48;&#x4E86;&#xFF0C;&#x597D;&#x4E8B;&#x90FD;&#x7ED9;&#x6211;&#x78B0;&#x4E0A;&#x4E86;&#xFF1F;</p>
<p>&#x5C0F;&#x654F;&#x8FDB;&#x6765;&#x4E86;&#xFF0C;&#x770B;&#x7740;&#x6211;&#x7684;&#x773C;&#x775B;&#x3002;&#x6709;&#x574F;&#x574F;&#x7684;&#x7B11;&#xFF0C;&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x5E72;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x201D;&#x6211;&#x7B11;&#x7B11;&#xFF1A;&#x201C;&#x6CA1;&#x4EC0;&#x4E48;&#xFF0C;&#x5206;&#x6790;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x201D;&#x3002;&#x6211;&#x4F5C;&#x9ED1;&#x5BA2;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x4E07;&#x4E07;&#x4E0D;&#x80FD;&#x7ED9;&#x5979;&#x8BF4;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x9ED1;&#x5BA2;&#x5DF2;&#x7ECF;&#x88AB;&#x5851;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x53CD;&#x9762;&#x89D2;&#x8272;&#x4E86;&#x3002;&#x5979;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x80FD;&#x5BB9;&#x5FCD;&#x81EA;&#x5DF1;&#x6210;&#x4E3A;&#x53CD;&#x9762;&#x89D2;&#x8272;&#x7684;GF&#x7684;&#x3002;&#x6BCF;&#x6B21;&#x6211;&#x4EEC;&#x73A9;cs&#xFF0C;&#x90FD;&#x662F;&#x5979;&#x5F53;&#x8B66;&#x5BDF;&#xFF0C;&#x6211;&#x5F53;&#x571F;&#x532A;&#x3002;&#x5982;&#x679C;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#xFF0C;&#x5979;&#x5C31;&#x4E00;&#x5B9A;&#x8981;&#x8981;&#x6211;&#x548C;&#x5979;&#x4E00;&#x8D77;&#x5F53;&#x8B66;&#x5BDF;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x80FD;&#x4F5C;&#x571F;&#x532A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x4E0A;&#x7F51;&#x73A9;cs&#x7684;&#x4E60;&#x60EF;&#x90FD;&#x662F;&#x76F4;&#x63A5;&#x9009;CT&#x3002;&#x201C;&#x6211;&#x8981;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x8981;&#x73A9;&#x6E38;&#x620F;&#x201D;&#xFF0C;&#x6CA1;&#x5916;&#x4EBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C0F;&#x654F;&#x86EE;&#x53EF;&#x7231;&#x6E29;&#x67D4;&#x7684;&#x3002;&#x6709;&#x4E9B;&#x5C0F;&#x5C0F;&#x7684;&#x5201;&#x86EE;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x662F;&#x53EF;&#x7231;&#x3002;&#x96BE;&#x5F97;&#x8FD9;&#x4E48;&#x9AD8;&#x5174;&#xFF0C;&#x5F53;&#x7136;&#x8BA9;&#x5979;&#x7528;&#x6211;&#x7684;&#x597D;&#x673A;&#x5668;&#x4E86;&#x3002;&#x5F00;&#x59CB;&#x73A9;cs&#x3002;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5979;&#x8FD9;&#x4E00;&#x73A9;&#xFF0C;&#x6CA1;2&#x4E2A;&#x5C0F;&#x65F6;&#x5B8C;&#x4E0D;&#x4E86;&#x3002;&#x5979;&#x5BF9;&#x5176;&#x5B83;&#x4E1C;&#x897F;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x6E38;&#x620F;&#xFF0C;&#x5929;&#x751F;&#x5C31;&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x4EC0;&#x4E48;&#x6E38;&#x620F;&#x5230;&#x4E86;&#x5979;&#x624B;&#x91CC;&#xFF0C;&#x4E0D;&#x51FA;&#x51E0;&#x5929;&#xFF0C;&#x5C31;&#x5389;&#x5BB3;&#x7684;&#x4E0D;&#x884C;&#x3002;&#x5979;&#x7684;&#x6E38;&#x620F;&#x90FD;&#x662F;&#x6211;&#x6559;&#x5979;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x7EA2;&#x8272;&#x8B66;&#x62A5;&#xFF0C;cs&#x7B49;&#x3002;&#x73B0;&#x5728;&#x6211;&#x8FDC;&#x8FDC;&#x4E0D;&#x662F;&#x5979;&#x7684;&#x5BF9;&#x624B;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x6000;&#x7591;&#x6211;&#x7684;&#x667A;&#x5546;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x5979;&#x9AD8;&#x3002;</p>
<p>&#x5979;&#x73A9;&#x7684;&#x5F88;&#x9AD8;&#x5174;&#xFF0C;&#x6211;&#x6253;&#x5F00;&#x6211;&#x7684;ibm&#xFF0C;&#x5728;&#x65C1;&#x8FB9;&#x505A;&#x6211;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E00;&#x8FB9;&#x548C;&#x5979;&#x95F2;&#x8C08;&#xFF0C;&#x8FD9;&#x79CD;&#x611F;&#x89C9;&#x771F;&#x662F;&#x723D;&#x5440;&#x3002;</p>
<p>&#x627E;&#x5230;&#x5BC6;&#x7801;&#x4E86;&#x3002;&#x6211;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E0A;&#x4F20;&#x7684;&#x6743;&#x9650;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x6211;&#x5C31;&#x80FD;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x673A;&#x5668;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x80FD;&#x4E0A;&#x4F20;&#x7A0B;&#x5E8F;&#xFF0C;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x5728;server&#x4E0A;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x4E2A;&#x8FD8;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x5904;&#x5440;&#x3002;&#x5E38;&#x5E38;&#x770B;&#x5230;&#x7F51;&#x4E0A;&#x5F88;&#x591A;&#x5B89;&#x5168;&#x68C0;&#x67E5;&#x8F6F;&#x4EF6;&#x8BF4;&#xFF1A;&#x4F60;&#x7684;ftp&#x5177;&#x6709;&#x5199;&#x6743;&#x9650;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6F0F;&#x6D1E;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x6F0F;&#x6D1E;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x6709;&#x4E86;&#x5199;&#x7684;&#x6743;&#x5229;&#xFF0C;&#x4F60;&#x4E5F;&#x53EA;&#x80FD;&#x5199;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x3002;&#x5BF9;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x4E00;&#x70B9;&#x529E;&#x6CD5;&#x6CA1;&#x6709;&#x3002;&#x8981;&#x5E0C;&#x671B;&#x7BA1;&#x7406;&#x5458;&#x5728;server&#x4E0A;&#x6267;&#x884C;&#x4F60;&#x4E0A;&#x4F20;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x8981;&#x4E0D;&#x662F;&#x4F60;&#x6709;&#x75C5;&#xFF0C;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x6709;&#x75C5;&#xFF01;&#x5148;&#x770B;&#x770B;&#xFF0C;&#x4E0A;&#x4F20;&#x7684;&#x76EE;&#x5F55;&#x662F;&#x5426;&#x662F;&#x548C;apahce&#x7684;&#x7F51;&#x9875;&#x76EE;&#x5F55;&#x91CC;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x901A;&#x8FC7;www server&#x6765;&#x8BF7;&#x6C42;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002;&#x548C;&#x5C0F;&#x654F;&#x8C08;&#x7B11;&#x4E4B;&#x95F4;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x8BD5;&#x8FC7;&#x4E86;&#x6211;&#x80FD;&#x60F3;&#x5230;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x3002;&#x90FD;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x3002;&#x60F3;&#x60F3;&#x4E5F;&#x662F;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x5982;&#x6B64;&#x5389;&#x5BB3;&#xFF0C;&#x600E;&#x4E48;&#x4F1A;&#x72AF;&#x8FD9;&#x6837;&#x4F4E;&#x7EA7;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;ftp&#x548C;www&#x662F;&#x4E25;&#x683C;&#x5206;&#x5F00;&#x7684;&#x3002;&#x53EA;&#x80FD;&#x60F3;&#x5176;&#x4ED6;&#x529E;&#x6CD5;&#x4E86;&#x3002;&#x7EE7;&#x7EED;&#x5728;bbs&#x4E0A;&#x4EE5;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x8EAB;&#x4EFD;&#x901B;&#xFF0C;&#x5C3D;&#x7BA1;&#x6709;&#x70B9;&#x5371;&#x9669;&#xFF0C;&#x5E78;&#x597D;&#x90A3;&#x4F4D;caption tom&#x4ECA;&#x5929;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x4E0A;&#x7EBF;&#x3002;&#x6709;&#x5C0F;&#x654F;&#x5728;&#x65C1;&#x8FB9;&#x5927;&#x547C;&#x5C0F;&#x53EB;&#x7684;&#xFF0C;&#x5979;&#x6253;cs&#xFF0C;over&#x4E4B;&#x540E;&#x7B49;&#x4E0B;&#x5C40;&#x5F00;&#x5C40;&#x7684;&#x95F4;&#x9699;&#x90FD;&#x4F1A;&#x6765;&#x548C;&#x6211;&#x6253;&#x6253;&#x95F9;&#x95F9;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x7528;&#x62F3;&#x5934;&#x6253;&#x6211;&#x7684;&#x80CC;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x7528;&#x624B;&#x5361;&#x6211;&#x7684;&#x8116;&#x5B50;&#xFF0C;&#x6211;&#x6000;&#x7591;&#x5979;&#x5929;&#x751F;&#x6709;&#x70B9;&#x66B4;&#x529B;&#x503E;&#x5411;&#x3002;&#x4E0D;&#x7136;&#x4E00;&#x4E2A;&#x5973;&#x5B69;&#x5B50;&#x5BB6;&#x5BB6;&#x7684;&#xFF0C;&#x600E;&#x4E48;&#x5C31;&#x559C;&#x6B22;&#x73A9;cs&#x8FD9;&#x6837;&#x7684;&#x66B4;&#x529B;&#x6E38;&#x620F;&#x5462;&#xFF1F;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x8BA9;&#x6211;&#x9EBB;&#x75F9;&#x5927;&#x610F;&#x4E86;&#xFF0C;&#x6211;&#x5927;&#x54A7;&#x54A7;&#x7684;&#x5728;bbs&#x4E0A;&#x901B;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4E0D;&#x5728;&#x610F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x5C31;&#x6709;&#x610F;&#x5916;&#x6536;&#x83B7;&#x3002;&#x6211;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x5728;bbs&#x4E0A;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x53D1;&#x5E16;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x4E0A;&#x4F20;&#x9644;&#x4EF6;&#x3002;&#x8FD9;&#x4E2A;&#x9644;&#x4EF6;&#x662F;&#x653E;&#x5728;www&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;www&#x5408;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x662F;php&#x5199;&#x7684;&#x3002;&#x96BE;&#x9053;&#x6211;&#x5C31;&#x4E0D;&#x4F1A;&#x5199;php&#x4EE3;&#x7801;&#x4E86;&#xFF1F;&#x811A;&#x672C;&#x8BED;&#x53E5;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x5C31;&#x7CBE;&#x901A;&#x90A3;&#x4E48;&#x51E0;&#x4E2A;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x8BFB;&#x6587;&#x4EF6;&#xFF0C;&#x5199;&#x6587;&#x4EF6;&#x7B49;&#x3002;&#x5BF9;&#x9ED1;&#x5BA2;&#x7528;&#x7684;&#x6700;&#x666E;&#x904D;&#x3002;&#x9A6C;&#x4E0A;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x4E0B;&#x8F7D;&#x7A0B;&#x5E8F;&#xFF0C;&#x628A;unix&#x4E0B;&#x7684;&#x90A3;&#x4E2A;&#x53EB;&#x505A;passwd&#x7684;&#x5BC6;&#x7801;&#x6587;&#x4EF6;&#x641E;&#x4E0B;&#x6765;&#xFF0C;&#x5C31;&#x80DC;&#x5229;&#x4E86;&#x4E00;&#x5927;&#x534A;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x770B;&#x6765;&#x7BA1;&#x7406;&#x5458;&#x5BF9;passwd&#x6587;&#x4EF6;&#x7684;&#x6743;&#x9650;&#x4F5C;&#x4E86;&#x8BBE;&#x7F6E;&#xFF0C;&#x4EE5;apache&#x8FDB;&#x7A0B;&#x7684;&#x6743;&#x9650;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x6709;&#x8BFB;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x6743;&#x5229;&#x7684;&#x3002;&#x60F3;&#x5176;&#x4ED6;&#x7684;&#x529E;&#x6CD5;&#x5427;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5E94;&#x8BE5;&#x8BF4;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#x5728;&#x90A3;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x8FD0;&#x884C;&#xFF0C;&#x6211;&#x5C31;&#x5E94;&#x8BE5;&#x6210;&#x529F;&#x4E86;&#x4E00;&#x5927;&#x534A;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x867D;&#x7136;&#x4F5C;&#x5230;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;root&#x6743;&#x9650;&#xFF0C;&#x6211;&#x5927;&#x4E0D;&#x4E86;&#x7834;&#x574F;&#x7834;&#x574F;&#x5BF9;&#x653E;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7834;&#x574F;&#x7834;&#x574F;&#x5BF9;&#x65B9;&#x7684;&#x7F51;&#x9875;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5178;&#x578B;&#x7684;&#x201C;&#x83DC;&#x9E1F;&#x201D;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x6211;&#x662F;&#x4E0D;&#x5C51;&#x8FD9;&#x4E48;&#x4F5C;&#x7684;&#x3002;&#x4E00;&#x95F9;&#xFF0C;&#x4EBA;&#x5BB6;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x4E0D;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#xFF1F;&#x4EE5;&#x4ED6;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#xFF0C;&#x4EE5;&#x540E;&#x4F60;&#x8FD8;&#x80FD;&#x8FDB;&#x5165;&#xFF1F;&#x6211;&#x667A;&#x5546;&#x4E0D;&#x9AD8;&#xFF0C;&#x4F46;&#x7EDD;&#x5BF9;&#x4E0D;&#x50BB;&#x3002;&#x5C0F;&#x654F;&#x53EF;&#x80FD;&#x73A9;&#x6E38;&#x620F;&#x73A9;&#x7684;&#x6709;&#x70B9;&#x70E6;&#x4E86;&#xFF0C;&#x5F00;&#x59CB;&#x73A9;&#x6211;&#x4E86;&#x3002;&#x6253;&#x6211;&#xFF0C;&#x95F9;&#x6211;&#x7684;&#x65F6;&#x95F4;&#x591A;&#x4E86;&#x3002;&#x6211;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x751C;&#x871C;&#x7684;&#x548C;&#x5979;&#x95F9;&#xFF0C;&#x4E00;&#x8FB9;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x5982;&#x4F55;&#x4F5C;&#x4E86;&#xFF0C;&#x6211;&#x7684;&#x601D;&#x7EF4;&#x73B0;&#x5728;&#x4E0D;&#x5728;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x4E0A;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x522B;&#x8BEF;&#x4F1A;&#xFF0C;&#x6211;&#x548C;&#x5C0F;&#x654F;&#x867D;&#x7136;&#x8BA4;&#x8BC6;&#x5FEB;3&#x5E74;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x8FD8;&#x53EA;&#x662F;&#x505C;&#x7559;&#x5728;&#x62C9;&#x62C9;&#x5C0F;&#x624B;&#xFF0C;&#x4EB2;&#x4EB2;&#x5C0F;&#x5634;&#x7684;&#x7A0B;&#x5E8F;&#x4E0A;&#x3002;&#x4E0D;&#x662F;&#x6211;&#x4E0D;&#x80FD;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x6709;&#x6211;&#x7684;&#x539F;&#x5219;&#x3002;&#x6211;&#x5F53;&#x7136;&#x662F;&#x4E2A;&#x6B63;&#x5E38;&#x7537;&#x4EBA;&#xFF0C;&#x4F46;&#x662F;&#x548C;&#x5C0F;&#x654F;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x89C9;&#x5F97;&#x751C;&#x871C;&#xFF0C;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x8981;&#x600E;&#x4E48;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x4FE1;&#x4E0D;&#x4FE1;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x597D;&#x51E0;&#x6B21;&#xFF0C;&#x5C0F;&#x654F;&#x90FD;&#x7792;&#x51B2;&#x52A8;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x90FD;&#x628A;&#x63E1;&#x4F4F;&#x4E86;&#x3002;&#x8C08;&#x604B;&#x7231;&#x5C31;&#x597D;&#x597D;&#x8C08;&#xFF0C;&#x4E0D;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x505A;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x7684;&#x539F;&#x5219;&#x3002;&#x73B0;&#x5728;&#x6211;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x80FD;&#x5426;&#x548C;&#x5C0F;&#x654F;&#x8D70;&#x5230;&#x4E00;&#x8D77;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x575A;&#x6301;&#x6211;&#x7684;&#x539F;&#x5219;&#x3002;</p>
<p>&#x201C;&#x6211;&#x7684;&#x7535;&#x8111;&#x8FD9;&#x51E0;&#x5929;&#x6709;&#x70B9;&#x5947;&#x602A;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x770B;&#x7740;&#x6211;&#x8BF4;&#xFF0C;&#x5979;&#x5728;cs&#x4E2D;&#x53C8;over&#x4E86;&#x3002;</p>
<p>&#x201C;&#x600E;&#x4E48;&#x5566;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x7684;&#x7535;&#x8111;&#x662F;&#x6211;&#x7ED9;&#x5979;&#x914D;&#x7684;&#xFF0C;&#x6BD4;&#x6211;&#x7684;&#x7535;&#x8111;&#x8D35;&#xFF0C;&#x7528;&#x7684;&#x662F;p4 1.6G&#x7684;&#x3002;&#x6DB2;&#x6676;&#x7684;&#x663E;&#x793A;&#x5668;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x5979;&#x6BD4;&#x6211;&#x6709;&#x94B1;&#x3002;</p>
<p>&#x201C;&#x8FD9;&#x51E0;&#x5929;&#x4E0A;&#x7F51;&#x901F;&#x5EA6;&#x6162;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x5F00;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x5F39;&#x51FA;&#x4E00;&#x4E9B;&#x5E7F;&#x544A;&#x6846;&#x6846;&#xFF0C;&#x5173;&#x4E86;&#x53C8;&#x51FA;&#x6765;&#xFF0C;&#x70E6;&#x90FD;&#x70E6;&#x6B7B;&#x4E86;&#x3002;&#x201D;</p>
<p>&quot;&#x6211;&#x6000;&#x7591;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x906D;&#x9ED1;&#x5BA2;&#x4E86;&#x3002;&#x201D;&#x5C0F;&#x654F;&#x52A0;&#x4E86;&#x4E00;&#x53E5;&#x3002;</p>
<p>&#x6211;&#x4E00;&#x6123;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x770B;&#x5979;&#x4E00;&#x672C;&#x6B63;&#x7ECF;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x6211;&#x4E0D;&#x6562;&#x7B11;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E9B;&#x6076;&#x610F;&#x7F51;&#x9875;&#x4FEE;&#x6539;&#x4E86;&#x5979;&#x7684;IE&#x8BBE;&#x7F6E;&#x548C;&#x6CE8;&#x518C;&#x8868;&#x3002;&#x5371;&#x5BB3;&#x4E0D;&#x5927;&#xFF0C;&#x5C31;&#x662F;&#x6709;&#x70B9;&#x70E6;&#x3002;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x548C;&#x9ED1;&#x5BA2;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x3002;&#x6211;&#x53EA;&#x662F;&#x7EB3;&#x95F7;&#x5979;&#x600E;&#x4E48;&#x4F1A;&#x6000;&#x7591;&#x548C;&#x9ED1;&#x5BA2;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x662F;&#x906D;&#x9ED1;&#x5BA2;&#x4E86;&#xFF1F;&#x201D;&#x6211;&#x6545;&#x610F;&#x95EE;&#x3002;</p>
<p>&#x201C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x6211;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x61C2;&#x3002;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x641E;&#x4E86;&#x7535;&#x8111;&#x57F9;&#x8BAD;&#xFF0C;&#x6211;&#x53EF;&#x662F;&#x4F18;&#x7ED3;&#x4E1A;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x6700;&#x540E;&#x4E00;&#x7AE0;&#x5C31;&#x662F;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#xFF0C;&#x6211;&#x4EEC;&#x90A3;&#x4E2A;&#x8001;&#x5E08;&#x8BF4;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x9ED1;&#x5BA2;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#xFF0C;&#x4ED6;&#x4EEC;&#x7279;&#x522B;&#x5389;&#x5BB3;&#xFF0C;&#x60F3;&#x8FDB;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5C31;&#x80FD;&#x673A;&#x5668;&#xFF0C;&#x60F3;&#x63A7;&#x5236;&#x4F60;&#x7684;&#x673A;&#x5668;&#x5C31;&#x80FD;&#x8FDB;&#x4F60;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x7F8E;&#x56FD;&#x6253;&#x4F0A;&#x62C9;&#x514B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x662F;&#x9ED1;&#x5BA2;&#x8BA9;&#x4F0A;&#x62C9;&#x514B;&#x7684;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x5931;&#x7075;&#x7684;&#x3002;&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x7EDF;&#x4E00;&#x5929;&#x4E0B;&#x3002;&#x201D;&#x5C0F;&#x654F;&#x7684;&#x773C;&#x775B;&#x5F00;&#x59CB;&#x653E;&#x51FA;&#x5149;&#x5F69;&#xFF0C;&#x770B;&#x7684;&#x51FA;&#x6765;&#x5BF9;&#x9ED1;&#x5BA2;&#x5145;&#x6EE1;&#x4E86;&#x65E0;&#x9650;&#x7684;&#x5411;&#x5F80;&#x3002;</p>
<p>&#x6211;&#x5FC3;&#x91CC;&#x5F00;&#x59CB;&#x7B11;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x6562;&#x7B11;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x6655;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x9ED1;&#x5BA2;&#xFF0C;&#x4F60;BF&#x5C31;&#x662F;&#x9ED1;&#x5BA2;&#xFF0C;&#x600E;&#x4E48;&#x6CA1;&#x89C1;&#x6211;&#x7EDF;&#x4E00;&#x5929;&#x4E0B;&#x3002;&#x6211;&#x4E70;&#x65B9;&#x4FBF;&#x9762;&#x8FD8;&#x662F;&#x5F97;&#x7ED9;&#x94B1;&#xFF0C;&#x6211;&#x5230;&#x81EA;&#x52A8;&#x63D0;&#x6B3E;&#x673A;&#x4E0A;&#x53D6;100&#x5757;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x4F1A;&#x7ED9;&#x6211;&#x5410;&#x51FA;200&#x5757;&#x6765;&#x3002;&#x6211;&#x4E0D;&#x6562;&#x7B11;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x53EF;&#x4E0D;&#x613F;&#x610F;&#x88AB;&#x5C0F;&#x654F;&#x4FEE;&#x7406;&#x3002;&#x51B5;&#x4E14;&#x770B;&#x5230;&#x5979;&#x5BF9;&#x9ED1;&#x5BA2;&#x7684;&#x5411;&#x5F80;&#xFF0C;&#x6211;&#x4E5F;&#x7F8E;&#x6ECB;&#x6ECB;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x6211;&#x5BF9;&#x5979;&#x8BF4;&#xFF1A;&#x5176;&#x5B9E;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;&#x3002;&#x5979;&#x4F1A;&#x4E0D;&#x4F1A;&#x6655;&#x5012;&#xFF1F;&#x5FC3;&#x91CC;&#x7F8E;&#xFF0C;&#x8138;&#x4E0A;&#x7684;&#x7B11;&#x5BB9;&#x4E5F;&#x6EA2;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x8BF4;&#x600E;&#x4E48;&#x529E;&#x5440;&#xFF0C;&#x5509;&#xFF0C;&#x5982;&#x679C;&#x906D;&#x4E86;&#x9ED1;&#x5BA2;&#xFF0C;&#x6211;&#x770B;&#x4F60;&#x4E5F;&#x6CA1;&#x529E;&#x6CD5;&#x3002;&#x201D;&#x5C0F;&#x654F;&#x50CF;&#x662F;&#x81EA;&#x8A00;&#x81EA;&#x8BED;&#x3002;&#x5C0F;&#x654F;&#x53EA;&#x77E5;&#x9053;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x8005;&#xFF0C;&#x5979;&#x4E0D;&#x61C2;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x6211;&#x90FD;&#x6CA1;&#x6709;&#x7ED9;&#x5979;&#x8BB2;&#x3002;&#x6211;&#x5728;&#x5979;&#x773C;&#x4E2D;&#xFF0C;&#x548C;&#x4ED6;&#x4EEC;&#x5355;&#x4F4D;&#x90A3;&#x4E2A;&#x5FAE;&#x673A;&#x5BA4;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x3002;&#x8FD9;&#x4E0D;&#x884C;&#xFF0C;&#x5728;MM&#x9762;&#x524D;&#xFF0C;&#x600E;&#x4E48;&#x4E5F;&#x4E0D;&#x80FD;&#x4E22;&#x4E86;&#x8138;&#x3002;&#x7537;&#x4EBA;&#x7684;&#x597D;&#x5F3A;&#x5FC3;&#x8BA9;&#x6211;&#x7ACB;&#x523B;&#x60CA;&#x9192;&#x8FC7;&#x6765;&#x3002;</p>
<p>&#x201C;&#x6211;&#x7ED9;&#x4F60;&#x53D1;&#x4E2A;&#x7A0B;&#x5E8F;&#x5230;&#x4F60;&#x4FE1;&#x7BB1;&#xFF0C;&#x56DE;&#x53BB;&#x6253;&#x5F00;&#x6267;&#x884C;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;ok&#x4E86;&#x201D;&#x8BF4;&#x8BDD;&#x95F4;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x628A;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x53D1;&#x5230;&#x5979;&#x7684;&#x4FE1;&#x7BB1;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E0D;&#x662F;&#x6211;&#x5199;&#x7684;&#x3002;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x6211;&#x4EC0;&#x4E48;&#x90FD;&#x61C2;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x5199;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x8FD8;&#x5FC5;&#x987B;&#x8981;&#x67E5;&#x5F88;&#x591A;&#x8D44;&#x6599;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4FEE;&#x6539;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x6CE8;&#x518C;&#x8868;&#x7684;&#x952E;&#x503C;&#x5440;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x9EBB;&#x70E6;&#x6B7B;&#x4E86;&#x3002;&#x4E0D;&#x5982;&#x7528;&#x4EBA;&#x5BB6;&#x7684;&#x4E1C;&#x897F;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x201C;&#x80FD;&#x884C;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x8001;&#x5E08;&#x8BF4;&#x9ED1;&#x5BA2;&#x662F;&#x9632;&#x4E0D;&#x80DC;&#x9632;&#x7684;&#x201D;&#x3002;&#x770B;&#x5230;&#x5979;&#x5BF9;&#x4ED6;&#x4EEC;&#x8001;&#x5E08;&#x65E0;&#x9650;&#x5D07;&#x62DC;&#xFF0C;&#x6211;&#x6709;&#x70B9;&#x5992;&#x5FCC;&#x4E86;&#xFF0C;&#x4E0D;&#x7528;&#x95EE;&#xFF0C;&#x4ED6;&#x4EEC;&#x8001;&#x5E08;&#x80AF;&#x5B9A;&#x662F;&#x4E2A;&#x7537;&#x7684;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x8FD8;&#x662F;&#x4E2A;&#x5E05;&#x54E5;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x4E0A;&#x8BA1;&#x7B97;&#x673A;&#x57F9;&#x8BAD;&#x7684;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x5E74;&#x8F7B;&#x4EBA;&#x3002;&#x8FD9;&#x4E2A;&#x5927;&#x5BB6;&#x90FD;&#x61C2;&#x3002;</p>
<p>&#x201C;&#x54CE;&#x5440;&#xFF0C;&#x4F60;&#x4EEC;&#x8001;&#x5E08;&#x5C31;&#x4F1A;&#x8BF4;&#x7A7A;&#x8BDD;&#xFF0C;&#x9ED1;&#x5BA2;&#x54EA;&#x91CC;&#x6709;&#x90A3;&#x4E48;&#x5389;&#x5BB3;&#xFF0C;&#x9ED1;&#x5BA2;&#x4E5F;&#x6CA1;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x4EBA;&#x5BB6;&#x5403;&#x9971;&#x4E86;&#xFF0C;&#x5230;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x7684;&#x4E0A;&#x9762;&#x53C8;&#x6CA1;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x90A3;&#x4E2A;&#x4E0D;&#x662F;&#x906D;&#x9047;&#x9ED1;&#x5BA2;&#xFF0C;&#x662F;&#x8BBF;&#x95EE;&#x4E86;&#x5E26;&#x6709;&#x6076;&#x610F;&#x4EE3;&#x7801;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x4FEE;&#x6539;&#x4E86;&#x4F60;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x5927;&#x4E0D;&#x4E86;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x4F0A;&#x62C9;&#x514B;&#x7684;&#x5931;&#x8D25;&#x548C;&#x9ED1;&#x5BA2;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x522B;&#x542C;&#x4ED6;&#x4EEC;&#x4E71;&#x8BF4;&#x3002;&#x201D;&#x6211;&#x4E00;&#x53E3;&#x6C14;&#x8BF4;&#x5B8C;&#x4E86;&#xFF0C;&#x89C9;&#x5F97;&#x5FC3;&#x91CC;&#x75DB;&#x5FEB;&#x4E9B;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x8BF4;&#x7684;&#x53EF;&#x662F;&#x771F;&#x8BDD;&#xFF0C;&#x9ED1;&#x5BA2;&#x8FD9;&#x4E2A;&#x8BCD;&#x4EA7;&#x751F;&#x4EE5;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BCD;&#x786E;&#x5B9E;&#x80CC;&#x4E86;&#x4E0D;&#x5C11;&#x9ED1;&#x9505;&#xFF0C;&#x548C;&#x75C5;&#x6BD2;&#x4E00;&#x6837;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x81EA;&#x5DF1;&#x65E0;&#x6CD5;&#x89E3;&#x91CA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x5C31;&#x4F1A;&#x628A;&#x9ED1;&#x5BA2;&#x548C;&#x75C5;&#x6BD2;&#x62C9;&#x51FA;&#x6765;&#x57AB;&#x80CC;&#x3002;&#x8FD9;&#x6837;&#x5BF9;&#x4E0D;&#x61C2;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5408;&#x7406;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x800C;&#x4E14;&#x81EA;&#x5DF1;&#x4E5F;&#x80FD;&#x6709;&#x53F0;&#x9636;&#x4E0B;&#x3002;&#x5C31;&#x50CF;&#x6211;&#x56FD;&#x7684;&#x67D0;&#x4E9B;&#x4E2D;&#x533B;&#x5F53;&#x9047;&#x5230;&#x81EA;&#x5DF1;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#x75C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x662F;&#x4E0D;&#x4F1A;&#x627F;&#x8BA4;&#x81EA;&#x5DF1;&#x4E0D;&#x4F1A;&#x533B;&#x7684;&#x3002;&#x4ED6;&#x8FD8;&#x4F1A;&#x7ED9;&#x4F60;&#x5F00;&#x51FA;&#x4E00;&#x4E2A;&#x836F;&#x65B9;&#xFF0C;&#x7ED3;&#x679C;&#x4F60;&#x4E00;&#x770B;&#xFF0C;&#x662F;&#x4EC0;&#x4E48;&#x67D0;&#x67D0;&#x5C71;&#x7B2C;&#x4E00;&#x6EF4;&#x9732;&#x73E0;&#xFF0C;&#x67D0;&#x67D0;&#x65E9;&#x7B2C;&#x4E00;&#x6B21;&#x53D1;&#x82BD;&#x7684;&#x6839;&#x7B49;&#x7B49;&#x3002;&#x9760;&#xFF0C;&#x4F60;&#x8BF4;&#x4F60;&#x80FD;&#x627E;&#x5230;&#x8FD9;&#x4E9B;&#x9B3C;&#x4E1C;&#x897F;&#x5417;&#xFF1F;&#x627E;&#x4E0D;&#x5230;&#xFF1F;&#x90A3;&#x5BF9;&#x4E0D;&#x8D77;&#xFF0C;&#x4E0D;&#x662F;&#x6211;&#x4E0D;&#x80FD;&#x533B;&#xFF0C;&#x662F;&#x4F60;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x836F;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x5C31;&#x662F;&#x9A97;&#x4EBA;&#x3002;&#x73B0;&#x5728;&#x7F51;&#x4E0A;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x8C01;&#x7B2C;&#x4E00;&#x6B21;&#x8BF4;&#xFF0C;&#x6D77;&#x6E7E;&#x6218;&#x4E89;&#xFF0C;&#x662F;&#x7F8E;&#x56FD;&#x9ED1;&#x5BA2;&#x7ED9;&#x4EBA;&#x5BB6;&#x7684;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x690D;&#x5165;&#x4E86;&#x75C5;&#x6BD2;&#x7B49;&#x7B49;&#x3002;&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x5C45;&#x7136;&#x90FD;&#x76F8;&#x4FE1;&#x4E86;&#x3002;&#x8FD9;&#x5B8C;&#x5168;&#x662F;&#x626F;&#x6DE1;&#x3002;&#x4F60;&#x60F3;&#x561B;&#xFF0C;&#x4F60;&#x4F1A;&#x628A;&#x81EA;&#x5DF1;&#x519B;&#x961F;&#x7684;&#x7EBF;&#x8DEF;&#x8FDE;&#x63A5;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x5417;&#xFF1F;&#x5C24;&#x5176;&#x662F;&#x6218;&#x4E89;&#x671F;&#x95F4;&#x3002;&#x4F0A;&#x62C9;&#x514B;&#x6CA1;&#x5403;&#x8FC7;&#x732A;&#x8089;&#xFF0C;&#x8FD8;&#x6CA1;&#x89C1;&#x8FC7;&#x732A;&#x8DD1;&#xFF1F;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x4F1A;&#x548C;&#x6C11;&#x7528;&#x7F51;&#x7EDC;&#x8FDE;&#x540C;&#x7684;&#x3002;&#x8FDE;&#x90FD;&#x8FDE;&#x4E0D;&#x901A;&#xFF0C;&#x4F60;&#x9ED1;&#x5BA2;&#x6709;&#x4EC0;&#x4E48;&#x529E;&#x6CD5;&#xFF1F;&#x8FDE;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7684;&#x5185;&#x90E8;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x548C;internet&#x8FDE;&#x901A;&#x7684;&#x3002;&#x4F55;&#x51B5;&#x662F;&#x6218;&#x4E89;&#x65F6;&#x671F;&#x7684;&#x519B;&#x961F;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x6D3E;&#x95F4;&#x8C0D;&#x8FDB;&#x5165;&#x4EBA;&#x5BB6;&#x7684;&#x5185;&#x90E8;&#x7F51;&#x7EDC;&#xFF0C;&#x641E;&#x4E86;&#x7834;&#x574F;&#xFF0C;&#x4EBA;&#x5BB6;&#x80AF;&#x5B9A;&#x6709;&#x6062;&#x590D;&#x8BA1;&#x5212;&#x3002;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x666E;&#x901A;&#x7F51;&#x7BA1;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7AD9;&#x4E00;&#x822C;&#x90FD;&#x80FD;&#x5728;24&#x5C0F;&#x65F6;&#x5185;&#x6062;&#x590D;&#xFF0C;&#x4F55;&#x51B5;&#x519B;&#x961F;&#xFF1F;&#x519B;&#x961F;&#x81F3;&#x5C11;&#x90FD;&#x6709;2&#x5957;&#x4EE5;&#x4E0A;&#x7684;&#x5E94;&#x6025;&#x65B9;&#x6848;&#x3002;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x7EE7;&#x7EED;&#x6D3E;&#x95F4;&#x8C0D;&#xFF1F;&#x771F;&#x4EE5;&#x4E3A;&#x4EBA;&#x5BB6;&#x662F;&#x732A;&#x5934;&#x5440;&#xFF0C;&#x88AB;&#x4F60;&#x641E;&#x8FC7;&#x4E00;&#x6B21;&#xFF0C;&#x8FD8;&#x4F1A;&#x88AB;&#x4F60;&#x641E;&#x7B2C;&#x4E8C;&#x6B21;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x5B8C;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x5B89;&#x5168;&#x90E8;&#x95E8;&#x6B63;&#x5230;&#x5904;&#x627E;&#x4F60;&#x5462;&#xFF1F;&#x4F60;&#x8FD8;&#x8E66;&#x51FA;&#x6765;&#x641E;&#x7B2C;&#x4E8C;&#x6B21;&#xFF0C;&#x4E0D;&#x60F3;&#x6D3B;&#x4E86;&#xFF1F;&#x5927;&#x5BB6;&#x628A;&#x7F8E;&#x56FD;&#x90FD;&#x795E;&#x8BDD;&#x4E86;&#xFF0C;&#x6211;&#x5929;&#x5929;&#x5728;&#x7F51;&#x4E0A;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x662F;&#x666E;&#x901A;&#x4EBA;&#x3002;</p>
<p>&#x201C;&#x4F60;&#x4F1A;&#x4E0D;&#x4F1A;&#x5F53;&#x9ED1;&#x5BA2;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x7A81;&#x7136;&#x95EE;&#x3002;&#x6211;&#x4E00;&#x60CA;&#xFF0C;&#x770B;&#x5230;&#x5C0F;&#x654F;&#x5DF2;&#x7ECF;&#x9000;&#x51FA;cs&#x4E86;&#xFF0C;&#x6B63;&#x5728;&#x73A9;&#x70B8;&#x5F39;&#x8D85;&#x4EBA;&#x3002;&#x8FD9;&#x4E2A;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x6E38;&#x620F;&#xFF0C;&#x5979;&#x4E00;&#x8FB9;&#x73A9;&#x4E00;&#x8FB9;&#x548C;&#x6211;&#x804A;&#x5929;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4F1A;&#x4E0D;&#x4F1A;&#x5440;&#x3002;&#x3002;&#x3002;&#x3002;&#x201D;&#x5C0F;&#x654F;&#x53C8;&#x52A0;&#x4E86;&#x4E00;&#x53E5;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x201D;&#x6211;&#x72B9;&#x8C6B;&#x4E86;&#xFF0C;&#x6211;&#x8BE5;&#x600E;&#x4E48;&#x8BF4;&#xFF1F;&#x6211;&#x544A;&#x8BC9;&#x5979;&#x6211;&#x73B0;&#x5728;&#x5C31;&#x5728;&#x60F3;&#x529E;&#x6CD5;&#x8FDB;&#x5165;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x7F51;&#x7AD9;&#xFF1F;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5979;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x6211;&#x4E0D;&#x6562;&#x56DE;&#x7B54;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x600E;&#x4E48;&#x62C9;&#xFF0C;&#x4F1A;&#x53C8;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x4E0D;&#x4F1A;&#x53C8;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x201D;&#x6211;&#x51B3;&#x5B9A;&#x8BD5;&#x63A2;&#x4E00;&#x4E0B;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F1A;&#x5C31;&#x7ED9;&#x6211;&#x8868;&#x6F14;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x4E5F;&#x662F;&#x641E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#xFF0C;&#x4EBA;&#x5BB6;&#x90FD;&#x4F1A;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x5C31;&#x4E0D;&#x4F1A;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x7EE7;&#x7EED;&#x73A9;&#x70B8;&#x5F39;&#x8D85;&#x4EBA;&#xFF0C;&#x90A3;&#x4E2A;&#x6E38;&#x620F;&#x4E0D;&#x9700;&#x8981;&#x8FC7;&#x591A;&#x6CE8;&#x610F;&#x529B;&#x3002;&#x53EA;&#x9700;&#x8981;&#x673A;&#x68B0;&#x7684;&#x79FB;&#x52A8;&#x548C;&#x653E;&#x70B8;&#x5F39;&#x5C31;ok&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x563F;&#x563F;&#xFF0C;&#x4F60;&#x4EEC;&#x8001;&#x5E08;&#x4F1A;&#x5417;&#xFF1F;&#x201D;&#x6211;&#x7B11;&#x9053;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5F53;&#x7136;&#x4F1A;&#x62C9;&#xFF0C;&#x6211;&#x4EEC;&#x8001;&#x5E08;&#x7ED9;&#x6211;&#x4EEC;&#x4E0A;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#xFF0C;&#x8FD8;&#x80FD;&#x4E0D;&#x4F1A;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x5F88;&#x80AF;&#x5B9A;&#x7684;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x770B;&#x8FC7;&#x4ED6;&#x8868;&#x6F14;&#x9ED1;&#x522B;&#x4EBA;&#x7684;&#x7F51;&#x7AD9;&#x5417;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x6CA1;&#x6709;&#xFF0C;&#x6211;&#x4EEC;&#x8001;&#x5E08;&#x8BF4;&#x4E86;&#xFF0C;&#x9ED1;&#x522B;&#x4EBA;&#x7684;&#x7F51;&#x7AD9;&#x662F;&#x72AF;&#x6CD5;&#x7684;&#x3002;&#x201D;&#x563F;&#x563F;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x4EEC;&#x8001;&#x5E08;&#x4E0D;&#x662F;&#x6015;&#x72AF;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x501F;&#x53E3;&#xFF0C;&#x4ED6;&#x4EEC;&#x8001;&#x5E08;&#x53EF;&#x80FD;&#x771F;&#x7684;&#x4E0D;&#x4F1A;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x8981;&#x662F;&#x8BA9;&#x4F60;&#x548C;&#x6211;&#x6574;&#x591C;&#x770B;&#x7535;&#x8111;&#x89E3;&#x7801;&#xFF0C;&#x4F60;&#x8FD8;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x8868;&#x6F14;&#x5417;&#xFF1F;&#x5176;&#x5B9E;&#x6211;&#x7684;&#x8089;&#x9E21;&#x5F88;&#x591A;&#xFF0C;&#x8981;&#x7ED9;MM&#x8868;&#x6F14;&#x4E00;&#x70B9;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#xFF0C;&#x800C;&#x4E14;&#x975E;&#x5E38;&#x6D41;&#x7545;&#x548C;&#x5FEB;&#x901F;&#xFF0C;&#x7EDD;&#x5BF9;&#x80FD;&#x8BA9;&#x5979;&#x60CA;&#x8BB6;&#x7684;&#x5634;&#x90FD;&#x95ED;&#x4E0D;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x201C;&#x5509;&#xFF0C;&#x4F60;&#x5230;&#x5E95;&#x4F1A;&#x4E0D;&#x4F1A;&#x5440;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x8FD8;&#x95EE;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4E0D;&#x6015;&#x6211;&#x72AF;&#x6CD5;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x563F;&#x563F;&#xFF0C;&#x53EA;&#x662F;&#x8868;&#x6F14;&#x4E00;&#x4E0B;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x641E;&#x7834;&#x574F;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x600E;&#x4E48;&#x6837;&#x5427;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x574F;&#x574F;&#x7684;&#x7B11;&#x3002;</p>
<p>&#x5982;&#x679C;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x4EBA;&#xFF0C;&#x6309;&#x7167;&#x6211;&#x7684;&#x6027;&#x683C;&#xFF0C;&#x6211;&#x4F1A;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x8BF4;&#x201C;&#x4E0D;&#x4F1A;&#x201D;&#xFF0C;&#x65AD;&#x4E86;&#x4ED6;&#x7684;&#x5FF5;&#x5934;&#x3002;&#x4F30;&#x8BA1;&#x73B0;&#x5728;&#x4E5F;&#x53EA;&#x6709;&#x5C0F;&#x654F;&#x77E5;&#x9053;&#x6211;&#x53EF;&#x4EE5;&#x9ED1;&#x522B;&#x4EBA;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x5728;&#x5355;&#x4F4D;&#x548C;&#x670B;&#x53CB;&#x7684;&#x773C;&#x91CC;&#xFF0C;&#x6211;&#x4E5F;&#x5C31;&#x662F;&#x4E2A;&#x201C;&#x7535;&#x8111;&#x9AD8;&#x624B;&#x201D;&#x800C;&#x5DF2;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5728;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#x9762;&#x524D;&#xFF0C;&#x8868;&#x73B0;&#x6B32;&#x5C31;&#x662F;&#x6709;&#x70B9;&#x5F3A;&#x3002;&#x8981;&#x4E0D;&#x600E;&#x4E48;&#x8BF4;&#x4EBA;&#x6027;&#x662F;&#x591A;&#x9762;&#x7684;&#x5462;&#xFF1F;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x5F53;&#x7136;&#x4F1A;&#x62C9;&#xFF0C;&#x5C0F;case&#x561B;&#x3002;&#x201D;&#x65E2;&#x7136;&#x627F;&#x8BA4;&#x4E86;&#xFF0C;&#x7D22;&#x6027;&#x6211;&#x5C31;&#x628A;&#x8BDD;&#x8BF4;&#x5927;&#x4E9B;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x771F;&#x7684;&#x5440;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x505C;&#x4E0B;&#x70B8;&#x5F39;&#x8D85;&#x4EBA;&#xFF0C;&#x7ACB;&#x523B;&#x88AB;&#x5BF9;&#x65B9;&#x653E;&#x9897;&#x70B8;&#x5F39;&#x5728;&#x5C41;&#x80A1;&#x540E;&#x9762;&#xFF0C;&#x7830;&#x7684;&#x4E00;&#x58F0;&#xFF0C;&#x58EE;&#x70C8;&#x727A;&#x7272;&#xFF0C;&#x5BF9;&#x65B9;&#x53D1;&#x51FA;&#x72DE;&#x7B11;&#x3002;&#x5C0F;&#x654F;&#x6CA1;&#x5728;&#x610F;&#xFF0C;&#x5979;&#x4E24;&#x773C;&#x653E;&#x5149;&#x5730;&#x76EF;&#x7740;&#x6211;&#x7684;&#x8138;&#x5462;&#x3002;&#x6211;&#x770B;&#x5230;&#x5979;&#x7684;&#x6210;&#x7EE9;&#x6BD4;&#x5BF9;&#x65B9;&#x9AD8;&#x51FA;&#x4E86;300&#x591A;&#x5206;&#x3002;&#x201C;&#x5FEB;&#x70B9;&#x6765;&#xFF0C;&#x7ED9;&#x6211;&#x8868;&#x6F14;&#x8868;&#x6F14;&#x3002;&#x201D;</p>
<p>&#x6CA1;&#x89C1;&#x8FC7;&#x5C0F;&#x654F;&#x8FD9;&#x4E48;&#x6BB7;&#x52E4;&#x3002;&#x5979;&#x4ECE;&#x6905;&#x5B50;&#x4E0A;&#x8D77;&#x6765;&#xFF0C;&#x62C9;&#x6211;&#x8FC7;&#x53BB;&#xFF0C;&#x6211;&#x5750;&#x5728;&#x6905;&#x5B50;&#x4E0A;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5979;&#x4E0D;&#x5BA2;&#x6C14;&#x5730;&#x5750;&#x5728;&#x6211;&#x7684;&#x817F;&#x4E0A;&#x3002;&#x4E00;&#x53EA;&#x624B;&#x6276;&#x7740;&#x6211;&#x7684;&#x8116;&#x5B50;&#xFF0C;&#x770B;&#x505A;&#x5C4F;&#x5E55;&#xFF0C;&#x7B49;&#x6211;&#x8868;&#x6F14;&#x3002;&#x5C0F;&#x654F;&#x4E2A;&#x5934;&#x4E0D;&#x77EE;&#xFF0C;1.65&#x7684;&#x4E2A;&#x5934;&#xFF0C;48&#x516C;&#x65A4;&#xFF0C;&#x6709;&#x70B9;&#x504F;&#x7626;&#xFF0C;&#x8EAB;&#x6750;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x597D;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x90A3;&#x79CD;&#x5403;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x80D6;&#x7684;&#x4EBA;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5979;&#x7684;&#x670B;&#x53CB;&#x548C;&#x540C;&#x4E8B;&#x662F;&#x6700;&#x7FA1;&#x6155;&#x5979;&#x7684;&#x3002;&#x5979;&#x662F;&#x77ED;&#x5934;&#x53D1;&#xFF0C;&#x76AE;&#x80A4;&#x5F88;&#x767D;&#xFF0C;&#x957F;&#x7684;&#x5F88;&#x50CF;&#x90A3;&#x4E2A;&#x201C;&#x6C38;&#x4E0D;&#x7791;&#x76EE;&#x201D;&#x91CC;&#x9762;&#x7684;&#x6B27;&#x9633;&#x5170;&#x5170;&#x7684;&#x626E;&#x6F14;&#x8005;&#x8881;&#x7ACB;&#x3002;&#x6211;&#x624D;1.70&#xFF0C;&#x73B0;&#x5728;&#x5728;&#x7537;&#x4EBA;&#x4E2D;&#x7EDD;&#x5BF9;&#x4E0D;&#x7B97;&#x9AD8;&#x3002;&#x6709;&#x70B9;&#x5FAE;&#x5FAE;&#x80D6;&#x3002;&#x5979;&#x548C;&#x6211;&#x4E00;&#x8D77;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x6562;&#x7A7F;&#x9AD8;&#x8DDF;&#x978B;&#xFF0C;&#x6015;&#x6211;&#x6709;&#x60F3;&#x6CD5;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x5E76;&#x4E0D;&#x5728;&#x610F;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5973;&#x4EBA;&#x7A7F;&#x9AD8;&#x6839;&#x978B;&#x66F4;&#x80FD;&#x663E;&#x51FA;&#x5973;&#x4EBA;&#x7684;&#x67D4;&#x5A9A;&#x3002;&#x73B0;&#x5728;&#x5979;&#x8FD9;&#x4E2A;pose&#xFF0C;&#x8BA9;&#x6211;&#x6709;&#x70B9;&#x5FC3;&#x733F;&#x610F;&#x9A6C;&#x3002;&#x5979;&#x8EAB;&#x4E0A;&#x6DE1;&#x6DE1;&#x7684;&#x9999;&#x5473;&#x5C31;&#x5728;&#x6211;&#x9F3B;&#x5B50;&#x4E0B;&#x9762;&#x718F;&#x7740;&#xFF0C;&#x6211;&#x90FD;&#x6709;&#x70B9;&#x8FF7;&#x7CCA;&#x4E86;&#x3002;&#x6211;&#x4E00;&#x53EA;&#x624B;&#x7F06;&#x4F4F;&#x5979;&#x7684;&#x8170;&#xFF0C;&#x4E00;&#x53EA;&#x624B;&#x6293;&#x4F4F;&#x4E86;&#x9F20;&#x6807;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x8868;&#x6F14;&#x5462;&#xFF1F;&#x6211;&#x5F00;&#x59CB;&#x60F3;&#x3002;&#x5982;&#x679C;&#x6211;&#x76F4;&#x63A5;&#x628A;&#x6211;&#x7684;&#x90A3;&#x4E9B;&#x8089;&#x9E21;&#xFF08;&#x88AB;&#x6211;&#x653B;&#x514B;&#x8FC7;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF09;&#x62FF;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E9B;&#x90FD;&#x662F;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x5B57;&#x7B26;&#xFF0C;&#x8F93;&#x5165;&#x547D;&#x4EE4;&#xFF0C;&#x5728;&#x5C0F;&#x654F;&#x5F00;&#x6765;&#x4E00;&#x5B9A;&#x6CA1;&#x4EC0;&#x4E48;&#x795E;&#x5947;&#x7684;&#xFF0C;&#x4F60;&#x8BF4;&#x4F60;&#x662F;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x4ED6;&#x4E5F;&#x4E0D;&#x61C2;&#x5440;&#xFF0C;&#x5BF9;&#x4ED6;&#x4EEC;&#x8FD9;&#x4E9B;&#x5916;&#x884C;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x91C7;&#x7528;&#x5916;&#x884C;&#x7684;&#x8868;&#x6F14;&#x65B9;&#x5F0F;&#xFF0C;&#x624D;&#x80FD;&#x51FA;&#x5F69;&#x3002;</p>
<p>&#x6211;&#x5F00;&#x59CB;&#x64CD;&#x4F5C;&#x4E86;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x5F00;&#x52A8;&#x626B;&#x63CF;&#x5668;&#x626B;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x5185;&#x90E8;&#x7F51;&#x3002;&#x6211;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6240;&#x5728;&#x7684;&#x5B50;&#x7F51;&#x6BB5;254&#x4E2A;&#x5730;&#x5740;&#x53EA;&#x6709;10&#x591A;&#x4E2A;&#x4EBA;&#x7528;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5176;&#x4ED6;&#x5730;&#x5740;&#x6211;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#xFF0C;&#x6211;&#x524D;&#x9762;&#x8BF4;&#x6211;&#x6709;&#x4E2A;c&#x7C7B;&#x5730;&#x5740;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x51FA;&#x53E3;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x52A8;&#x4E86;&#x624B;&#x811A;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4E0D;&#x4F1A;&#x641E;&#x4EFB;&#x4F55;&#x7834;&#x574F;&#x3002;&#x5154;&#x5B50;&#x8FD8;&#x4E0D;&#x5403;&#x7A9D;&#x8FB9;&#x8349;&#x5462;&#xFF0C;&#x6211;&#x6BD4;&#x5154;&#x5B50;&#x5F3A;&#x5427;&#xFF1F;&#x6839;&#x636E;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6211;&#x4EEC;&#x5185;&#x90E8;&#x7F51;&#x7684;&#x83DC;&#x9E1F;&#x5F88;&#x591A;&#x3002;&#x800C;&#x4E14;&#x90FD;&#x662F;&#x7528;&#x7684;windows&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x5F00;&#x7684;&#x626B;&#x63CF;&#x5668;&#x5C31;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x7684;&#x6D41;&#x5149;&#x3002;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5BF9;&#x4ED8;&#x83DC;&#x9E1F;&#x7684;&#x673A;&#x5668;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x679C;&#x7136;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;3&#x4E2A;&#x7F51;&#x6BB5;&#x626B;&#x5B8C;&#xFF0C;&#x627E;&#x5230;&#x5341;&#x51E0;&#x53F0;&#x6709;&#x6F0F;&#x6D1E;&#x7684;&#x673A;&#x5668;&#x3002;&#x5C0F;&#x654F;&#x5B89;&#x9759;&#x7684;&#x770B;&#x7740;&#xFF0C;&#x5C3D;&#x7BA1;&#x832B;&#x7136;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x5F88;&#x671F;&#x5F85;&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x201C;&#x627E;&#x5230;&#x4E86;&#x3002;&#x201D;&#xFF0C;&#x6211;&#x770B;&#x4E2D;&#x4E86;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x540D;&#x5B57;&#x53EB;ZCW&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;2000&#x4E13;&#x4E1A;&#x7248;&#x672C;&#x3002;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x5C45;&#x7136;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x540D;&#x5B57;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x522B;&#x7B11;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x72AF;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x73B0;&#x5728;&#x6211;&#x5DF2;&#x7ECF;&#x6709;100&#xFF05;&#x7684;&#x628A;&#x63E1;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x5C31;&#x662F;&#x4E0A;&#x4F20;&#x7A0B;&#x5E8F;&#xFF0C;&#x542F;&#x52A8;&#x4ED6;&#x7684;telnet service&#x3002;&#x7136;&#x540E;&#x8FDC;&#x7A0B;&#x8FDE;&#x63A5;&#xFF0C;&#x653E;&#x4E86;&#x4E2A;&#x5C4F;&#x5E55;&#x76D1;&#x89C6;&#x8F6F;&#x4EF6;&#x4E0A;&#x53BB;&#x3002;&#x7136;&#x540E;&#x542F;&#x52A8;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x6211;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x51FA;&#x73B0;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x5C4F;&#x5E55;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x641E;&#x5B9A;&#x4E86;&#x3002;&#x201D;&#x6211;&#x81EA;&#x4FE1;&#x7684;&#x56DE;&#x7B54;&#xFF0C;MM&#x773C;&#x775B;&#x771F;&#x7684;&#x653E;&#x5149;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x54C7;&#xFF0C;&#x4F60;&#x771F;&#x662F;&#x5389;&#x5BB3;&#x3002;&#x201D;&#x5979;&#x4F7F;&#x52B2;&#x634F;&#x6211;&#x7684;&#x8138;&#x3002;<br>&#x5509;&#xFF0C;&#x6211;&#x8FD9;MM&#x5C31;&#x8FD9;&#x6BDB;&#x75C5;&#xFF0C;&#x6309;&#x7406;&#x8BF4;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x7ED9;&#x6211;&#x4E2A;&#x9999;&#x543B;&#x624D;&#x5BF9;&#x3002;&#x53EF;&#x662F;&#x5979;&#x5C31;&#x662F;&#x559C;&#x6B22;&#x7528;&#x634F;&#x6765;&#x8868;&#x8FBE;&#x5979;&#x7684;&#x8D5E;&#x8D4F;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x79CD;&#x4F4E;&#x7EA7;&#x7684;&#x73A9;&#x610F;&#x5BF9;MM&#x6765;&#x8BF4;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5728;&#x5979;&#x773C;&#x91CC;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x653B;&#x7834;&#x4E86;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x7F51;&#x7AD9;&#x4E5F;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x5C4F;&#x5E55;&#x90A3;&#x6837;&#x8BA9;&#x5979;&#x5174;&#x594B;&#xFF0C;&#x5728;&#x5979;&#x773C;&#x91CC;&#xFF0C;&#x770B;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x5C4F;&#x5E55;&#x7EDD;&#x5BF9;&#x6BD4;&#x6211;&#x62E5;&#x6709;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x7F51;&#x7AD9;&#x7684;root&#x6743;&#x9650;&#x8981;&#x96BE;&#x7684;&#x591A;&#x3002;&#x7BA1;&#x5979;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4E0D;&#x8981;&#x89E3;&#x91CA;&#xFF0C;&#x89E3;&#x91CA;&#x4E86;&#x5979;&#x4E5F;&#x4E0D;&#x61C2;&#x3002;</p>
<p>&#x7136;&#x540E;mm&#x5F00;&#x59CB;&#x5927;&#x547C;&#x5C0F;&#x53EB;&#xFF0C;&#x5F00;&#x59CB;&#x53C2;&#x4E0E;&#x4E86;&#x3002;&#x9996;&#x5148;&#x5979;&#x770B;&#x5230;&#x4E86;&#x5BF9;&#x65B9;&#x7684;QQ&#x53F7;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;QQ&#x6B63;&#x5F00;&#x7740;&#x5462;&#x3002;&#x8FD9;&#x4E2A;&#x6B7B;&#x59AE;&#x5B50;&#x7684;&#x8111;&#x888B;&#x7EDD;&#x5BF9;&#x6BD4;&#x6211;&#x597D;&#x7528;&#xFF0C;&#x4E0D;&#x627F;&#x8BA4;&#x4E0D;&#x884C;&#x3002;&#x5979;&#x5C45;&#x7136;&#x6253;&#x5F00;QQ&#xFF0C;&#x5411;&#x5BF9;&#x65B9;&#x8BF7;&#x6C42;&#x804A;&#x5929;&#x3002;&#x5BF9;&#x65B9;&#x53EF;&#x80FD;&#x770B;&#x5979;&#x662F;&#x4E2A;MM&#xFF0C;&#x5C31;&#x63A5;&#x53D7;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x4EEC;&#x5F00;&#x59CB;&#x804A;&#x5929;&#x3002;&#x6211;&#x5728;&#x65C1;&#x8FB9;&#x63FD;&#x7740;MM&#xFF0C;&#x4EAB;&#x53D7;&#x7684;&#x770B;&#x7740;&#x3002;MM&#x5174;&#x594B;&#x7684;&#x4E0D;&#x884C;&#xFF0C;&#x4E00;&#x8FB9;&#x804A;&#x4E00;&#x8FB9;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x5BF9;&#x65B9;&#x95EE;&#xFF1A;&#x201C;&#x4F60;&#x662F;&#x8C01;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;MM&#x56DE;&#xFF1A;&#x201C;&#x4E0D;&#x8981;&#x7BA1;&#x6211;&#x662F;&#x8C01;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x77E5;&#x9053;&#x4F60;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x5BF9;&#x65B9;&#x95EE;&#xFF1A;&#x201C;&#x4F60;&#x600E;&#x4E48;&#x8BA4;&#x8BC6;&#x6211;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;MM&#x56DE;&#xFF1A;&#x201C;&#x6211;&#x77E5;&#x9053;&#x4F60;&#x662F;&#x67D0;&#x67D0;&#x5355;&#x4F4D;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x5BF9;&#x65B9;&#x663E;&#x7136;&#x5F88;&#x60CA;&#x8BB6;&#xFF0C;&#x7ACB;&#x523B;&#x8BF4;&#x51FA;&#x4E86;&#x4E00;&#x4E32;&#x4ED6;&#x8BA4;&#x4E3A;&#x53EF;&#x80FD;&#x662F;MM&#x7684;&#x540D;&#x5B57;&#x3002;<br>&#x3000;&#x3000;MM&#x90FD;&#x56DE;&#xFF1A;&#x4E0D;&#x662F;&#x3002;&#x7136;&#x540E;&#x5C31;&#x7B11;&#x3002;<br>&#x3000;&#x3000;MM&#x53C8;&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x73B0;&#x5728;&#x5728;&#x73A9;&#x5766;&#x514B;&#x5927;&#x6218;&#x5BF9;&#x4E0D;&#x5BF9;&#xFF1F;&#x201D;&#x5C4F;&#x5E55;&#x4E0A;&#x770B;&#x7684;&#x51FA;&#x6765;&#xFF0C;&#x5BF9;&#x65B9;&#x5728;&#x73A9;&#x5766;&#x514B;&#x5927;&#x6218;&#x3002;<br>&#x3000;&#x3000;&#x5BF9;&#x65B9;&#x66F4;&#x52A0;&#x60CA;&#x5947;&#x4E86;&#xFF0C;&#x8FC7;&#x4E86;&#x534A;&#x5929;&#x624D;&#x8BF4;&#xFF1A;&#x201C;&#x4E0D;&#x5BF9;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x5BF9;&#x65B9;&#x5DF2;&#x7ECF;&#x5173;&#x4E86;&#x5766;&#x514B;&#xFF0C;&#x5728;&#x73A9;&#x6251;&#x514B;&#x724C;&#x4E86;&#x3002;<br>&#x3000;&#x3000;MM&#x7B11;&#x7684;&#x4E0D;&#x884C;&#xFF0C;&#x641E;&#x7684;&#x6211;&#x90FD;&#x8DDF;&#x7740;&#x5979;&#x98A4;&#x6296;&#x3002;<br>&#x3000;&#x3000;MM&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x73B0;&#x5728;&#x5728;&#x73A9;&#x6251;&#x514B;&#x724C;&#x5BF9;&#x4E0D;&#x5BF9;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x5BF9;&#x65B9;&#x663E;&#x7136;&#x592A;&#x60CA;&#x5F02;&#x4E86;&#xFF0C;&#x534A;&#x5929;&#x5C4F;&#x5E55;&#x90FD;&#x6CA1;&#x6709;&#x52A8;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4F5C;&#x4EC0;&#x4E48;&#x53BB;&#x4E86;&#x3002;MM&#x5927;&#x7B11;&#xFF0C;&#x8BF4;&#xFF0C;&#x4ED6;&#x80AF;&#x5B9A;&#x5230;&#x5904;&#x5230;&#x623F;&#x95F4;&#x67E5;&#x770B;&#x53BB;&#x4E86;&#xFF0C;&#x770B;&#x662F;&#x5426;&#x6709;&#x76D1;&#x89C6;&#x5668;&#x3002;&#x5475;&#x5475;&#xFF0C;MM&#x8BF4;&#x7684;&#x8BF4;&#x4E0D;&#x5B9A;&#x771F;&#x662F;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5BF9;&#x65B9;&#x9F20;&#x6807;&#x5F00;&#x59CB;&#x52A8;&#x4E86;&#xFF0C;&#x56DE;&#x8BDD;&#x4E86;&#xFF1A;&#x201C;&#x4F60;&#x771F;&#x662F;&#x4F1A;&#x731C;&#xFF01;&#x201D;</p>
<p>&#x7136;&#x540E;&#x4ED6;&#x542F;&#x52A8;&#x4E86;&#x6740;&#x6BD2;&#x8F6F;&#x4EF6;&#xFF0C;&#x770B;&#x6765;&#x4ED6;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x4E2D;&#x4E86;&#x75C5;&#x6BD2;&#x4E86;&#x3002;&#x6211;&#x770B;&#x4ED6;&#x7528;&#x7684;&#x662F;&#x91D1;&#x5C71;&#x6BD2;&#x9738;&#x3002;&#x6587;&#x4EF6;&#x98DE;&#x5FEB;&#x7684;&#x95EA;&#x52A8;&#xFF0C;MM&#x95EE;&#x6211;&#xFF1A;&#x201C;&#x4ED6;&#x5728;&#x6740;&#x6BD2;&#xFF0C;&#x4F1A;&#x4E0D;&#x4F1A;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#xFF1F;&#x201D;mm&#x4E0D;&#x7B11;&#x4E86;<br>&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x653E;&#x5FC3;&#x5566;&#xFF0C;&#x8FD9;&#x4E2A;&#x6293;&#x5C4F;&#x8F6F;&#x4EF6;&#x662F;&#x7279;&#x5236;&#x7684;&#x3002;&#x4E00;&#x822C;&#x6740;&#x6BD2;&#x8F6F;&#x4EF6;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x7684;&#x3002;&#x201D;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x3002;&#x522B;&#x4EBA;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x6740;&#x6BD2;&#x8F6F;&#x4EF6;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x7684;&#x3002;</p>
<p>&#x679C;&#x7136;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5BF9;&#x65B9;&#x505C;&#x6B62;&#x4E86;&#x6740;&#x6BD2;&#x3002;&#x4ED6;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x53D1;&#x73B0;&#x3002;MM&#x53C8;&#x5F00;&#x59CB;&#x9AD8;&#x5174;&#x4E86;&#x3002;MM&#x7EE7;&#x7EED;&#x548C;&#x90A3;&#x4E2A;&#x5BB6;&#x4F19;&#x5F00;&#x7740;&#x73A9;&#x7B11;&#x3002;&#x5B8C;&#x5168;&#x662F;&#x4E00;&#x4E2A;&#x732B;&#x5728;&#x73A9;&#x4E00;&#x4E2A;&#x8001;&#x9F20;&#x7684;&#x611F;&#x89C9;&#x3002;MM&#x8FB9;&#x548C;&#x90A3;&#x4E2A;&#x4EBA;&#x804A;&#x5929;&#xFF0C;&#x4E00;&#x8FB9;&#x5F00;&#x59CB;&#x7FFB;&#x5BF9;&#x65B9;&#x7684;&#x78C1;&#x76D8;&#x3002;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;mm&#x5F88;&#x719F;&#x7EC3;&#xFF0C;&#x6BD5;&#x7ADF;&#x5979;&#x4E5F;&#x662F;&#x4E0A;&#x8FC7;&#x7535;&#x8111;&#x57F9;&#x8BAD;&#x73ED;&#x7684;&#x3002;&#x51B5;&#x4E14;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;2&#x7EA7;&#x4E5F;&#x662F;&#x8FC7;&#x4E86;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x8003;&#x7684;&#x662F;foxpro&#x3002;&#x6211;&#x4E5F;&#x5728;&#x770B;&#x7740;&#x3002;&#x6211;&#x4E5F;&#x60F3;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x662F;&#x8C01;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4E0D;&#x662F;&#x6211;&#x8FD9;&#x4E2A;&#x7F51;&#x6BB5;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x51E0;&#x767E;&#x53F7;&#x4EBA;&#xFF0C;&#x6211;&#x4E0D;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x662F;&#x8C01;&#x3002;MM&#x7FFB;&#x4E86;&#xFF0C;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7167;&#x7247;&#x76EE;&#x5F55;&#xFF0C;&#x4E0A;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x7167;&#x7247;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x6709;&#x70B9;&#x50CF;&#x6211;&#x4EEC;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x90A3;&#x4E2A;&#x79D1;&#x957F;&#x3002;&#x7136;&#x540E;&#x6211;&#x6709;&#x770B;&#x5230;&#x4E00;&#x4EFD;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x5E74;&#x5EA6;&#x62A5;&#x544A;&#x3002;&#x6CA1;&#x9519;&#xFF0C;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x4EBA;&#x3002;&#x6CA1;&#x4EC0;&#x4E48;&#x4EA4;&#x9053;&#x3002;&#x4F46;&#x662F;&#x6211;&#x77E5;&#x9053;&#x4ED6;&#x3002;&#x86EE;&#x4E25;&#x8083;&#x7684;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x540E;&#x9762;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x8BA9;&#x4EBA;&#x5C34;&#x5C2C;&#x4E86;&#x3002;MM&#x5C45;&#x7136;&#x7FFB;&#x5230;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x3002;&#x5F00;&#x59CB;&#x6211;&#x4EEC;&#x90FD;&#x6CA1;&#x5728;&#x610F;&#xFF0C;MM&#x6253;&#x5F00;&#x5176;&#x4E2D;&#x4E00;&#x526F;&#x7167;&#x7247;&#x3002;&#x5929;&#xFF0C;&#x5C45;&#x7136;&#x51FA;&#x6765;&#x4E00;&#x5F20;sex&#x7167;&#x7247;&#x3002;&#x975E;&#x5E38;&#x6E05;&#x695A;&#x548C;&#x9732;&#x9AA8;&#x7684;&#x90A3;&#x79CD;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x662F;&#x8001;&#x4E0A;&#x7F51;&#x7684;&#xFF0C;&#x4EE5;&#x524D;&#x770B;&#x8FC7;&#x79CD;&#x7167;&#x7247;&#x3002;&#x6CA1;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x548C;MM&#x76F8;&#x5904;&#x8FD9;&#x4E48;&#x8FD1;&#xFF0C;&#x7A81;&#x7136;&#x8E66;&#x51FA;&#x8FD9;&#x4E48;&#x4E00;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x4F60;&#x8BF4;&#x6709;&#x591A;&#x5C34;&#x5C2C;&#xFF1F;&#x5F53;&#x65F6;&#x6211;&#x548C;MM&#x90FD;&#x50BB;&#x4E86;&#xFF0C;MM&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x4F5C;&#x4E86;&#xFF0C;&#x5C31;&#x90A3;&#x4E48;&#x505C;&#x6B62;&#x4E86;&#x3002;&#x65F6;&#x95F4;&#x90FD;&#x505C;&#x6B62;&#x4E86;&#x3002;&#x6211;&#x770B;&#x5230;MM&#x7684;&#x8138;&#x7EA2;&#x4E86;&#xFF0C;&#x6211;&#x60F3;&#x5979;&#x4E5F;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x6211;&#x7684;&#x8138;&#x7EA2;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x5C31;&#x8FD9;&#x4E48;&#x76EF;&#x7740;&#x534A;&#x5929;&#x3002;&#x90FD;&#x4E0D;&#x8BF4;&#x8BDD;&#x3002;&#x5176;&#x5B9E;MM&#x662F;&#x5B66;&#x533B;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5916;&#x79D1;&#x3002;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x5BF9;&#x5979;&#x6765;&#x8BF4;&#x5E94;&#x8BE5;&#x6CA1;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x5982;&#x679C;&#x5728;&#x5E73;&#x65F6;&#xFF0C;&#x6211;&#x60F3;&#x5979;&#x4E5F;&#x4E0D;&#x4F1A;&#x7EA2;&#x8138;&#x3002;&#x5173;&#x952E;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x5979;&#x5750;&#x5728;&#x6211;&#x817F;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x7A81;&#x7136;&#x51FA;&#x6765;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x8BF4;&#xFF0C;&#x6362;&#x4E86;&#x4F60;&#xFF0C;&#x4F60;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;MM&#x4E0D;&#x6562;&#x770B;&#x6211;&#x7684;&#x773C;&#x775B;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x5F00;&#x59CB;&#x7B11;&#xFF0C;MM&#x662F;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x7684;&#x7B11;&#xFF0C;&#x6211;&#x662F;&#x6545;&#x4F5C;&#x574F;&#x574F;&#x7684;&#x7B11;&#x3002;&#x7136;&#x540E;MM&#x5C31;&#x8FD9;&#x4E48;&#x628A;&#x90A3;&#x4E2A;&#x6587;&#x4EF6;&#x5173;&#x4E86;&#x3002;&#x8FDE;&#x67E5;&#x770B;&#x5BF9;&#x65B9;&#x5176;&#x4ED6;&#x8D44;&#x6599;&#x7684;&#x52C7;&#x6C14;&#x90FD;&#x6CA1;&#x6709;&#x4E86;&#x3002;</p>
<p>MM&#x5C31;&#x8BF4;&#xFF1A;&#x201C;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x8BA1;&#x7B97;&#x673A;&#x91CC;&#x9762;&#x6709;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x662F;&#x597D;&#x4EBA;&#xFF01;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x8BF4;&#xFF1A;&#x201D;&#x8FD9;&#x6709;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x662F;&#x641E;&#x533B;&#x5B66;&#x7684;&#xFF0C;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x8FD9;&#x5F88;&#x6B63;&#x5E38;&#x5440;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x5728;&#x60F3;&#xFF0C;&#x771F;&#x6CA1;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x5E73;&#x65F6;&#x7792;&#x4E25;&#x8083;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x8FD9;&#x4E2A;&#x55DC;&#x597D;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x201C;&#x90A3;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x91CC;&#x9762;&#x6709;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x4E1C;&#x897F;&#x5440;&#xFF1F;&#x201D;&#xFF0C;MM&#x5F00;&#x59CB;&#x7FFB;&#x770B;&#x6211;&#x7684;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x4E86;&#x3002;<br>&#x201C;&#x4FDD;&#x8BC1;&#x6CA1;&#x6709;&#xFF0C;&#x6211;&#x662F;&#x90A3;&#x6837;&#x7684;&#x4EBA;&#x5417;&#xFF1F;&#x201D;&#x6211;&#x5927;&#x4F5C;&#x65E0;&#x8F9C;&#x72B6;&#x3002;&#x6211;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x6015;&#x3002;MM&#x7ECF;&#x5E38;&#x7FFB;&#x6211;&#x7684;&#x7535;&#x8111;&#x3002;&#x6211;&#x5373;&#x4F7F;&#x6709;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x600E;&#x4E48;&#x4E5F;&#x4E0D;&#x4F1A;&#x653E;&#x5230;&#x90A3;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x5373;&#x4F7F;&#x8981;&#x653E;&#xFF0C;&#x6211;&#x4E5F;&#x4F1A;&#x7528;&#x70B9;&#x624B;&#x6BB5;&#xFF0C;&#x9664;&#x4E86;&#x6211;&#xFF0C;&#x4F60;&#x6839;&#x672C;&#x5C31;&#x770B;&#x4E0D;&#x5230;&#x3002;</p>
<p>&#x5F53;&#x7136;MM&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x4EFB;&#x4F55;&#x7F6A;&#x8BC1;&#x3002;&#x8FD9;&#x4E48;&#x4E00;&#x95F9;&#xFF0C;MM&#x5931;&#x53BB;&#x4E86;&#x5174;&#x8DA3;&#x3002;&#x6211;&#x4E5F;&#x98DE;&#x5FEB;&#x5730;&#x5220;&#x6389;&#x4E86;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x6211;&#x4E0A;&#x4F20;&#x4E0A;&#x53BB;&#x7684;&#x4E1C;&#x897F;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x559C;&#x6B22;&#x770B;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x5417;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x574F;&#x6000;&#x7684;&#x95EE;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4E0D;&#x559C;&#x6B22;&#x3002;&#x201D;&#x6211;&#x6BEB;&#x4E0D;&#x72B9;&#x8C6B;&#x7684;&#x56DE;&#x7B54;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4EEC;&#x7537;&#x4EBA;&#x662F;&#x4E0D;&#x662F;&#x90FD;&#x559C;&#x6B22;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x53C8;&#x95EE;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5176;&#x4ED6;&#x4EBA;&#x4E5F;&#x8BB8;&#x5427;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x3002;&#x201D;&#x6211;&#x77E5;&#x9053;&#x6211;&#x53EF;&#x80FD;&#x8A00;&#x4E0D;&#x7531;&#x8877;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5E76;&#x4E0D;&#x60F3;&#x6328;&#x63CD;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x90A3;&#x4F60;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x5C0F;&#x654F;&#x770B;&#x7740;&#x6211;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x4F4E;&#x4F4E;&#x7684;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5FC3;&#x4E2D;&#x4E00;&#x9635;&#x8361;&#x6F3E;&#xFF0C;&#x5FC3;&#x91CC;&#x65E0;&#x9650;&#x7684;&#x6E29;&#x67D4;&#xFF0C;&#x5C0F;&#x654F;&#x6B64;&#x65F6;&#x771F;&#x7684;&#x5F88;&#x6E29;&#x67D4;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x50CF;&#x53EA;&#x5C0F;&#x732B;&#x501A;&#x5728;&#x6211;&#x7684;&#x8EAB;&#x4E0A;&#x3002;&#x5C0F;&#x654F;&#xFF0C;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x662F;&#x4F60;&#x3002;&#x6211;&#x8BF4;&#x7684;&#x662F;&#x8001;&#x5B9E;&#x8BDD;&#xFF0C;&#x5C0F;&#x654F;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x4E2A;&#x5973;&#x670B;&#x53CB;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x4E5F;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x3002;&#x6211;&#x770B;&#x7740;&#x5979;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x6E29;&#x67D4;&#x7684;&#x8BF4;&#x51FA;&#x4E00;&#x4E2A;&#x5B57;&#xFF1A;&#x201C;&#x4F60;&#x3002;&#x201D;</p>
<p>&#x5C0F;&#x654F;&#x53CC;&#x624B;&#x5F00;&#x59CB;&#x94A9;&#x7740;&#x6211;&#x7684;&#x8116;&#x5B50;&#xFF0C;&#x5979;&#x5507;&#x78B0;&#x4E0A;&#x4E86;&#x6211;&#x7684;&#x3002;&#x6211;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter1.html" class="navigation navigation-prev " aria-label="Previous page: 第一章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter3.html" class="navigation navigation-next " aria-label="Next page: 第三章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第二章","level":"1.3","depth":1,"next":{"title":"第三章","level":"1.4","depth":1,"path":"chapter3.md","ref":"chapter3.md","articles":[]},"previous":{"title":"第一章","level":"1.2","depth":1,"path":"chapter1.md","ref":"chapter1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter2.md","mtime":"2017-02-27T04:00:26.584Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

