
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十四章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="chapter13.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十四章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6F14;&#x620F;7">&#x6F14;&#x620F;[7]</h2>
<p>&#x5F53;&#x6211;&#x770B;&#x5230;&#x90A3;&#x4E2A;1433&#x7AEF;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5FC3;&#x4E2D;&#x6709;&#x70B9;&#x4FE1;&#x5FC3;&#x4E86;&#x3002;</p>
<p>&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x7CFB;&#x7EDF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x8F6F;&#x4EF6;&#x8D8A;&#x6765;&#x8D8A;&#x6210;&#x719F;&#xFF0C;&#x6F0F;&#x6D1E;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x7279;&#x522B;&#x662F;WWW&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x5982;&#x679C;&#x7528;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x5B89;&#x5168;&#x6027;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x9ED1;&#x5BA2;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x3002;</p>
<p>&#x867D;&#x7136;&#x4E0D;&#x81F3;&#x4E8E;&#x706D;&#x4EA1;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x50CF;&#x51F6;&#x731B;&#x7684;&#x8001;&#x864E;&#x4E00;&#x6837;&#xFF0C;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5927;&#x90E8;&#x5206;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x8005;&#x7684;&#x52AA;&#x529B;&#x4E0B;&#xFF0C;&#x8F6F;&#x4EF6;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x6210;&#x719F;&#xFF0C;&#x9ED1;&#x5BA2;&#x7684;&#x7A7A;&#x95F4;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#xFF0C;&#x8F6F;&#x4EF6;&#x754C;&#x6709;&#x4E0D;&#x5B58;&#x5728;&#x7EDD;&#x5BF9;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x627F;&#x8BA4;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x771F;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x968F;&#x7740;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8FD0;&#x7528;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x653B;&#x51FB;&#x9010;&#x6E10;&#x6210;&#x4E3A;&#x9ED1;&#x5BA2;&#x4EBA;&#x653B;&#x51FB;&#x7684;&#x65B0;&#x76EE;&#x6807;&#x3002;</p>
<p>&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x4E5F;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x7F51;&#x4E0A;&#x5C45;&#x7136;&#x8FD9;&#x4E48;&#x591A;&#x4EBA;&#x7528;MS&#x7684;&#x670D;&#x52A1;&#x5668;&#x8F6F;&#x4EF6;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x8BF4;&#x505A;&#x684C;&#x9762;&#xFF0C;&#x6211;&#x59CB;&#x7EC8;&#x8BA4;&#x4E3A;ms&#x662F;NO.1&#x3002;&#x5C3D;&#x7BA1;&#xFF0C;MAC&#x5F88;&#x4F18;&#x79C0;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x901A;&#x7528;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#xFF0C;&#x8FD8;&#x662F;MS&#x66F4;&#x5389;&#x5BB3;&#x3002;&#x5E02;&#x573A;&#x7684;&#x9009;&#x62E9;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x4E71;&#x6765;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5982;&#x679C;&#x8BF4;&#x505A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x9009;&#x62E9;&#x7684;&#x4E1C;&#x897F;&#x592A;&#x591A;&#xFF0C;&#x65E0;&#x8BBA;&#x600E;&#x4E48;&#x8BF4;&#xFF0C;MS&#x90FD;&#x662F; NO.eleven.&#x5475;&#x5475;&#xFF0C;&#x6392;&#x540D;&#x6700;&#x540E;&#x7684;&#x3002;</p>
<p>&#x8BF4;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4FBF;&#x5B9C;&#x751A;&#x81F3;&#x514D;&#x8D39;&#xFF0C;&#x7A33;&#x5B9A;&#xFF0C;&#x6F0F;&#x6D1E;&#x5C11;&#x7684;like unix&#x7CFB;&#x7EDF;&#x591A;&#x4E86;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x8BBA;&#x670D;&#x52A1;&#x5668;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E16;&#x754C;&#x4E00;&#x4E9B;&#x7231;&#x597D;&#x8005;&#x81EA;&#x5DF1;&#x7684;apache project&#xFF0C;&#x6D8C;&#x73B0;&#x4E86;&#x5982;&#x6B64;&#x591A;&#x7684;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD8;&#x514D;&#x8D39;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7528;&#xFF1F;</p>
<p>&#x8BBA;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#xFF0C;&#x6709;&#x94B1;&#x4F60;&#x5C31;&#x7528;oracle&#xFF0C;&#x6CA1;&#x94B1;&#x5C31;&#x7528;postgresql&#xFF0C;&#x5C0F;&#x578B;&#x5C31;&#x7528;mysql&#x3002;&#x6BD4;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x7528;ms sql &#xFF1F;</p>
<p>MS sql&#x7684;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#xFF0C;&#x7B80;&#x5355;&#x6613;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x5F3A;&#x5927;&#xFF0C;&#x9690;&#x85CF;&#x4E86;&#x592A;&#x591A;&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x800C;&#x4E14;&#x662F;&#x6267;&#x884C;&#x672C;&#x5730;&#x547D;&#x4EE4;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x5BF9;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x662F;&#x81F4;&#x547D;&#x7684;&#xFF01;</p>
<p>&#x5F88;&#x5C11;&#x5927;&#x578B;&#x7684;&#x5546;&#x7528;&#x6570;&#x636E;&#x5E93;&#x7528;ms sql&#x7684;&#x3002;</p>
<p>&#x5BF9;oracle&#x6211;&#x662F;&#x670D;&#x6C14;&#x7684;&#xFF0C;&#x6211;&#x5BF9;&#x8BB8;&#x591A;oracle&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x8FC7;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5931;&#x8D25;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x77E5;&#x8BC6;&#x5FC5;&#x987B;&#x662F;&#x5168;&#x9762;&#x7684;&#x3002;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x5C31;&#x662F;&#x641E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E0D;&#x61C2;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#xFF0C;&#x61C2;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x53C8;&#x4E0D;&#x61C2;&#x6570;&#x636E;&#x5E93;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6F0F;&#x6D1E;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x3002;</p>
<p>ms sql&#x5C31;&#x662F;&#x52A0;&#x4E86;&#x8865;&#x4E01;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x6CA1;&#x7528;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x6D4B;&#x8BD5;&#x8FC7;&#xFF0C;&#x7A0D;&#x7A0D;&#x6539;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F;&#xFF0C;&#x7167;&#x6837;&#x653B;&#x5165;&#xFF01;</p>
<p>&#x201C;&#x5C0F;&#x738B;&#xFF0C;&#x8FC7;&#x6765;&#x770B;&#x201D;&#x8001;&#x5F20;&#x558A;&#x6211;&#x3002;</p>
<p>&#x6211;&#x8FC7;&#x53BB;&#x4E00;&#x770B;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x8001;&#x5F20;&#x548C;&#x6211;&#x521A;&#x624D;&#x653B;&#x51FB;&#x6210;&#x529F;&#x4E86;98&#xFF0C;&#x601D;&#x7EF4;&#x90FD;&#x662F;&#x548C;&#x6211;&#x4E00;&#x6837;&#x7684;&#x3002;&#x4ED6;&#x4E5F;&#x5728;&#x626B;&#x90A3;&#x4E2A;&#x7F51;&#x6BB5;&#x7684;&#x673A;&#x5668;&#x3002;</p>
<p>&#x4ED6;&#x4E5F;&#x5C45;&#x7136;&#x627E;&#x5230;&#x6211;&#x76EF;&#x7740;&#x7684;&#x90A3;&#x592A;&#x6709;mssql&#x7684;&#x673A;&#x5668;&#x3002;</p>
<p>&#x201C;&#x6211;&#x4E5F;&#x5728;&#x76EF;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x201D;&#x6211;&#x6DE1;&#x6DE1;&#x7684;&#x8BF4;&#x3002;&#x8001;&#x5F20;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x50CF;&#x4E2A;&#x5B69;&#x5B50;&#xFF0C;&#x5634;&#x91CC;&#x8FD8;&#x5728;&#x54FC;&#x6B4C;&#x66F2;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x57FA;&#x672C;&#x5DE6;&#x7684;&#x8BA9;&#x6211;&#x6CA1;&#x542C;&#x51FA;&#x6765;&#x662F;&#x4EC0;&#x4E48;&#x66F2;&#x5B50;&#x3002;</p>
<p>&#x201C;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#x6253;&#x5F00;&#x7740;&#xFF0C;&#x6211;&#x4EEC;&#x7834;&#x8BD1;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x770B;&#x770B;&#x5982;&#x4F55;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x4E0D;&#x53EF;&#x80FD;&#x5F88;&#x957F;&#x3002;&#x201C;&#x3002;&#x8001;&#x5F20;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x8FD9;&#x4E2A;&#x529E;&#x6CD5;&#x7B28;&#x662F;&#x7B28;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x6CA1;&#x6709;&#x52A0;&#x5B89;&#x5168;&#x7B56;&#x7565;&#x7684;&#x8BDD;&#xFF0C;&#x6210;&#x529F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x6BD4;&#x8F83;&#x5927;&#x201D;&#x3002;</p>
<p>&#x201C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x53EF;&#x80FD;&#x4E0D;&#x884C;&#xFF0C;&#x6211;&#x4EEC;&#x591A;&#x641E;&#x51E0;&#x53F0;&#x673A;&#x5668;&#x540C;&#x65F6;&#x6765;&#xFF0C;&#x5982;&#x4F55;&#xFF1F;&#x201D;&#x5475;&#x5475;&#xFF0C;&#x53CD;&#x6B63;&#x8FD9;&#x662F;&#x516C;&#x5BB6;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4E0D;&#x7528;&#x767D;&#x4E0D;&#x7528;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x201C;&#x600E;&#x4E48;&#xFF0C;&#x4F60;&#x60F3;&#x641E;&#x4E2A;&#x96C6;&#x7FA4;&#xFF1F;&#x201D;&#x8001;&#x5F20;&#x7B11;&#x7740;&#x770B;&#x6211;&#x3002;</p>
<p>&#x201C;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x6B7B;&#x9A6C;&#x5F53;&#x6D3B;&#x9A6C;&#x533B;&#x3002;&#x201D;&#x6211;&#x86EE;&#x6709;&#x5174;&#x81F4;&#x7684;&#x3002;</p>
<p>&#x201C;&#x597D;&#xFF0C;&#x53CD;&#x6B63;&#x6CA1;&#x4E8B;&#x60C5;&#x201D;&#x8001;&#x5F20;&#x4E5F;&#x6709;&#x5174;&#x8DA3;&#x3002;</p>
<p>&#x641E;&#x8BA1;&#x7B97;&#xFF0C;linux&#x7CFB;&#x7EDF;&#x6BD4;windows&#x597D;&#x7684;&#x591A;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x90FD;&#x5B89;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;linux&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;3&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x52A0;&#x4E0A;&#x90A3;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5728;&#x7F51;&#x4E0A;&#x53BB;&#x627E;&#x4E86;&#x4E2A;mosix&#xFF0C;&#x8FD9;&#x4E2A;&#x641E;&#x5206;&#x5E03;&#x8FD0;&#x7B97;&#x4E0D;&#x9519;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x8FDB;&#x7A0B;&#x8FC1;&#x79FB;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x628A;&#x4E00;&#x5207;&#x641E;&#x505C;&#x5F53;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x665A;&#x4E0A;12&#x70B9;&#x4E86;&#x3002;</p>
<p>&#x5F00;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x591A;&#x7EBF;&#x7A0B;sql &#x5BC6;&#x7801;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x7761;&#x89C9;&#x53BB;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x5171;&#x5F00;&#x4E86;&#x4E0A;&#x5343;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x57FA;&#x672C;&#x4E09;&#x53F0;&#x673A;&#x5668;&#x90FD;&#x5728;&#x6EE1;&#x8D1F;&#x8377;&#x8FD0;&#x88C5;&#x4E86;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x60F3;&#x5230;&#xFF0C;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#xFF0C;&#x4E00;&#x5927;&#x65E9;&#x88AB;&#x8001;&#x5F20;&#x558A;&#x9192;&#x3002;</p>
<p>&#x6211;&#x61F5;&#x61F5;&#x61C2;&#x61C2;&#x7741;&#x5F00;&#x773C;&#x775B;&#xFF1A;&#x201D;&#x600E;&#x4E48;&#x62C9;&#xFF1F;&#x201C;</p>
<p>&#x8001;&#x5F20;&#x7684;&#x8138;&#x90FD;&#x7B11;&#x70C2;&#x4E86;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E00;&#x5F20;&#x707F;&#x70C2;&#x7684;&#x8138;&#x5728;&#x6211;&#x773C;&#x524D;&#x6643;&#xFF0C;&#x771F;&#x4E0D;&#x6562;&#x76F8;&#x4FE1;&#x662F;&#x8001;&#x5F20;&#x7684;&#x8138;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x201C;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#x4E86;&#x201D;&#x3002;</p>
<p>&#x201C;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x5FEB;&#x5427;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x9A97;&#x6211;&#x201D;</p>
<p>&#x201C;&#x771F;&#x7684;&#xFF0C;&#x771F;&#x7684;&#xFF0C;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4F60;&#x731C;&#x5BC6;&#x7801;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x8001;&#x5F20;&#x7EE7;&#x7EED;&#x7B11;&#x3002;</p>
<p>&#x6CA1;&#x770B;&#x5230;&#x8001;&#x5F20;&#x8FD9;&#x4E48;&#x5F00;&#x5FC3;&#x7684;&#x3002;</p>
<p>&#x6211;&#x8D76;&#x7D27;&#x51B2;&#x5230;&#x673A;&#x5668;&#x4E0A;&#x770B;&#xFF0C;&#x679C;&#x7136;&#x6211;&#x4EEC;&#x7684;&#x96C6;&#x7FA4;&#x8F6F;&#x4EF6;&#x91CC;&#x9762;&#x8FDB;&#x7A0B;&#x6570;&#x5DF2;&#x7ECF;&#x6062;&#x590D;&#x6B63;&#x5E38;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x989D;&#x5916;&#x7684;&#x8FDB;&#x7A0B;&#x8D1F;&#x8377;&#x4E86;&#x3002;</p>
<p>&#x663E;&#x7136;&#x5BC6;&#x7801;&#x6D4B;&#x8BD5;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;&#xFF0C;&#x7ED3;&#x675F;&#x7684;&#x6761;&#x4EF6;&#x5F53;&#x7136;&#x662F;&#x7684;&#x63A2;&#x6D4B;&#x5230;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x5BC6;&#x7801;&#x3002;</p>
<p>&#x6211;&#x719F;&#x7EC3;&#x7684;&#x6572;&#x51FA;&#x67E5;&#x5BC6;&#x7801;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5BC6;&#x7801;&#x5C45;&#x7136;&#x662F;&#x7684;123321&#xFF01;&#x6211;&#x6655;&#xFF0C;&#x96BE;&#x602A;&#x8001;&#x5F20;&#x7B11;&#x7684;&#x8FD9;&#x4E48;&#x6B22;&#x3002;</p>
<p>&#x201C;&#x6211;&#x9760;&#xFF01;&#x201D;&#x6765;&#x4E86;&#x53E5;&#xFF0C;&#x7136;&#x540E;&#x4E5F;&#x7B11;&#x8D77;&#x6765;&#xFF01;</p>
<p>&#x8FD9;&#x4E2A;&#x673A;&#x5668;&#x7684;&#x4E3B;&#x4EBA;&#x770B;&#x6765;&#x4E0D;&#x77E5;&#x9053;&#x4ED6;&#x8FD9;&#x4E2A;&#x5BC6;&#x7801;&#x591A;&#x4E48;&#x7684;&#x5371;&#x9669;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x4E0D;&#x8981;&#x7B11;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x7F51;&#x4E0A;&#x5F88;&#x591A;&#x6559;&#x7A0B;&#x5343;&#x53EE;&#x5631;&#xFF0C;&#x4E07;&#x53EE;&#x5631;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5BC6;&#x7801;&#x90FD;&#x4E0D;&#x4F1A;&#x8BBE;&#xFF01;&#x8FD9;&#x4F4D;&#x8FD8;&#x77E5;&#x9053;&#x8BBE;&#x7F6E;&#x4E2A;&#x5BC6;&#x7801;&#x3002;</p>
<p>&#x53EF;&#x60DC;&#x4ED6;&#x8FD9;&#x4E2A;&#x5BC6;&#x7801;&#x592A;&#x8FC7;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x201C;&#x53EF;&#x60DC;&#x6211;&#x7684;&#x96C6;&#x7FA4;&#x201D;&#x6211;&#x5FC3;&#x91CC;&#x5C45;&#x7136;&#x6CA1;&#x6709;&#x83B7;&#x5F97;&#x5BC6;&#x7801;&#x7684;&#x559C;&#x60A6;&#xFF0C;&#x8FD9;&#x662F;&#x5947;&#x602A;&#x3002;&#x96BE;&#x9053;&#x771F;&#x662F;&#x592A;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x89C9;&#x5F97;&#x4E0D;&#x73CD;&#x8D35;&#xFF1F;</p>
<p>&#x7BA1;&#x4ED6;&#x7684;&#xFF0C;&#x76EE;&#x7684;&#x8FBE;&#x5230;&#x4E86;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x7B80;&#x5355;&#x4E86;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;sa&#x5E10;&#x53F7;&#x767B;&#x9646;&#x5BF9;&#x65B9;&#x7684;sql serve&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x672C;&#x5730;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x7B97;&#x4E86;&#xFF0C;&#x4E0A;&#x4F20;&#x7A0B;&#x5E8F;&#x592A;&#x9EBB;&#x70E6;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x5E72;&#x8106;&#x5C31;&#x5F00;&#x4E86;&#x5BF9;&#x65B9;&#x7684;telnet&#x3002;&#x7136;&#x540E;&#x7ED9;&#x81EA;&#x5DF1;&#x5EFA;&#x4E86;&#x4E2A;&#x9690;&#x853D;&#x7684;&#x5E10;&#x53F7;&#xFF0C;&#x52A0;&#x5165;administrators&#x7EC4;&#x3002;</p>
<p>&#x628A;telnet&#x7684;NTLM&#x8BA4;&#x8BC1;&#x65B9;&#x5F0F;&#x6539;&#x4E3A;0&#x3002;ok&#xFF0C;&#x4E00;&#x5207;&#x987A;&#x5229;&#x3002;</p>
<p>&#x8FDE;&#x63A5;&#x4E0A;&#x53BB;&#x4E4B;&#x540E;&#xFF0C;&#x6267;&#x884C;&#x672C;&#x5730;&#x547D;&#x4EE4;&#x5BB9;&#x6613;&#x591A;&#x4E86;&#x3002;&#x770B;&#x4E86;&#x770B;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x51CC;&#x4E71;&#x4E0D;&#x582A;&#x3002;&#x6CA1;&#x770B;&#x5230;&#x6709;&#x7528;&#x7684;&#x8D44;&#x6599;&#x3002;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x8FDB;&#x5165;&#x6211;&#x4EEC;&#x76EE;&#x6807;&#x7684;&#x5B50;&#x7F51;&#x3002;&#x6211;&#x4EEC;&#x653B;&#x51FB;&#x6210;&#x529F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8981;&#x597D;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x9000;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5F20;&#x5546;&#x91CF;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#x3002;&#x6F14;&#x4E60;&#x5C31;&#x8981;&#x7ED3;&#x675F;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x770B;&#x6765;&#x6E17;&#x5165;&#x5BF9;&#x65B9;&#x670D;&#x52A1;&#x5668;&#x662F;&#x7684;&#x6CA1;&#x95E8;&#x4E86;&#x201D;&#x8001;&#x5F20;&#x5728;&#x6211;&#x4EEC;&#x653B;&#x514B;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x7528;sniffer&#x76D1;&#x89C6;&#x4E86;&#x597D;&#x4E45;&#x3002;</p>
<p>&#x201C;&#x5475;&#x5475;&#xFF0C;&#x5BF9;&#x5440;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x9632;&#x7684;&#x592A;&#x6B7B;&#xFF0C;&#x4ED6;&#x4EEC;&#x57FA;&#x672C;&#x5C31;&#x6709;&#x6CA1;&#x6709;&#x548C;&#x5916;&#x754C;&#x4E3B;&#x52A8;&#x901A;&#x8BAF;&#x201D;&#x3002;</p>
<p>&#x201C;&#x641E;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x4F60;&#x51C6;&#x5907;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x8981;&#x4E48;&#x7528;arp&#xFF0C;&#x8981;&#x4E48;&#x76F4;&#x63A5;&#x653B;&#x51FB;&#x8DEF;&#x7531;&#x5668;&#x3002;&#x201D;&#x6211;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x5475;&#x5475;&#xFF0C;&#x591F;&#x72E0;&#x7684;&#x3002;&#x201D;&#x8001;&#x5F20;&#x770B;&#x6765;&#x4E5F;&#x60F3;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x5218;&#x961F;&#xFF0C;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x653B;&#x51FB;&#x4E86;&#x5417;&#xFF1F;&#x201D;&#x8001;&#x5F20;&#x5927;&#x558A;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x90FD;&#x56F4;&#x8FC7;&#x6765;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x6F14;&#x4E60;&#x4ECA;&#x5929;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#x3002;&#x4F60;&#x627E;&#x5230;&#x4E86;&#x65B9;&#x6CD5;&#x4E86;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x8001;&#x5F20;&#x628A;&#x6211;&#x4EEC;&#x60F3;&#x6CD5;&#x7ED9;&#x5927;&#x5BB6;&#x8BF4;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x6CA1;&#x610F;&#x89C1;&#x3002;</p>
<p>&#x5218;&#x961F;&#x4E5F;&#x773C;&#x775B;&#x653E;&#x5149;&#x3002;</p>
<p>&#x201C;&#x597D;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x5F00;&#x59CB;&#x201D;&#x5218;&#x961F;&#x548C;&#x5927;&#x5BB6;&#x90FD;&#x56F4;&#x7740;&#x6211;&#x3002;</p>
<p>&#x6211;&#x7ACB;&#x523B;&#x5728;&#x6211;&#x4EEC;&#x653B;&#x514B;&#x7684;&#x90A3;&#x592A;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x542F;&#x52A8;&#x4E86;arp&#x6B3A;&#x9A97;&#x653B;&#x51FB;&#x7A0B;&#x5E8F;&#x3002;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x8131;&#x7F51;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x5C40;&#x57DF;&#x7F51;&#x91CC;&#x9762;&#x975E;&#x5E38;&#x6709;&#x6548;&#x679C;&#x3002;&#x5BF9;&#x4E8E;&#x96C6;&#x7EBF;&#x5668;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6210;&#x529F;&#x7387;&#x51E0;&#x4E4E;&#x662F;100&#xFF05;&#x3002;&#x5BF9;&#x4E8E;&#x4EA4;&#x6362;&#x673A;&#x73AF;&#x5883;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x5982;&#x679C;&#x8BBE;&#x7F6E;&#x4E0D;&#x5F53;&#x7684;&#x8BDD;&#xFF0C;&#x7167;&#x6837;&#x6709;&#x6548;&#x679C;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x539F;&#x7406;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x5C40;&#x57DF;&#x7F51;&#x91CC;&#x9762;&#x4EFB;&#x4F55;&#x534F;&#x8BAE;&#x7684;&#x901A;&#x8BAF;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x7F51;&#x5361;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x3002;&#x53EA;&#x9700;&#x8981;&#x5728;&#x670D;&#x52A1;&#x5668;&#x786E;&#x8BA4;ip&#x548C;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x51FA;&#x4E00;&#x4E9B;&#x5E72;&#x6270;&#x548C;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x6216;&#x8005;&#x4EA4;&#x6362;&#x673A;&#x5224;&#x65AD;&#x5931;&#x8BEF;&#xFF0C;&#x6548;&#x679C;&#x5C31;&#x8FBE;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x5728;&#x8BBE;&#x8BA1;&#x5F53;&#x521D;&#x901A;&#x8BAF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x505A;&#x68A6;&#x90FD;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x62FF;&#x6765;&#x641E;&#x7834;&#x574F;&#xFF01;</p>
<p>&#x5176;&#x5B9E;&#x7F51;&#x7EDC;&#x6EE1;&#x8106;&#x5F31;&#x7684;&#x3002;&#x73B0;&#x5728;&#x7684;&#x4EBA;&#x5BF9;&#x7F51;&#x7EDC;&#x7814;&#x7A76;&#x7684;&#x8D8A;&#x6765;&#x8D8A;&#x6DF1;&#xFF0C;&#x5F88;&#x591A;&#x8BBE;&#x8BA1;&#x90FD;&#x6CA1;&#x8003;&#x8651;&#x5230;&#x7684;&#x95EE;&#x9898;&#x73B0;&#x5728;&#x90FD;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x771F;&#x7684;&#x4F1A;&#x51FA;&#x73B0;&#x5F88;&#x96BE;&#x89E3;&#x51B3;&#x7684;&#x5C34;&#x5C2C;&#x7684;&#x5C40;&#x9762;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x54E5;&#x4EEC;&#x4E0D;&#x505C;&#x7684;&#x6D4B;&#x8BD5;&#x7740;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x662F;time out&#x3002;&#x65E0;&#x6CD5;&#x8FDE;&#x63A5;&#x4E0A;&#x4E86;&#x3002;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x51FA;&#x73B0;&#x4E86;&#x5047;&#x8131;&#x7F51;&#x7684;&#x73B0;&#x8C61;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x8131;&#x7F51;&#x4ED6;&#x4EEC;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x662F;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x539F;&#x56E0;&#x7684;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x4ED6;&#x4EEC;&#x6B7B;&#x5B9A;&#x4E86;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x54EA;&#x91CC;&#x60F3;&#x7684;&#x5230;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x7684;&#x653B;&#x51FB;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x4ED6;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x5728;&#x4E00;&#x4E2A;&#x5B50;&#x7F51;&#xFF1F;</p>
<p>&#x6CA1;&#x4EC0;&#x4E48;&#x620F;&#x5267;&#x6027;&#x53D8;&#x6362;&#xFF0C;&#x6362;&#x4E86;&#x6211;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x3002;&#x4ED6;&#x4EEC;&#x552F;&#x4E00;&#x7684;&#x5931;&#x8BEF;&#x5C31;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x4E86;&#x4ED6;&#x4EEC;&#x51E0;&#x4E2A;ip&#x3002;&#x6211;&#x60F3;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x4ED6;&#x4EEC;&#x80AF;&#x5B9A;&#x4E5F;&#x662F;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x5B50;&#x7F51;&#x8FDB;&#x884C;&#x8FC7;&#x626B;&#x63CF;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x7528;&#x7684;&#x662F;&#x7684;&#x6C11;&#x7528;&#x7F51;&#x7EDC;&#x3002;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x8FD0;&#x6C14;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x5B50;&#x7F51;&#x7684;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x6CA1;&#x6709;&#x5F00;&#x673A;&#x8FD8;&#x662F;&#x9632;&#x62A4;&#x7684;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x53CD;&#x6B63;&#x5BF9;&#x65B9;&#x6CA1;&#x6709;&#x6E17;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x5B50;&#x7F51;&#x3002;&#x4ED6;&#x4EEC;&#x6E17;&#x5165;&#x7684;&#x8BDD;&#x4E5F;&#x53EF;&#x4EE5;&#x641E;arp&#x653B;&#x51FB;&#x3002;&#x4F46;&#x662F;&#x76F4;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4ECD;&#x7136;&#x901A;&#x8BAF;&#x6B63;&#x5E38;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x6E17;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x5B50;&#x7F51;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x9762;&#x5BF9;arp&#x653B;&#x51FB;&#xFF0C;&#x4E00;&#x6837;&#x5F88;&#x96BE;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x6709;&#x597D;&#x7684;&#x5BF9;&#x7B56;&#x3002;</p>
<p>&#x6700;&#x540E;&#x7684;&#x80DC;&#x5229;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#xFF0C;&#x84DD;&#x519B;&#x3002;</p>
<p>&#x672C;&#x6765;&#x60F3;&#x5BF9;&#x90A3;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x60F3;&#x56DE;&#x7275;&#x8FDE;&#x5230;&#x5F88;&#x591A;&#x65E0;&#x8F9C;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x6700;&#x540E;&#x653E;&#x5F03;&#x4E86;&#x3002;</p>
<p>&#x5E73;&#x751F;&#x6700;&#x8BA8;&#x538C;&#x7684;&#x4E8B;&#x60C5;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x6B63;&#x5728;&#x4E0A;&#x7F51;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7F51;&#x7EDC;&#x7A81;&#x7136;&#x65AD;&#x6389;&#x3002;&#x6211;&#x60F3;&#x522B;&#x4EBA;&#x4E5F;&#x4E0D;&#x4F1A;&#x559C;&#x6B22;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
<p>&#x5218;&#x961F;&#x4ECE;&#x901A;&#x8BAF;&#x5BA4;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8138;&#x4E0A;&#x6D0B;&#x6EA2;&#x7740;&#x7B11;&#x3002;&#x5BF9;&#x6211;&#x8001;&#x5F20;&#x7684;&#x773C;&#x795E;&#x5145;&#x6EE1;&#x4E86;&#x8D5E;&#x8D4F;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x5F00;&#x62D4;&#x56DE;&#x519B;&#x533A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6C14;&#x6C1B;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x90A3;&#x8F86;&#x8FF7;&#x5F69;EVICO&#xFF0C;&#x4F46;&#x662F;&#x7A97;&#x6237;&#x5927;&#x5F00;&#x3002;&#x8B66;&#x901A;&#x8FDE;&#x7684;&#x58EB;&#x5175;&#x4EEC;&#x4E5F;&#x6CA1;&#x6709;&#x4E25;&#x6B63;&#x4EE5;&#x5F85;&#x3002;&#x8FD8;&#x7ED9;&#x6211;&#x4EEC;&#x5F00;&#x5F00;&#x73A9;&#x7B11;&#x3002;&#x6211;&#x4EEC;&#x51E0;&#x4E2A;&#x201C;&#x6C11;&#x5175;&#x201D;&#x4ECE;&#x5F00;&#x59CB;&#x7684;&#x62D8;&#x675F;&#x5230;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x5F88;&#x719F;&#x4E86;&#x3002;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x8BDD;&#x8BF4;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x201C;&#x9769;&#x547D;&#x7684;&#x53CB;&#x8C0A;&#x201D;&#x3002;&#x5C24;&#x5176;&#x662F;&#x6211;&#x548C;&#x8001;&#x5F20;&#x3002;&#x7B80;&#x76F4;&#x6210;&#x4E86;&#x94C1;&#x54E5;&#x4EEC;&#x3002;</p>
<p>&#x5F00;&#x59CB;&#x8FD8;&#x89C9;&#x5F97;&#x8001;&#x5F20;&#x7792;&#x5185;&#x5411;&#x7684;&#x3002;&#x4F46;&#x662F;&#x9047;&#x5230;&#x540C;&#x884C;&#xFF0C;&#x8001;&#x5F20;&#x7EDD;&#x5BF9;&#x53EF;&#x4EE5;&#x7528;&#x5916;&#x5411;&#x6765;&#x5F62;&#x5BB9;&#x3002;</p>
<p>&#x8001;&#x5F20;&#x7B11;&#x8D77;&#x6765;&#x58F0;&#x97F3;&#x5F88;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x987E;&#x5FCC;&#x3002;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x89C9;&#x5F97;&#xFF0C;&#x8001;&#x5F20;&#x5F88;&#x6709;&#x201C;&#x7AE5;&#x5FC3;&#x201D;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x60F3;&#x8D77;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x4F46;&#x662F;&#x8001;&#x5F20;&#x7ED9;&#x6211;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x5FC3;&#x65E0;&#x57CE;&#x5E9C;&#xFF0C;&#x6280;&#x672F;&#x662F;&#x4ED6;&#x751F;&#x547D;&#x4E2D;&#x7684;&#x5168;&#x90E8;&#x3002;</p>
<p>&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x73B0;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x4E0D;&#x591A;&#x4E86;&#x3002;&#x5230;&#x5904;&#x770B;&#x5230;&#x90FD;&#x662F;&#x6E9C;&#x987B;&#x62CD;&#x9A6C;&#xFF0C;&#x4E0D;&#x5B66;&#x65E0;&#x672F;&#x7684;&#x5634;&#x8138;&#x3002;&#x50CF;&#x8001;&#x5F20;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E0D;&#x5F97;&#x793E;&#x4F1A;&#x559C;&#x6B22;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x771F;&#x7684;&#x656C;&#x4F69;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x505A;&#x4E0D;&#x5230;&#x4ED6;&#x8FD9;&#x6837;&#x3002;</p>
<p>&#x6211;&#x771F;&#x7684;&#x656C;&#x4F69;&#x8001;&#x5F20;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x662F;&#x771F;&#x5FC3;&#x8BDD;&#x3002;</p>
<p>&#x519B;&#x533A;&#x9662;&#x5B50;&#x91CC;&#x9762;&#x5230;&#x5904;&#x90FD;&#x662F;&#x62AB;&#x6302;&#x6574;&#x9F50;&#x7684;&#x58EB;&#x5175;&#x548C;&#x519B;&#x8F66;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x660E;&#x663E;&#x611F;&#x5230;&#x7A7A;&#x6C14;&#x4E2D;&#x6D0B;&#x6EA2;&#x7684;&#x559C;&#x60A6;&#x7684;&#x6C14;&#x6C1B;&#x3002;</p>
<p>&#x548C;&#x521A;&#x521A;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x79CD;&#x7D27;&#x5F20;&#x7684;&#x6C14;&#x6C1B;&#x5B8C;&#x5168;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5C3D;&#x7BA1;&#x8F66;&#x8FD8;&#x662F;&#x90A3;&#x4E9B;&#x8F66;&#xFF0C;&#x4EBA;&#x8FD8;&#x662F;&#x90A3;&#x4E9B;&#x4EBA;&#xFF0C;&#x5730;&#x65B9;&#x8FD8;&#x662F;&#x90A3;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x4F46;&#x662F;&#x548C;&#x6211;&#x4EEC;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x604D;&#x82E5;&#x9694;&#x4E16;&#x3002;</p>
<p>&#x6F14;&#x4E60;&#x53D6;&#x5F97;&#x5927;&#x7684;&#x80DC;&#x5229;&#xFF0C;&#x80FD;&#x4E0D;&#x9AD8;&#x5174;&#x5417;&#xFF1F;</p>
<p>&#x6709;&#x8C01;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x91CC;&#x9762;&#x6709;&#x6211;&#x4EEC;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x5206;&#x961F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x529F;&#x52B3;&#xFF1F;</p>
<p>&#x6211;&#x5FC3;&#x91CC;&#x6697;&#x6697;&#x7684;&#x60F3;&#xFF0C;&#x770B;&#x7740;&#x58EB;&#x5175;&#x7EAF;&#x771F;&#x7684;&#x7B11;&#x8138;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x6D8C;&#x8D77;&#x4E00;&#x79CD;&#x81EA;&#x8C6A;&#x3002;</p>
<p>&#x5E86;&#x529F;&#x5BB4;&#x662F;&#x5C11;&#x4E0D;&#x4E86;&#x7684;&#x3002;</p>
<p>&#x519B;&#x533A;&#x98DF;&#x5802;&#x7684;&#x83DC;&#x5728;&#x5927;&#x9505;&#x83DC;&#x91CC;&#x9762;&#x7EDD;&#x5BF9;&#x7B97;&#x6781;&#x54C1;&#x4E86;&#x3002;&#x53CD;&#x6B63;&#x6211;&#x89C9;&#x5F97;&#x6BD4;&#x4E0A;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x98DF;&#x5802;&#x7684;&#x4E1C;&#x897F;&#x8981;&#x597D;&#x5403;&#x767E;&#x500D;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x5FC3;&#x60C5;&#x592A;&#x597D;&#xFF1F;</p>
<p>&#x90A3;&#x4E9B;&#x573A;&#x9762;&#x4E0A;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x65E0;&#x804A;&#x3002;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#xFF0C;&#x6211;&#x8138;&#x4E0A;&#x90FD;&#x5806;&#x7740;&#x50BB;&#x7B11;&#xFF0C;&#x5F15;&#x6765;&#x4E00;&#x6279;&#x4E00;&#x6279;&#x656C;&#x9152;&#x7684;&#x4EBA;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4E00;&#x5F8B;&#x53EF;&#x4E50;&#x4F3A;&#x5019;&#x3002;</p>
<p>&#x5218;&#x961F;&#x770B;&#x6765;&#x9152;&#x91CF;&#x4E5F;&#x4E0D;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#xFF0C;&#x4ED6;&#x7684;&#x76EE;&#x6807;&#x592A;&#x5927;&#xFF0C;&#x6211;&#x4EEC;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5218;&#x961F;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x9ED8;&#x9ED8;&#x65E0;&#x8BED;&#x9636;&#x6BB5;&#x4E86;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x623F;&#x95F4;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5F20;&#x90FD;&#x6CA1;&#x6709;&#x8BF4;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x5F00;&#x90A3;&#x53F0;&#x8DDF;&#x968F;&#x6211;&#x4EEC;20&#x591A;&#x5929;&#x7684;&#x519B;&#x7528;&#x7B14;&#x8BB0;&#x672C;&#x6162;&#x6162;&#x7684;&#x7528;&#x7740;&#xFF0C;&#x8F7B;&#x67D4;&#x7684;&#x5C31;&#x50CF;&#x629A;&#x6478;&#x5B83;&#x7684;&#x8138;&#x3002;</p>
<p>&#x6211;&#x627E;&#x5230;&#x4E00;&#x9996;&#x6B4C;&#x66F2;&#xFF0C;&#x662F;&#x9996;&#x82F1;&#x6587;&#x6B4C;&#x66F2;&#xFF0C;&#x542C;&#x7684;&#x6211;&#x60F3;&#x6389;&#x6CEA;&#x3002;</p>
<p>&#x540D;&#x5B57;&#x53EB;sailing&#x3002;</p>
<p>i am sailing,i am sailing home again cross the sea,i am sailing stormy water,to be with you,to be free.</p>
<p>i am flying,i am flying like a bird across the sky,to be with you,to be free....................</p>
<p>....................</p>
<p>&#x6211;&#x542C;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x542C;&#x5230;&#x4E86;&#x4E00;&#x79CD;&#x60B2;&#x58EE;&#x7684;&#x52C7;&#x6C14;&#xFF0C;&#x4E00;&#x79CD;&#x4E0D;&#x5C48;&#x7684;&#x7CBE;&#x795E;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x9ED1;&#x5BA2;&#x7684;&#x7CBE;&#x795E;&#x3002;</p>
<p>&#x90A3;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7761;&#x7740;&#x7684;&#x3002;&#x68A6;&#x4E2D;&#x6211;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x5728;&#x6D77;&#x4E0A;&#x822A;&#x884C;&#x3002;&#x3002;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter13.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第十三章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十四章","level":"1.15","depth":1,"previous":{"title":"第十三章","level":"1.14","depth":1,"path":"chapter13.md","ref":"chapter13.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter14.md","mtime":"2017-02-27T04:06:02.984Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

