
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter11.html" />
    
    
    <link rel="prev" href="chapter9.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6F14;&#x620F;3">&#x6F14;&#x620F;[3]</h2>
<p>&#x65F6;&#x95F4;&#x5728;&#x6C89;&#x9ED8;&#x4E2D;&#x4E0D;&#x65AD;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x6211;&#x4EEC;&#x5C0F;&#x7EC4;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x5728;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x7684;&#x5411;&#x524D;&#x53D1;&#x5C55;&#x3002;&#x8001;&#x5F20;&#x5229;&#x7528;linux 2.4&#x5185;&#x6838;&#x7684;&#x4E00;&#x4E2A;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#xFF0C;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x8BA9;&#x5BF9;&#x65B9;&#x505C;&#x6B62;&#x670D;&#x52A1;&#x3002;&#x4ED6;&#x8BD5;&#x56FE;&#x8FDB;&#x4E00;&#x6B65;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#xFF0C;&#x8BD5;&#x56FE;&#x8BA9;&#x5BF9;&#x65B9;&#x6267;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x662F;&#x975E;&#x5E38;&#x8270;&#x82E6;&#x7684;&#x3002;&#x4ECE;&#x8001;&#x5F20;&#x9ED1;&#x7740;&#x7684;&#x8138;&#xFF0C;&#x548C;&#x56E0;&#x4E3A;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#x800C;&#x663E;&#x5F97;&#x5446;&#x6EDE;&#x7684;&#x76EE;&#x5149;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x8FDB;&#x5C55;&#x4E0D;&#x5927;&#x3002;</p>
<p>&#x6211;&#x53D1;&#x73B0;&#x4E86;apache&#x7684;2.044&#x7248;&#x672C;&#x7684;&#x4E00;&#x4E2A;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#x3002;&#x7531;&#x4E8E;&#x6709;&#x5B9E;&#x9645;&#x7684;&#x8BD5;&#x9A8C;&#x73AF;&#x5883;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x5199;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x662F;&#x5229;&#x7528;&#x6EA2;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x53EA;&#x80FD;&#x5199;&#x5F88;&#x5C11;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x662F;&#x50CF;&#x5E73;&#x65F6;&#x4E00;&#x6837;&#x60F3;&#x5982;&#x4F55;&#x5199;&#x5C31;&#x5982;&#x4F55;&#x5199;&#x7684;&#x3002;</p>
<p>&#x5C0F;&#x4F59;&#x548C;&#x5C0F;&#x8D75;&#x52A0;&#x7D27;&#x4E86;&#x5BF9;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x7684;&#x76D1;&#x63A7;&#x3002;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x90A3;&#x5E2E;&#x5144;&#x5F1F;&#x4E5F;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x5206;&#x6790;&#x90A3;&#x5957;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#xFF0C;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x66F4;&#x591A;&#x7684;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5BF9;&#x65B9;&#x9650;&#x5B9A;&#x4E86;ip&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5373;&#x4F7F;&#x77E5;&#x9053;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x5F31;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8FDE;&#x63A5;&#x7684;&#x3002;</p>
<p>&#x6211;&#x73B0;&#x5728;&#x6B63;&#x5728;&#x60F3;&#x5982;&#x4F55;&#x5229;&#x7528;&#x6F0F;&#x6D1E;&#x653B;&#x51FB;&#x5BF9;&#x65B9;&#x3002;</p>
<p>&#x8BF4;&#x8001;&#x5B9E;&#x8BDD;&#xFF0C;&#x5982;&#x679C;&#x5229;&#x7528;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x7684;&#x638C;&#x63E1;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x8981;&#x8BA9;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x505C;&#x6B62;&#x670D;&#x52A1;&#xFF0C;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x9ED1;&#x5BA2;&#x7684;&#x6700;&#x9AD8;&#x5883;&#x754C;&#x662F;&#x6E17;&#x5165;&#x5BF9;&#x65B9;&#x800C;&#x4E0D;&#x88AB;&#x53D1;&#x73B0;&#x3002;&#x6211;&#x4EEC;&#x5927;&#x5BB6;&#x90FD;&#x6E05;&#x695A;&#xFF0C;&#x5982;&#x679C;&#x8BA9;&#x5BF9;&#x65B9;&#x505C;&#x6B62;&#x670D;&#x52A1;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x6570;&#x636E;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x800C;&#x4E14;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x544A;&#x8BC9;&#x5BF9;&#x65B9;&#x6709;&#x4EBA;&#x5728;&#x653B;&#x51FB;&#x3002;&#x4E00;&#x65E6;&#x5BF9;&#x65B9;&#x5168;&#x529B;&#x76D1;&#x63A7;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5F88;&#x96BE;&#x5728;&#x5BF9;&#x65B9;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x7684;&#x6743;&#x9650;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x6E17;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x80FD;&#x901A;&#x8FC7;80&#x7AEF;&#x53E3;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x5BF9;&#x65B9;&#x5F88;&#x96BE;&#x53D1;&#x73B0;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x4E00;&#x5B9A;&#x4E5F;&#x5728;&#x76D1;&#x63A7;&#x4E2D;&#x3002;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#x3002;&#x60F3;&#x8BA9;&#x5BF9;&#x53CD;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x4F60;&#x7684;&#x8FDE;&#x63A5;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x5BF9;&#x65B9;&#x4E5F;&#x5728;&#x76D1;&#x63A7;&#x4E4B;&#x4E2D;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x53CC;&#x65B9;&#x90FD;&#x77E5;&#x9053;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x6210;&#x529F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5F88;&#x5C0F;&#xFF0C;&#x5373;&#x4F7F;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4F1A;&#x5F88;&#x5FEB;&#x53D1;&#x73B0;&#x3002;</p>
<p>&#x600E;&#x4E48;&#x529E;&#xFF1F;</p>
<p>&#x6211;&#x7684;&#x5934;&#x90FD;&#x53D8;&#x5927;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x8270;&#x82E6;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x7684;&#x6807;&#x5FD7;&#x5C31;&#x662F;&#x6C89;&#x9ED8;&#x3002;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x70DF;&#x96FE;&#x7F2D;&#x7ED5;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x7684;&#x4EBA;&#x90FD;&#x4E0D;&#x62BD;&#x70DF;&#x3002;&#x73B0;&#x5728;&#x62BD;&#x70DF;&#x597D;&#x50CF;&#x5DF2;&#x7ECF;&#x4E0D;&#x6D41;&#x884C;&#x4E86;&#xFF1F;</p>
<pre><code> &#x3000;&#x53EA;&#x6709;&#x952E;&#x76D8;&#x6572;&#x51FB;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x6C89;&#x9ED8;&#xFF0C;&#x8FD8;&#x662F;&#x6C89;&#x9ED8;&#x3002;
</code></pre><p>&#x672C;&#x6765;&#x6211;&#x60F3;&#x5229;&#x7528;apache&#x7684;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#xFF0C;&#x628A;&#x5BF9;&#x65B9;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;ip&#x9650;&#x5B9A;&#x90E8;&#x5206;&#x7684;&#x4EE3;&#x7801;&#x7ED9;&#x6539;&#x8FC7;&#x6765;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x7684;log&#x548C;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x80AF;&#x5B9A;&#x4F1A;&#x9A6C;&#x4E0A;&#x53D1;&#x73B0;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5BF9;&#x65B9;&#x7ACB;&#x523B;&#x5C31;&#x4F1A;&#x6709;&#x53CD;&#x5E94;&#x3002;&#x6211;&#x8BF4;&#x8FC7;&#x4E86;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x591A;&#x4E48;&#x7684;&#x5389;&#x5BB3;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x5426;&#x638C;&#x63E1;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x8FD8;&#x662F;&#x6597;&#x4E0D;&#x8FC7;&#x5373;&#x4F7F;&#x4E0D;&#x5982;&#x4F60;&#x7684;&#x7F51;&#x7BA1;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x5F3A;&#x9F99;&#x4E5F;&#x96BE;&#x6597;&#x5730;&#x5934;&#x86C7;&#x3002;</p>
<p>&#x6211;&#x8BD5;&#x9A8C;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6216;&#x8005;&#x5411;&#x5BF9;&#x65B9;&#x7684;&#x6587;&#x4EF6;&#x8BFB;&#x6216;&#x8005;&#x5199;&#x5B57;&#x8282;&#x6570;&#x5C0F;&#x4E8E;1024&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x5FC3;&#x4E2D;&#x4E00;&#x9635;&#x72C2;&#x559C;&#x3002;</p>
<p>&#x6211;&#x72B9;&#x8C6B;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x5192;&#x4E00;&#x4E2A;&#x9669;&#x3002;&#x8FD9;&#x4E2A;&#x9669;&#x5192;&#x7684;&#x662F;&#x5426;&#x503C;&#x5F97;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x4E5F;&#x6CA1;&#x6709;&#x628A;&#x63E1;&#x3002;&#x4E0D;&#x7BA1;&#x4ED6;&#x3002;</p>
<p>&#x6211;&#x98DE;&#x5FEB;&#x7684;&#x6572;&#x51FB;&#x952E;&#x76D8;&#xFF0C;&#x6784;&#x5EFA;&#x6211;&#x5E0C;&#x671B;&#x7684;&#x6EA2;&#x51FA;&#x6570;&#x636E;&#x3002;&#x7136;&#x540E;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8BD5;&#x9A8C;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x6210;&#x529F;&#x4E86;&#x3002;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x8981;&#x7A0B;&#x5E8F;&#x6211;&#x5DF2;&#x7ECF;&#x8BD5;&#x9A8C;&#x8FC7;&#x591A;&#x6B21;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x628A;&#x6211;&#x7684;&#x7279;&#x6B8A;&#x6570;&#x636E;copy&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#xFF0C;&#x540C;&#x65F6;&#x5F00;&#x901A;&#x4E3B;&#x7A0B;&#x5E8F;&#xFF0C;&#x901A;&#x8FC7;&#x548C;&#x5BF9;&#x65B9;&#x7684;80&#x7AEF;&#x53E3;&#x8FDE;&#x63A5;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x51FA;&#x6211;&#x7684;&#x6EA2;&#x51FA;&#x6570;&#x636E;&#xFF0C;&#x8BA9;&#x5BF9;&#x65B9;&#x7684;apache&#x4EA7;&#x751F;&#x6EA2;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x518D;&#x628A;&#x6211;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x901A;&#x8FC7;&#x6D4F;&#x89C8;&#x5668;&#x8BF7;&#x6C42;&#xFF0C;&#x4E0D;&#x51FA;&#x6211;&#x6240;&#x6599;&#xFF0C;&#x6211;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x5BF9;&#x65B9;log&#x6587;&#x4EF6;&#x7684;&#x524D;&#x9762;1024&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
<p>&#x6211;&#x8BFB;&#x53D6;&#x7684;&#x662F;apache&#x7684;access.log&#x6587;&#x4EF6;&#xFF0C;&#x91CC;&#x9762;&#x8BE6;&#x7EC6;&#x7684;&#x8BB0;&#x8F7D;&#x4E86;&#x5BF9;&#x65B9;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x8FDE;&#x63A5;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x770B;&#x5230;&#x51E0;&#x4E2A;&#x6211;&#x65B9;ip&#xFF0C;&#x4E0D;&#x8FC7;&#x540E;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x662F;400&#x540E;&#x9762;&#x7684;&#xFF0C;&#x663E;&#x7136;&#x88AB;&#x62D2;&#x7EDD;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x6211;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#x597D;&#x51E0;&#x4E2A;304&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x662F;&#x6210;&#x529F;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x663E;&#x7136;&#x8FD9;&#x662F;&#x5BF9;&#x65B9;&#x7684;ip&#xFF0C;&#x5475;&#x5475;&#x6211;&#x8981;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#xFF0C;&#x4E00;&#x5171;&#x6709;10&#x51E0;&#x4E2A;ip&#xFF0C;&#x6211;&#x628A;&#x4ED6;&#x4EEC;copy&#x5230;&#x8BB0;&#x4E8B;&#x672C;&#x4E2D;&#x5B58;&#x50A8;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x6211;&#x8FD9;&#x6837;&#x5982;&#x6B64;&#x52A8;&#x4F5C;&#x5FEB;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x8FD8;&#x662F;&#x88AB;&#x5BF9;&#x65B9;&#x53D1;&#x73B0;&#x4E86;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#xFF0C;&#x5176;&#x4ED6;&#x6C89;&#x9ED8;&#x5F88;&#x4E45;&#x7684;&#x5144;&#x5F1F;&#x4EEC;&#x7A81;&#x7136;&#x8BF4;&#x8BDD;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x5947;&#x602A;&#xFF0C;&#x5947;&#x602A;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x521A;&#x548C;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x7ACB;&#x523B;&#x88AB;&#x65AD;&#x6389;&#x3002;&#x3002;&#x3002;&#x201D;&#x8001;&#x5F20;&#x4F3C;&#x4E4E;&#x81EA;&#x8A00;&#x81EA;&#x8BED;&#x7684;&#x8BF4;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x592A;&#x5B89;&#x9759;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x542C;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x662F;&#x5440;&#xFF0C;&#x521A;&#x624D;&#x867D;&#x7136;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5BF9;&#x65B9;&#x7684;web&#xFF0C;&#x4F46;&#x662F;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x5C45;&#x7136;&#x5F88;&#x5FEB;&#x88AB;&#x65AD;&#x6389;&#x201D;&#x5C0F;&#x4F59;&#x4E5F;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x96BE;&#x9053;&#xFF0C;&#x5BF9;&#x65B9;&#x73B0;&#x5728;ip&#x9A8C;&#x8BC1;&#x4E0D;&#x662F;&#x5C45;&#x4E8E;asp&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x5C45;&#x4E8E;&#x8FDE;&#x63A5;&#x4E86;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x66F4;&#x56F0;&#x96BE;&#x4E86;&#x201D;&#x5C0F;&#x8D75;&#x4E5F;&#x8BF4;&#x3002;</p>
<p>&#x6211;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x679C;&#x7136;&#xFF0C;&#x73B0;&#x5728;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x5F88;&#x5FEB;&#x5C31;&#x88AB;&#x65AD;&#x6389;&#x4E86;&#x3002;</p>
<p>&#x770B;&#x6765;&#xFF0C;&#x6211;&#x521A;&#x624D;&#x7684;&#x5C0F;&#x52A8;&#x4F5C;&#xFF0C;&#x4E00;&#x5B9A;&#x88AB;&#x5BF9;&#x65B9;&#x53D1;&#x73B0;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x4E0D;&#x96BE;&#x7406;&#x89E3;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x76D1;&#x63A7;&#x7684;&#x4EBA;&#x4E5F;&#x4E0D;&#x662F;&#x5403;&#x5E72;&#x996D;&#x4E86;&#x3002;&#x4ED6;&#x4EEC;&#x4E00;&#x5B9A;&#x4ECE;log&#x4E2D;&#x770B;&#x5230;&#x6211;&#x6211;&#x6210;&#x529F;&#x8FDE;&#x63A5;&#x4E86;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x867D;&#x7136;&#x5F88;&#x77ED;&#xFF0C;&#x5E73;&#x65F6;&#x4E00;&#x822C;&#x662F;&#x4E0D;&#x4F1A;&#x53D1;&#x73B0;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x975E;&#x5E38;&#x4E8B;&#x60C5;&#xFF0C;&#x5BF9;&#x65B9;&#x6743;&#x5229;&#x76D1;&#x63A7;&#xFF0C;&#x7109;&#x4F1A;&#x6F0F;&#x8FC7;&#xFF1F;</p>
<p>&#x73B0;&#x5728;&#x5BF9;&#x65B9;&#x5DF2;&#x7ECF;&#x91CD;&#x65B0;&#x6539;&#x6210;&#x4E86;&#x57FA;&#x4E8E;ip&#x8FDE;&#x63A5;&#x7684;&#x9A8C;&#x8BC1;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x76F4;&#x63A5;&#x653B;&#x51FB;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x66F4;&#x5C0F;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x4E00;&#x7247;&#x6CAE;&#x4E27;&#x3002;</p>
<p>&#x201C;&#x5E72;&#x8106;&#x6211;&#x4EEC;&#x5C31;&#x641E;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x4ED6;&#x4EEC;&#x542F;&#x52A8;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x6765;&#xFF0C;&#x54B1;&#x4EEC;&#x5C31;&#x548C;&#x4ED6;&#x4EEC;&#x86EE;&#x5E72;&#xFF01;&quot;&#x5C0F;&#x4F59;&#x62B1;&#x7740;&#x540E;&#x8111;&#xFF0C;&#x4EF0;&#x5728;&#x6905;&#x5B50;&#x4E0A;&#x9762;&#x3002;</p>
<p>&#x8001;&#x5F20;&#x548C;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x54E5;&#x4EEC;&#x90FD;&#x505C;&#x4E0B;&#x6765;&#x4F11;&#x606F;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x4F60;&#x4E00;&#x53E5;&#x6211;&#x4E00;&#x53E5;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x6253;&#x7B97;&#x5B64;&#x6CE8;&#x4E00;&#x63B7;&#x4E86;&#x3002;</p>
<p>&#x201C;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x770B;&#x6765;&#x662F;&#x5543;&#x4E0D;&#x52A8;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4ED6;&#x4EEC;&#x7684;&#x5BA2;&#x6237;&#x673A;&#x5668;&#x5165;&#x624B;&#x5427;&#xFF0C;&#x6765;&#x6765;&#xFF0C;&#x6765;&#x9886;&#x5730;&#x5740;&#x6765;&#x3002;&#x201D;&#x6211;&#x7B11;&#x7740;&#x8BF4;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x4E00;&#x60CA;&#xFF0C;&#x534A;&#x5929;&#x6CA1;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5F53;&#x65F6;&#x7684;&#x653B;&#x51FB;&#x6761;&#x4EF6;&#x90FD;&#x662F;&#x53EA;&#x662F;&#x77E5;&#x9053;&#x5BF9;&#x65B9;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;ip&#x5730;&#x5740;&#x3002;&#x5176;&#x5B9E;&#x771F;&#x6B63;&#x7684;&#x6253;&#x4ED7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5373;&#x4F7F;ip&#x5730;&#x5740;&#x4E5F;&#x662F;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x77E5;&#x9053;&#x7684;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x5C45;&#x7136;&#x8BF4;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x5185;&#x884C;&#xFF0C;&#x80FD;&#x4E0D;&#x60CA;&#x5F02;&#x5417;&#xFF1F;</p>
<p>&#x6211;&#x7B11;&#x7740;&#x770B;&#x7740;&#x5927;&#x5BB6;&#xFF0C;&#x8FC7;&#x4E86;&#x597D;&#x4E00;&#x9635;&#xFF0C;&#x5927;&#x5BB6;&#x624D;&#x56F4;&#x8FC7;&#x6765;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x770B;&#x5230;ip&#x5730;&#x5740;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x76F8;&#x4FE1;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E00;&#x770B;&#x5C31;&#x77E5;&#x9053;&#x6211;&#x8BFB;&#x5230;&#x4E86;&#x5BF9;&#x65B9;&#x7684;log&#x6587;&#x4EF6;&#x3002;&#x56E0;&#x4E3A;&#x90A3;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x7CBE;&#x901A;&#x7F51;&#x7EDC;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x518D;&#x719F;&#x6089;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x5171;&#x4EAB;&#x51FA;&#x90A3;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x5927;&#x5BB6;&#x563B;&#x563B;&#x54C8;&#x54C8;&#x7684;&#x56DE;&#x5230;&#x5EA7;&#x4F4D;&#x4E0A;&#xFF0C;&#x4E00;&#x8FB9;down&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x8FB9;&#x8BF4;&#xFF1A;&#x201D;&#x539F;&#x6765;&#x662F;&#x4F60;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x628A;&#x4EBA;&#x5BB6;log&#x6587;&#x4EF6;&#x641E;&#x5230;&#x4E86;&#x201C;</p>
<p>&#x201C;&#x4F60;&#x5E72;&#x8106;&#x4ED6;&#x4ED6;&#x4EEC;&#x7684;&#x5BC6;&#x7801;&#x6587;&#x4EF6;&#x641E;&#x4E0B;&#x6765;&#x5F97;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x8DD1;&#x4E0B;&#xFF0C;&#x8FD0;&#x6C14;&#x597D;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x6765;&#x3002;&#x201D;&#x4E00;&#x4E2A;&#x54E5;&#x4EEC;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x5475;&#x5475;&#xFF0C;&#x4EBA;&#x5BB6;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x90FD;&#x6CA1;&#x6709;&#x5F00;&#xFF0C;&#x4F60;&#x6653;&#x5F97;root&#x5BC6;&#x7801;&#x4E5F;&#x6CA1;&#x7528;&#x5440;&#x3002;&#x201D;&#x8001;&#x5F20;&#x8BF4;&#x3002;</p>
<p>&#x201C;&#x5C31;&#x662F;&#xFF0C;&#x8FD8;&#x662F;&#x8FD9;&#x4E9B;ip&#x6765;&#x7684;&#x5B9E;&#x5728;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0B;&#x5C5E;&#x5355;&#x4F4D;&#x7684;&#x6C34;&#x5E73;&#x6BD4;&#x4ED6;&#x4EEC;&#x5BF9;&#x6297;&#x5206;&#x961F;&#x7684;&#x8981;&#x5DEE;&#x7684;&#x591A;&#x3002;&#x8BF4;&#x4E0D;&#x5B9A;&#x6211;&#x4EEC;&#x641E;&#x6389;&#x4E00;&#x4E2A;&#xFF0C;&#x5229;&#x7528;&#x4ED6;&#x505A;&#x8DF3;&#x677F;&#xFF0C;&#x8FDB;&#x5165;&#x5BF9;&#x65B9;&#x7684;server&#xFF0C;&#x5BF9;&#x65B9;&#x4E0D;&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#x3002;&#x201D;&#x5C0F;&#x8D75;&#x975E;&#x5E38;&#x5174;&#x594B;&#x3002;</p>
<p>&#x201C;&#x522B;&#x9AD8;&#x5174;&#x7684;&#x592A;&#x65E9;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x641E;&#x5B9A;&#x8FD8;&#x96BE;&#x8BF4;&#x3002;&#x5927;&#x5BB6;&#x5343;&#x4E07;&#x5C0F;&#x5FC3;&#xFF0C;&#x6CA1;&#x6709;&#x628A;&#x63E1;&#x4E0D;&#x8981;&#x653B;&#x51FB;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x88AB;&#x5BF9;&#x65B9;&#x53D1;&#x73B0;&#x3002;&#x73B0;&#x5728;&#x8FD8;&#x60F3;&#x641E;&#x5BF9;&#x65B9;&#x7684;ip&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x4E86;&#x3002;&#x201D;&#x6211;&#x8BF4;&#x3002;</p>
<p>&#x201C;Ok&#xFF01;&#x201D;&#x5927;&#x5BB6;&#x4E00;&#x9635;&#x6B22;&#x547C;&#xFF0C;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x770B;&#x5230;&#x4E86;&#x5E0C;&#x671B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;&#x5341;&#x51E0;&#x4E2A;ip&#x5206;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x8D1F;&#x8D23;&#x51E0;&#x4E2A;ip&#x3002;&#x907F;&#x514D;&#x51E0;&#x4E2A;&#x4EBA;&#x540C;&#x65F6;&#x653B;&#x51FB;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x6211;&#x8D1F;&#x8D23;4&#x4E2A;ip&#x3002;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x6BB5;&#xFF0C;&#x770B;&#x6765;&#x8FD9;&#x51E0;&#x4E2A;ip&#x90FD;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4F46;&#x662F;&#x6839;&#x636E;&#x6211;&#x7ECF;&#x9A8C;&#xFF0C;&#x8FD9;&#x51E0;&#x4E2A;ip&#x90FD;&#x6765;&#x81EA;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x5730;&#x533A;&#xFF0C;&#x770B;&#x6765;&#x662F;&#x5BF9;&#x65B9;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x90E8;&#x7684;ip&#x6CA1;&#x9519;&#x3002;</p>
<p>&#x6211;&#x6CA1;&#x6709;&#x8D38;&#x7136;&#x626B;&#x63CF;&#x5BF9;&#x65B9;&#x673A;&#x5668;&#xFF0C;&#x5BF9;&#x65B9;&#x5B89;&#x88C5;&#x9632;&#x706B;&#x5899;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5F88;&#x5927;&#x3002;&#x6211;&#x4E0D;&#x60F3;&#x518D;&#x8FD8;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x601D;&#x8DEF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x88AB;&#x5BF9;&#x65B9;&#x53D1;&#x73B0;&#x3002;</p>
<p>&#x6211;&#x53EA;&#x8981;&#x53D1;&#x6570;&#x636E;&#x5305;&#x8FC7;&#x53BB;&#xFF0C;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4F1A;&#x88AB;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#x53D1;&#x73B0;&#x3002;&#x53EA;&#x8981;&#x5BF9;&#x65B9;&#x53D1;&#x73B0;&#x6211;&#x5728;&#x626B;&#x63CF;&#x4ED6;&#xFF0C;&#x4ED6;&#x6709;&#x4E86;&#x9632;&#x5907;&#xFF0C;&#x6211;&#x8981;&#x653B;&#x51FB;&#x5C31;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x5728;&#x60F3;&#x5982;&#x4F55;&#x5165;&#x624B;&#x3002;&#x6211;&#x731C;&#x60F3;&#x4ED6;&#x4EEC;&#x7684;&#x5BA2;&#x6237;&#x673A;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x7684;&#x5FAE;&#x8F6F;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x5982;&#x679C;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7684;&#x6F0F;&#x6D1E;&#x4E0D;&#x5C11;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5371;&#x9669;&#xFF0C;&#x4F46;&#x662F;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x4F5C;&#xFF0C;&#x603B;&#x662F;&#x4E0D;&#x662F;&#x529E;&#x6CD5;&#x3002;</p>
<p>&#x6211;&#x51B3;&#x5B9A;&#x62FF;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x8BD5;&#x63A2;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6211;ping&#x4E86;&#x4E00;&#x4E0B;&#x90A3;&#x4E2A;ip&#xFF0C;&#x5475;&#x5475;&#xFF0C;time out&#x3002;&#x4E0D;&#x901A;&#x3002;&#x770B;&#x6765;&#x5BF9;&#x65B9;&#x8981;&#x4E48;&#x6CA1;&#x5F00;&#x673A;&#xFF0C;&#x8981;&#x4E48;&#x5B89;&#x4E86;&#x9632;&#x706B;&#x5899;&#x3002;&#x6CA1;&#x5F00;&#x673A;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4E0D;&#x5927;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x5B89;&#x4E86;&#x9632;&#x706B;&#x5899;&#x3002;</p>
<p>&#x6211;&#x60F3;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#x5E94;&#x8BE5;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x5728;ping&#x4ED6;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x6211;&#x9A6C;&#x4E0A;&#x542F;&#x52A8;&#x6211;&#x7684;&#x8FDE;&#x63A5;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C1D;&#x8BD5;&#x548C;&#x5BF9;&#x65B9;&#x7684;&#x7AEF;&#x53E3;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x4E9B;&#x7AEF;&#x53E3;&#x90FD;&#x662F;&#x4E9B;&#x9632;&#x706B;&#x5899;&#x7684;&#x5F00;&#x7684;&#x7AEF;&#x53E3;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x9632;&#x706B;&#x5899;&#x90FD;&#x5F00;&#x4E86;&#x7AEF;&#x53E3;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x4ED6;&#x4EEC;&#x516C;&#x53F8;&#x53D1;&#x7ED9;&#x4ED6;&#x4EEC;&#x7684;&#x6D88;&#x606F;&#xFF1F;&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x7684;&#x3002;&#x800C;&#x4E14;&#x4E0D;&#x540C;&#x9632;&#x706B;&#x5899;&#x7684;&#x7AEF;&#x53E3;&#x4E5F;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x6211;&#x628A;&#x6211;&#x77E5;&#x9053;&#x7684;&#x6240;&#x6709;&#x9632;&#x706B;&#x5899;&#x7684;&#x7AEF;&#x53E3;&#x90FD;&#x5C1D;&#x8BD5;&#x4E00;&#x904D;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x7EC8;&#x4E8E;&#x5BF9;&#x4E86;&#x3002;&#x8FDE;&#x63A5;&#x6210;&#x529F;&#x3002;&#x6211;&#x7684;&#x8FD0;&#x6C14;&#x603B;&#x662F;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x5BF9;&#x65B9;&#x7528;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x5927;&#x5BB6;&#x90FD;&#x719F;&#x6089;&#x7684;&#x67D0;&#x67D0;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#x4EE5;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x5B57;&#x7F16;&#x8F91;&#x8F6F;&#x4EF6;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x6709;&#x95E8;&#xFF0C;&#x90A3;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x9632;&#x706B;&#x5899;&#x4E0D;&#x6562;&#x606D;&#x7EF4;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4ED6;&#x7684;&#x4E00;&#x4E2A;&#x6F0F;&#x6D1E;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x4E58;&#x5BF9;&#x65B9;&#x8FD8;&#x6CA1;&#x91C7;&#x53D6;&#x63AA;&#x65BD;&#xFF0C;&#x5148;&#x641E;&#x6389;&#x4ED6;&#x7684;&#x9632;&#x706B;&#x5899;&#x518D;&#x8BF4;&#x3002;&#x6211;&#x7ACB;&#x523B;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x8FC7;&#x53BB;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4E13;&#x95E8;&#x5BF9;&#x4ED8;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x7684;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x767E;&#x8BD5;&#x767E;&#x7075;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x679C;&#x7136;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#x9000;&#x51FA;&#x4E86;&#x3002;&#x6211;ping&#x5BF9;&#x65B9;&#xFF0C;&#x5DF2;&#x7ECF;&#x6B63;&#x5E38;&#x54CD;&#x5E94;&#x4E86;&#x3002;&#x8D76;&#x5FEB;&#x626B;&#x63CF;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5FC3;&#x4EBA;&#x53D1;&#x73B0;&#x9632;&#x706B;&#x5899;&#x6CA1;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x5C31;&#x9EBB;&#x70E6;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x626B;&#x63CF;&#x7684;&#x65F6;&#x5019;&#x5230;&#x4E86;&#x3002;&#x6211;&#x5F00;&#x52A8;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x57FA;&#x4E8E;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x626B;&#x63CF;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x7ED3;&#x679C;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x7684;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x6839;&#x636E;&#x8FD4;&#x56DE;&#x56DE;&#x6765;&#x7684;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#x6211;&#x5224;&#x65AD;&#x3002;</p>
<p>&#x5BF9;&#x65B9;&#x662F;&#x91C7;&#x7528;&#x7684;&#x5C45;&#x7136;&#x662F;&#x7684;window98&#x7CFB;&#x7EDF;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x6211;&#x7684;&#x5FC3;&#x5F00;&#x59CB;&#x4E0B;&#x6C89;&#x3002;</p>
<p>&#x4F60;&#x522B;&#x770B;windows98&#x4E00;&#x8EAB;&#x7684;&#x6BDB;&#x75C5;&#xFF0C;&#x8BA9;&#x4ED6;&#x84DD;&#x5C4F;&#x6613;&#x5982;&#x53CD;&#x638C;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x60F3;&#x518D;&#x4ED6;&#x4E0A;&#x9762;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#xFF0C;&#x653E;&#x4E2A;&#x6728;&#x9A6C;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x53CD;&#x800C;&#x6BD4;windows2000&#x66F4;&#x96BE;&#x3002;</p>
<p>windows&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x8981;&#x505A;&#x670D;&#x52A1;&#xFF0C;&#x751A;&#x81F3;&#x8FDE;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x7684;&#x529F;&#x80FD;&#x51E0;&#x4E4E;&#x90FD;&#x4E0D;&#x5B8C;&#x5584;&#x3002;</p>
<p>&#x6211;&#x770B;&#x5230;&#x51E0;&#x4E2A;&#x719F;&#x6089;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x8BA9;&#x4ED6;&#x84DD;&#x5C4F;&#xFF0C;&#x6B7B;&#x673A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x65E0;&#x6CD5;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x4E0A;&#x53BB;&#x3002;</p>
<p>&#x6211;&#x7684;&#x8FD0;&#x6C14;&#x4E00;&#x5411;&#x4E0D;&#x597D;&#x3002;</p>
<p>&#x6211;&#x7684;&#x5FC3;&#x60C5;&#x7792;&#x6CAE;&#x4E27;&#x7684;&#x3002;&#x5176;&#x4ED6;&#x4EBA;&#x4E5F;&#x6CA1;&#x6709;&#x4F20;&#x6765;&#x597D;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x770B;&#x6765;&#xFF0C;&#x4F7F;&#x7528;&#x4E0B;&#x4E2A;ip&#x4E4B;&#x524D;&#x3002;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x7948;&#x6C42;&#x4E0A;&#x5E1D;&#x4FDD;&#x4F51;&#x4E86;&#x3002;</p>
<p>&#x672C;&#x6765;&#x60F3;&#x628A;&#x90A3;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x641E;&#x762B;&#x75EA;&#x3002;&#x60F3;&#x60F3;&#x4E0D;&#x8981;&#x5F15;&#x8D77;&#x5BF9;&#x65B9;&#x592A;&#x5927;&#x7684;&#x6CE8;&#x610F;&#x3002;&#x4E5F;&#x5C31;&#x7F62;&#x4E86;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter9.html" class="navigation navigation-prev " aria-label="Previous page: 第九章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter11.html" class="navigation navigation-next " aria-label="Next page: 第十一章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十章","level":"1.11","depth":1,"next":{"title":"第十一章","level":"1.12","depth":1,"path":"chapter11.md","ref":"chapter11.md","articles":[]},"previous":{"title":"第九章","level":"1.10","depth":1,"path":"chapter9.md","ref":"chapter9.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter10.md","mtime":"2017-02-27T04:04:42.123Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

