
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter4.html" />
    
    
    <link rel="prev" href="chapter2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6211;&#x653B;&#x7834;&#x4E86;&#x7F8E;&#x519B;&#x6D77;&#x519B;&#x7F51;&#x7AD9;-2">&#x6211;&#x653B;&#x7834;&#x4E86;&#x7F8E;&#x519B;&#x6D77;&#x519B;&#x7F51;&#x7AD9; [2]</h2>
<p>&#x9001;&#x8D70;&#x5C0F;&#x654F;&#xFF0C;&#x65F6;&#x95F4;&#x5DF2;&#x7ECF;&#x662F;&#x665A;&#x4E0A;10&#x70B9;&#x949F;&#x4E86;&#x3002;&#x5C0F;&#x654F;&#x662F;&#x672C;&#x5730;&#x4EBA;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x3002;&#x5979;&#x5BB6;&#x636E;&#x8BF4;&#x5728;&#x57CE;&#x5357;&#xFF0C;&#x800C;&#x6211;&#x4F4F;&#x5728;&#x57CE;&#x5317;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x53EA;&#x662F;&#x9001;&#x5979;&#x4E0A;&#x8BA1;&#x7A0B;&#x8F66;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x53BB;&#x8FC7;&#x5979;&#x5BB6;&#xFF0C;&#x5BF9;&#x5979;&#x7684;&#x5BB6;&#x5EAD;&#x4E5F;&#x4E0D;&#x4E86;&#x89E3;&#x3002;&#x6211;&#x53EA;&#x77E5;&#x9053;&#x5979;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x672C;&#x57CE;&#x5E02;&#x6700;&#x597D;&#x7684;&#x4E00;&#x5BB6;&#x533B;&#x9662;&#x3002;&#x5979;&#x5728;&#x5916;&#x79D1;&#x3002;&#x5979;&#x4EEC;&#x5355;&#x4F4D;&#x4E5F;&#x5728;&#x57CE;&#x5317;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5230;&#x5979;&#x5355;&#x4F4D;&#x53BB;&#x7B49;&#x8FC7;&#x5979;&#x4E00;&#x6B21;&#x3002;&#x5012;&#x662F;&#x5979;&#x7ECF;&#x5E38;&#x5230;&#x6211;&#x8FD9;&#x91CC;&#x6765;&#x73A9;&#x3002;&#x4ECA;&#x5929;&#x8FC7;&#x7684;&#x5F88;&#x6E29;&#x99A8;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x5C0F;&#x654F;&#x3002;&#x73B0;&#x5728;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x6211;&#x7684;&#x51B7;&#x6E05;&#x7B80;&#x964B;&#x7684;&#x4E66;&#x623F;&#xFF0C;&#x4F3C;&#x4E4E;&#x6709;&#x4E9B;&#x5931;&#x843D;&#x3002;&#x4F46;&#x662F;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x5931;&#x843D;&#x4EC0;&#x4E48;&#xFF0C;&#x53CD;&#x6B63;&#x4EBA;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6709;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x5947;&#x602A;&#x3002;</p>
<p>&#x5173;&#x95ED;&#x521A;&#x624D;&#x5C0F;&#x654F;&#x6253;&#x5F00;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x9F20;&#x6807;&#x4E0A;&#x8FD8;&#x7559;&#x6709;&#x5C0F;&#x654F;&#x7684;&#x70ED;&#x5EA6;&#x548C;&#x6DE1;&#x6DE1;&#x7684;&#x9999;&#x5473;&#x3002;&#x6211;&#x6709;&#x4E9B;&#x5FC3;&#x4E0D;&#x5728;&#x7109;&#x3002;&#x660E;&#x5929;&#x661F;&#x671F;&#x5929;&#xFF0C;&#x6240;&#x4EE5;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#x5F88;&#x8F7B;&#x677E;&#xFF0C;&#x4E0D;&#x5FC5;&#x8981;&#x5F3A;&#x8FEB;&#x81EA;&#x5DF1;&#x65E9;&#x70B9;&#x7761;&#x89C9;&#x3002;&#x968F;&#x7740;&#x9F20;&#x6807;&#x5728;&#x6F2B;&#x4E0D;&#x7ECF;&#x5FC3;&#x7684;&#x70B9;&#x52A8;&#xFF0C;&#x6211;&#x7684;&#x5FC3;&#x9010;&#x6E10;&#x5E73;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x5C0F;&#x654F;&#x6E10;&#x6E10;&#x79BB;&#x5F00;&#x4E86;&#x6211;&#x7684;&#x8111;&#x6D77;&#x3002;</p>
<p>&#x6211;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x6211;&#x7684;&#x76EE;&#x6807;&#x4E0A;&#x6765;&#x3002;&#x6211;&#x8BA4;&#x771F;&#x5730;&#x8FDB;&#x5165;&#x90A3;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x7F51;&#x7AD9;&#x7684;&#x603B;&#x7AD9;&#x3002;&#x5728;&#x5B83;&#x7684;&#x90A3;&#x4E2A;bbs&#x4E0A;&#x4E00;&#x8FB9;&#x95F2;&#x901B;&#xFF0C;&#x4E00;&#x8FB9;&#x60F3;&#x5982;&#x4F55;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x6743;&#x9650;&#x3002;&#x521A;&#x624D;&#x6211;&#x5DF2;&#x7ECF;&#x80FD;&#x4E0A;&#x4F20;&#x4E00;&#x4E9B;php&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x83B7;&#x5F97;&#x5B83;&#x7684;&#x5BC6;&#x7801;&#x6587;&#x4EF6;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x6211;&#x4E00;&#x8FB9;&#x901B;&#xFF0C;&#x4E00;&#x8FB9;&#x60F3;&#x3002;&#x6211;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#x548C;&#x4E0B;&#x8F7D;&#x5B83;&#x7684;&#x7684;www server&#x4E0B;&#x7684;&#x4EFB;&#x4F55;&#x6587;&#x4EF6;&#x3002;&#x6539;&#x5B83;&#x7684;&#x4E3B;&#x9875;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x4E0D;&#x662F;&#x6211;&#x60F3;&#x8981;&#x7684;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x7684;&#x662F;root&#x6743;&#x9650;&#x3002;&#x4E3A;&#x4E86;&#x4E0D;&#x88AB;&#x4ED6;&#x4EEC;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x9A6C;&#x4E0A;&#x5199;&#x4E86;&#x4E2A;php&#x7A0B;&#x5E8F;&#xFF0C;&#x5BF9;&#x5B83;&#x7684;WWW&#x4E0B;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x4E86;&#x904D;&#x5386;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x627E;&#x5230;&#x4E86;&#x90A3;&#x4E2A;bbs&#x7684;log&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x4E2A;&#x53EB;access.log&#x7684;&#x6587;&#x4EF6;&#x3002;&#x7ACB;&#x523B;&#x4E0B;&#x8BFB;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x51E0;&#x53E5;&#x56DE;&#x6765;&#x770B;&#x4E86;&#x4E0B;&#xFF0C;&#x5168;&#x90E8;&#x8BFB;&#x56DE;&#x6765;&#xFF0C;&#x592A;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;200m&#x4E4B;&#x5927;&#xFF01;&#x770B;&#x6765;&#x8FD9;&#x4E2A;bbs&#x7684;&#x7BA1;&#x7406;&#x5458;&#x4E5F;&#x6EE1;&#x61D2;&#x7684;&#xFF0C;&#x597D;&#x4E45;&#x6CA1;&#x6E05;&#x9664;&#x4E86;&#x3002;&#x4E00;&#x770B;&#xFF0C;&#x7ACB;&#x523B;&#x8BA4;&#x5B9A;&#x662F;bbs&#x7684;log&#x6587;&#x4EF6;&#xFF0C;&#x7ACB;&#x523B;&#x5199;&#x4E86;&#x4EE3;&#x7801;&#x628A;&#x51E1;&#x662F;&#x6709;&#x6211;&#x7684;ip&#x5730;&#x5740;&#x7684;&#x8BB0;&#x5F55;&#x5168;&#x90E8;&#x5220;&#x9664;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x6587;&#x4EF6;&#x7ACB;&#x523B;&#x5C0F;&#x4E86;&#x597D;&#x591A;&#x3002;&#x4F60;&#x60F3;&#x6211;&#x4E00;&#x5929;&#x4E00;&#x591C;&#x7684;&#x6D4B;&#x8BD5;&#x5BC6;&#x7801;&#xFF0C;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x61C2;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x4E00;&#x770B;&#x4E5F;&#x5E94;&#x8BE5;&#x660E;&#x767D;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x4F55;&#x51B5;&#x90A3;&#x4E9B;&#x7F8E;&#x56FD;&#x201C;&#x8001;&#x9E1F;&#x201D;&#xFF1F;&#x5220;&#x9664;&#x4E86;&#x6211;&#x7684;&#x5E10;&#x53F7;&#x68C0;&#x6D4B;&#x8BB0;&#x5F55;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x8E0F;&#x5B9E;&#x4E9B;&#x4E86;&#x3002;&#x6211;&#x77E5;&#x9053;&#x4E86;&#x90A3;&#x4E2A;caption&#x3000;tom&#x7684;&#x4E0A;&#x4F20;&#x5E10;&#x53F7;&#x3002;&#x7A81;&#x7136;&#x7075;&#x5149;&#x4E00;&#x95EA;&#xFF0C;&#x4E0D;&#x77E5;&#x4ED6;&#x7684;vsftp&#x7528;&#x7684;&#x662F;&#x865A;&#x62DF;&#x5E10;&#x53F7;&#xFF0C;&#x8FD8;&#x662F;&#x7CFB;&#x7EDF;&#x5E10;&#x53F7;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x7CFB;&#x7EDF;&#x5E10;&#x53F7;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x5C31;&#x9EBB;&#x70E6;&#x4E86;&#x3002;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x95EA;&#x5FF5;&#x4E4B;&#x95F4;&#xFF0C;&#x624B;&#x4E0A;&#x5DF2;&#x7ECF;&#x542F;&#x52A8;&#x4E86;ssh&#x8FDE;&#x63A5;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x8F93;&#x5165;ip&#xFF0C;&#x6572;&#x5165;caption tom&#x7684;ftp&#x5E10;&#x53F7;&#xFF0C;&#x56DE;&#x8F66;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x5DEE;&#x70B9;&#x7B11;&#x51FA;&#x58F0;&#x6765;,&#x6211;&#x7684;&#x9762;&#x524D;&#x51FA;&#x73B0;&#x4E86;&#x7F8E;&#x4E3D;&#x7684;$&#x7B26;&#x53F7;&#x3002;&#x770B;&#x6765;&#x4ED6;&#x7684;vsftp&#x7528;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x5E10;&#x53F7;&#x3002;&#x8FD9;&#x4E2A;&#x4E0D;&#x602A;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x56E0;&#x4E3A;&#x7BA1;&#x7406;&#x5458;&#x7684;ftp&#x5C31;&#x5BF9;&#x5916;&#x5C31;&#x5F00;&#x4E86;&#x533F;&#x540D;&#xFF0C;&#x800C;&#x4E14;&#x90A3;&#x4E2A;&#x533F;&#x540D;ftp&#x7684;&#x5E10;&#x53F7;&#x5DF2;&#x7ECF;&#x88AB;&#x8BBE;&#x7F6E;&#x6210;&#x4E86;&#x4E0D;&#x80FD;&#x4ECE;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5C31;&#x662F;&#x795E;&#x4ED9;&#x4E5F;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;bbs&#x7684;&#x7BA1;&#x7406;&#x5458;&#x663E;&#x7136;&#x662F;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x5BF9;&#x4ED6;&#x7684;&#x7279;&#x522B;&#x7167;&#x987E;&#xFF0C;&#x6240;&#x4EE5;&#x4E13;&#x95E8;&#x7ED9;&#x4ED6;&#x5F00;&#x4E86;&#x4E2A;&#x79C1;&#x4EBA;&#x5E10;&#x53F7;&#xFF0C;&#x4E3A;&#x4E86;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x65B9;&#x9762;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x80FD;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x3002;&#x4F7F;&#x7528;ssh&#x534F;&#x8BAE;&#xFF0C;&#x5E94;&#x8BE5;&#x4E5F;&#x6CA1;&#x6709;&#x88AB;&#x7A83;&#x542C;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4ED6;&#x505A;&#x68A6;&#x4E5F;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#xFF0C;&#x6211;&#x4F1A;&#x628A;bbs&#x548C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x5E10;&#x53F7;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x6211;&#x7834;&#x8BD1;&#x4E86;&#x90A3;&#x4E2A;&#x4EBA;&#x7684;&#x5E10;&#x53F7;&#x3002;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x591F;&#x7CBE;&#xFF0C;&#x662F;&#x654C;&#x4EBA;&#x592A;&#x72E1;&#x733E;&#x3002;&#x6211;&#x6709;&#x70B9;&#x5F97;&#x610F;&#x4E86;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x628A;&#x81EA;&#x5DF1;&#x53D8;&#x6210;root&#x5566;&#xFF0C;&#x8FD9;&#x65B9;&#x9762;unix&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x5403;&#x4E8F;&#x3002;&#x53EA;&#x8981;unix&#x80FD;&#x83B7;&#x5F97;&#x5B83;&#x7684;&#x666E;&#x901A;&#x5E10;&#x53F7;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#xFF0C;&#x80FD;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x9047;&#x5230;&#x9AD8;&#x624B;&#xFF0C;&#x8FD9;&#x4E2A;unix&#x5C31;&#x6302;&#x5B9A;&#x4E86;&#x3002;&#x6211;&#x5DF2;&#x7ECF;&#x5177;&#x5907;&#x4E86;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#xFF0C;&#x9A6C;&#x4E0A;&#x770B;&#x770B;&#x80FD;&#x5426;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x9A6C;&#x4E0A;&#x7528;c&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;hello world&#x7A0B;&#x5E8F;&#x3002;&#x4F7F;&#x7528;GCC&#x4E00;&#x7F16;&#x8BD1;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x6CA1;&#x6709;&#x62A5;&#x9519;&#xFF0C;gcc&#x53EF;&#x7528;&#xFF0C;&#x6211;&#x5728;&#x8FD9;&#x4E2A;caption tom&#x7684;&#x5E10;&#x53F7;&#x4E0B;&#x62E5;&#x6709;&#x6240;&#x6709;&#x6743;&#x9650;&#x3002;&#x6211;&#x5FC3;&#x60C5;&#x5DF2;&#x7ECF;&#x8F7B;&#x677E;&#x4E86;&#x8BB8;&#x591A;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x611F;&#x5230;&#x80DC;&#x5229;&#x5C31;&#x5728;&#x773C;&#x524D;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x4E0B;&#x9762;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x6EA2;&#x51FA;&#x5927;&#x6CD5;&#xFF0C;&#x53EA;&#x8981;&#x6EA2;&#x51FA;&#xFF0C;&#x5C31;&#x53EF;&#x770B;&#x5230;&#xFF03;&#x53F7;&#x4E86;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5176;&#x5B9E;web&#x9875;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x662F;&#x6F0F;&#x6D1E;&#x6700;&#x591A;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4ECE;&#x4ED6;&#x5165;&#x624B;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x7F3A;&#x53E3;&#x3002;&#x73B0;&#x5728;&#x76F4;&#x63A5;&#x4ECE;&#x7CFB;&#x7EDF;&#x5165;&#x624B;&#x5DF2;&#x7ECF;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#x7528;&#x4E86;&#x3002;</p>
<p>&#x5148;&#x4F7F;&#x7528;&#x6211;&#x4E0A;&#x4F20;&#x4E86;&#x4E00;&#x4E2A;unix&#x7684;&#x6EA2;&#x51FA;&#x7A0B;&#x5E8F;&#xFF0C;&#x7F16;&#x8BD1;&#xFF0C;&#x6267;&#x884C;&#xFF0C;&#x7B11;&#x7740;&#x7B49;&#x5F85;&#x51FA;&#x73B0;&#x90A3;&#x4E2A;&#xFF03;&#x53F7;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x7684;&#x7B11;&#x5BB9;&#x51DD;&#x56FA;&#x4E86;&#x3002;&#xFF03;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x7684;ssh&#x4E5F;&#x88AB;&#x4E2D;&#x6B62;&#x8FDE;&#x63A5;&#x4E86;&#xFF01;</p>
<p>shit&#xFF01;&#x770B;&#x6765;&#x80AF;&#x5B9A;&#x662F;&#x6EA2;&#x51FA;&#x7A0B;&#x5E8F;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x7ACB;&#x523B;&#x91CD;&#x65B0;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD8;&#x597D;&#xFF0C;unxi&#x5C31;&#x662F;&#x7A33;&#x5B9A;&#xFF0C;&#x8FD8;&#x6CA1;&#x6B7B;&#x673A;&#x3002;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#x3002;&#x7528;w&#x547D;&#x4EE4;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD8;&#x597D;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x4E0D;&#x5728;&#x3002;&#x73B0;&#x5728;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x60F3;&#x529E;&#x6CD5;&#x8BA9;&#x5B83;&#x6EA2;&#x51FA;&#x3002;&#x53D1;&#x660E;&#x6EA2;&#x51FA;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD9;&#x4E2A;&#x4EBA;&#x7EDD;&#x5BF9;&#x662F;&#x4E2A;&#x5929;&#x624D;&#xFF0C;&#x4EA7;&#x751F;&#x6EA2;&#x51FA;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x9632;&#x4E0D;&#x80DC;&#x9632;&#xFF0C;unix&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x4E86;&#xFF0C;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x5728;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x51E0;&#x4E4E;&#x6EA2;&#x51FA;&#x90FD;&#x662F;&#x5FC5;&#x6740;&#x6280;&#x672F;&#xFF0C;&#x4F46;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x771F;&#x6B63;&#x638C;&#x63E1;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x7684;&#x9ED1;&#x5BA2;&#x786E;&#x5B9E;&#x4E0D;&#x591A;&#x3002;&#x8C01;&#x53EB;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x51E0;&#x4E4E;&#x90FD;&#x662F;&#x4F7F;&#x7528;c/c++&#x5199;&#x7684;&#x5462;&#xFF01;&#x6211;&#x4E0D;&#x662F;&#x8BF4;c/c++&#x4E0D;&#x597D;&#xFF0C;&#x5728;&#x6211;&#x773C;&#x91CC;&#xFF0C;c/c++&#x7EDD;&#x5BF9;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x7F8E;&#x7684;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x3002;&#x8FC7;&#x53BB;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#x662F;&#xFF0C;&#x5C06;&#x6765;&#x8FD8;&#x662F;&#xFF01;&#x56E0;&#x4E3A;c&#x592A;&#x7075;&#x6D3B;&#x4E86;&#xFF0C;&#x5B83;&#x5BF9;&#x4F60;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x68C0;&#x67E5;&#x8FB9;&#x754C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4F60;&#x7ED9;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x53EB;&#x505C;&#xFF0C;&#x5B83;&#x5C31;&#x4E00;&#x76F4;&#x5F80;&#x4E0B;&#x704C;&#x3002;&#x7BA1;&#x5B83;&#x4F1A;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x540E;&#x679C;&#xFF0C;&#x5B83;&#x5C31;&#x4E00;&#x76F4;&#x5F80;&#x4E0B;&#x704C;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x53EB;&#x505C;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x5C31;&#x662F;&#x4EA7;&#x751F;&#x6EA2;&#x51FA;&#x7684;&#x6839;&#x6E90;&#x3002;&#x4ED6;&#x4EEC;&#x5C31;&#x662F;&#x4E0D;&#x81EA;&#x5DF1;&#x5224;&#x65AD;&#x8FB9;&#x754C;&#x3002;&#x5305;&#x62EC;c&#x7684;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#x3002;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x8FD8;&#x5BF9;&#x60F3;&#x51FA;&#x4F7F;&#x7528;&#x6EA2;&#x51FA;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#x7684;&#x4EBA;&#x4F69;&#x670D;&#x7684;&#x4E0D;&#x884C;&#x3002;&#x4ED6;&#x5F53;&#x65F6;&#x662F;&#x600E;&#x4E48;&#x60F3;&#x51FA;&#x6765;&#x7684;&#xFF1F;&#x9760;&#x3002;&#x8111;&#x74DC;&#x5B50;&#x771F;&#x662F;&#x597D;&#x7528;&#x5440;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x80AF;&#x5B9A;&#x90A3;&#x4E2A;&#x4EBA;&#x80AF;&#x5B9A;&#x662F;&#x4E2A;&#x8C03;&#x8BD5;&#x9AD8;&#x624B;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x4E2A;&#x6C47;&#x7F16;&#x8C03;&#x8BD5;&#x9AD8;&#x624B;&#x3002;&#x56E0;&#x4E3A;&#x6EA2;&#x51FA;&#x7A0B;&#x5E8F;&#xFF0C;&#x54EA;&#x6015;&#x5C31;&#x662F;&#x5DEE;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x540E;&#x679C;&#x5C31;&#x5B8C;&#x5168;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x6267;&#x884C;&#x3002;&#x521A;&#x624D;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x6EA2;&#x51FA;&#x7A0B;&#x5E8F;&#x548C;&#x8FD9;&#x4E2A;unix&#x7248;&#x672C;&#x6709;&#x70B9;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x6EA2;&#x51FA;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x90FD;&#x5230;&#x8FD9;&#x63A5;&#x9AA8;&#x773C;&#x4E0A;&#x4E86;&#xFF0C;&#x5BB3;&#x6015;&#x8FD9;&#x4E2A;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x52A0;&#x5927;&#x6EA2;&#x51FA;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x8BA9;&#x6EA2;&#x51FA;&#x5730;&#x5740;&#x5F80;&#x4E0A;&#x9876;&#x3002;&#x4E00;&#x70B9;&#x4E00;&#x70B9;&#x7684;&#x8BD5;&#x9A8C;&#x3002;&#x67AF;&#x71E5;&#x7684;&#x5DE5;&#x4F5C;&#x53C8;&#x5F00;&#x59CB;&#x4E86;&#xFF0C;&#x65F6;&#x95F4;&#x4E00;&#x70B9;&#x4E00;&#x70B9;&#x7684;&#x8FC7;&#x53BB;&#x3002;&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x6CA1;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x662F;&#x6BC5;&#x529B;&#x7EDD;&#x5BF9;&#x662F;&#x6709;&#x7684;&#xFF0C;&#x8FD9;&#x70B9;&#x6211;&#x5F88;&#x662F;&#x81EA;&#x4FE1;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x7684;&#x624B;&#x98DE;&#x5FEB;&#x7684;&#x6572;&#x51FB;&#x952E;&#x76D8;&#xFF0C;&#x4E00;&#x6B21;&#x6B21;&#x5931;&#x8D25;&#xFF0C;&#x4E00;&#x6B21;&#x6B21;&#x91CD;&#x65B0;&#x8FDE;&#x63A5;&#x3002;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x6211;&#x7684;&#x60C5;&#x7EEA;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x9ED1;&#x5BA2;&#x4F5C;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x82E6;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#x3002;&#x90A3;&#x4E9B;&#x5199;&#x6587;&#x7AE0;&#x7684;&#x4EBA;&#x5199;&#x7684;&#x90FD;&#x5F88;&#x6F47;&#x6D12;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x6545;&#x4F5C;&#x6F47;&#x6D12;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x771F;&#x6B63;&#x53BB;&#x7834;&#x8BD1;&#x8FC7;&#x4EC0;&#x4E48;&#x3002;&#x5176;&#x5B9E;&#x5B8C;&#x5168;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x5DF2;&#x7ECF;&#x4E0D;&#x77E5;&#x9053;&#x8BD5;&#x4E86;&#x591A;&#x5C11;&#x6B21;&#x4E86;&#xFF0C;&#x770B;&#x770B;&#x65F6;&#x95F4;&#xFF0C;&#x5DF2;&#x7ECF;&#x51CC;&#x6668;3&#x70B9;&#x4E86;&#x3002;&#x6211;&#x5012;&#x4E86;&#x676F;&#x6C34;&#xFF0C;&#x559D;&#x4E86;&#x4E00;&#x53E3;&#xFF0C;&#x7EE7;&#x7EED;&#x6572;&#x51FB;&#x952E;&#x76D8;&#x3002;&#x7A81;&#x7136;&#xFF0C;&#x5728;&#x6211;&#x6B63;&#x51C6;&#x5907;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x3002;&#x8FDE;&#x63A5;&#x6CA1;&#x6709;&#x4E2D;&#x65AD;&#xFF0C;&#x90A3;&#x4E2A;&#xFF03;&#x7B26;&#x53F7;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x6211;&#x505C;&#x4F4F;&#x90A3;&#x5DF2;&#x7ECF;&#x90FD;&#x6709;&#x60EF;&#x6027;&#x7684;&#x624B;&#x6307;&#x3002;&#x957F;&#x8F93;&#x4E86;&#x4E00;&#x53E3;&#x6C14;&#xFF0C;&#x63A9;&#x9970;&#x4E0D;&#x4F4F;&#x5FC3;&#x91CC;&#x7684;&#x72C2;&#x559C;&#xFF0C;&#x5728;&#x7B14;&#x8BB0;&#x672C;&#x8BB0;&#x4E0B;&#x6EA2;&#x51FA;&#x5730;&#x5740;&#x3002;&#x4E0B;&#x6B21;&#x5982;&#x679C;&#x518D;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0D;&#x7528;&#x8FD9;&#x4E48;&#x8F9B;&#x82E6;&#x4E86;&#x3002;&#x5468;&#x56F4;&#x4E00;&#x70B9;&#x58F0;&#x97F3;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x6211;&#x771F;&#x60F3;&#x627E;&#x4E2A;&#x4EBA;&#x503E;&#x8BC9;&#xFF0C;&#x6211;&#x6210;&#x529F;&#x8FDB;&#x5165;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x603B;&#x7AD9;&#x4E86;&#xFF01;&#x54C8;&#x54C8;&#x54C8;&#x3002;&#x770B;&#x770B;&#x7BA1;&#x7406;&#x5458;&#x4E0A;&#x6765;&#x6CA1;&#xFF1F;&#x6CA1;&#x6709;&#x3002;&#x6211;&#x8212;&#x4E86;&#x4E00;&#x53E3;&#x6C14;&#xFF0C;&#x6211;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x4F5C;&#x5584;&#x540E;&#x5DE5;&#x4F5C;&#x3002;&#x770B;&#x6765;&#x4ED6;&#x4EEC;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x4E5F;&#x662F;&#x591C;&#x732B;&#x5B50;&#xFF0C;&#x665A;&#x4E0A;&#x6765;&#x4E0A;&#x6765;&#x3002;&#x6211;&#x7761;&#x89C9;&#x7684;&#x65F6;&#x5019;&#x6B63;&#x662F;&#x4ED6;&#x4E0A;&#x6765;&#x7684;&#x65F6;&#x5019;&#x3002;&#x54C8;&#x54C8;&#x3002;</p>
<p>&#x6293;&#x8D77;&#x6211;&#x65C1;&#x8FB9;&#x7684;&#x5409;&#x4ED6;&#xFF0C;&#x6211;&#x795E;&#x7ECF;&#x4E00;&#x6837;&#x5531;&#x8D77;&#x6B4C;&#x6765;&#xFF0C;&#x90A3;&#x9996;&#x6211;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x7684;&#x6C88;&#x5E86;&#x7684;&#x5C81;&#x6708;&#xFF0C;&#x84DD;&#x84DD;&#x7684;&#x5929;&#x5728;&#x7EA2;&#x7EA2;&#x7684;&#x8273;&#x9633;&#x4E0A;&#x9762;&#xFF0C;&#x66FE;&#x7ECF;&#x7684;&#x7B11;&#x8138; &#x5230;&#x5982;&#x4ECA;&#x8FD8;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#xFF0C;&#x603B;&#x6709;&#x4E9B;&#x4E8B; &#x662F;&#x806A;&#x660E;&#x5982;&#x4F60;&#x4E5F;&#x4E0D;&#x80FD;&#x9884;&#x8A00;&#x3002;&#x6211;&#x5531;&#x7684;&#x6BD4;&#x8F83;&#x8F7B;&#x3002;&#x6211;&#x53EF;&#x4E0D;&#x60F3;&#x90BB;&#x5C45;&#x6572;&#x6211;&#x7684;&#x6C34;&#x7BA1;&#x3002;&#x6211;&#x8F7B;&#x8F7B;&#x7684;&#x5531;&#x7740;&#xFF0C;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x7A81;&#x7136;&#x60F3;&#x5230;&#x4E86;&#x5C0F;&#x654F;&#xFF0C;&#x60F3;&#x5230;&#x6211;&#x4EEC;&#x6821;&#x56ED;&#x7684;&#x7F8E;&#x597D;&#x65F6;&#x5149;&#x3002;&#x3002;&#x3002;&#x5FC3;&#x91CC;&#x4E00;&#x9635;&#x751C;&#x871C;&#x3002;&#x8FD9;&#x6B4C;&#x4E5F;&#x662F;&#x5C0F;&#x654F;&#x559C;&#x6B22;&#x7684;&#x3002;</p>
<p>&#x6211;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x55DC;&#x597D;&#xFF0C;&#x770B;&#x5230;&#x7535;&#x89C6;&#x4E0A;&#x4E3A;&#x4E86;&#x8868;&#x73B0;&#x4E00;&#x4E2A;&#x4EBA;&#x5F88;&#x8270;&#x82E6;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x75AF;&#x72C2;&#x62BD;&#x70DF;&#x7B49;&#x6765;&#x8868;&#x73B0;&#x7684;&#x3002;&#x6211;&#x4E0D;&#x62BD;&#x70DF;&#xFF0C;&#x4E0D;&#x559D;&#x9152;&#xFF0C;&#x9664;&#x4E86;&#x5C11;&#x91CF;&#x7684;&#x5564;&#x9152;&#x548C;&#x8461;&#x8404;&#x9152;&#x3002;&#x6BCF;&#x5F53;&#x6211;&#x53D6;&#x5F97;&#x5B9E;&#x8D28;&#x6027;&#x7684;&#x7A81;&#x7834;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x60F3;&#x5531;&#x6B4C;&#xFF0C;&#x5728;&#x5B66;&#x6821;&#x7684;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x662F;&#x4E2A;&#x51FA;&#x540D;&#x7684;&#x6821;&#x56ED;&#x5409;&#x4ED6;&#x6B4C;&#x624B;&#x3002;&#x90A3;&#x628A;&#x5409;&#x4ED6;&#x8FD8;&#x662F;&#x539F;&#x6765;&#x7684;&#x90A3;&#x628A;&#xFF0C;&#x5F26;&#x5DF2;&#x7ECF;&#x6362;&#x8FC7;&#x5F88;&#x591A;&#x6B21;&#x4E86;&#xFF0C;&#x7434;&#x9762;&#x4E5F;&#x6591;&#x9A73;&#x4E0D;&#x582A;&#x3002;&#x4F46;&#x662F;&#x97F3;&#x8272;&#x8FD8;&#x662F;&#x539F;&#x6765;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x3002;&#x8F7B;&#x8F7B;&#x7684;&#x629A;&#x7740;&#x5B83;&#xFF0C;&#x5C31;&#x50CF;&#x629A;&#x7740;&#x7684;&#x6211;&#x7684;&#x9752;&#x6625;&#x3002;&#x6211;&#x5531;&#x6B4C;&#x4E0D;&#x9700;&#x8981;&#x542C;&#x4F17;&#xFF0C;&#x6211;&#x662F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x518D;&#x5531;&#x3002;&#x5F53;&#x521D;&#x5C0F;&#x654F;&#x5C31;&#x662F;&#x88AB;&#x6211;&#x7684;&#x6B4C;&#x58F0;&#x6253;&#x52A8;&#x3002;&#x5979;&#x8BF4;&#xFF0C;&#x6211;&#x7684;&#x6B4C;&#x867D;&#x7136;&#x662F;&#x522B;&#x4EBA;&#x5199;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x611F;&#x89C9;&#x662F;&#x5728;&#x5531;&#x4F60;&#x81EA;&#x5DF1;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x628A;&#x81EA;&#x5DF1;&#x5531;&#x7684;&#x4E1C;&#x897F;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4E0D;&#x60F3;&#x5531;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x81EA;&#x5DF1;&#x542C;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x6EE1;&#x611F;&#x6027;&#x7684;&#x4EBA;&#x3002;&#x8C01;&#x8BF4;&#x9ED1;&#x5BA2;&#x4E0D;&#x662F;&#x591A;&#x6101;&#x5584;&#x611F;&#xFF1F;</p>
<p>&#x653E;&#x4E0B;&#x7434;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5DF2;&#x7ECF;4&#x70B9;&#x949F;&#x4E86;&#xFF0C;&#x6211;&#x7684;&#x601D;&#x7EF4;&#x4F9D;&#x7136;&#x6E05;&#x6670;&#xFF0C;&#x4E00;&#x70B9;&#x7761;&#x610F;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x957F;&#x671F;&#x7684;&#x71AC;&#x591C;&#xFF0C;&#x8BA9;&#x6211;&#x73B0;&#x5728;&#x4E00;&#x5230;&#x665A;&#x4E0A;&#x5C31;&#x4EA2;&#x594B;&#xFF0C;&#x767D;&#x5929;&#x4E0A;&#x73ED;&#x7CBE;&#x795E;&#x5C31;&#x4E0D;&#x597D;&#x3002;&#x4ECE;&#x6211;&#x4EEC;&#x5934;&#x7684;&#x773C;&#x795E;&#x4E2D;&#xFF0C;&#x6211;&#x80FD;&#x60F3;&#x8C61;&#x7684;&#x5230;&#x4ED6;&#x53EF;&#x80FD;&#x6000;&#x7591;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x5BF9;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x6000;&#x7591;&#x6211;&#x5438;&#x6BD2;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x5269;&#x4E0B;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x6BD4;&#x8F83;&#x597D;&#x529E;&#x4E86;&#xFF0C;&#x5B89;&#x88C5;&#x540E;&#x95E8;&#xFF0C;&#x6E05;&#x9664;&#x75D5;&#x8FF9;&#x3002;&#x8FD9;&#x662F;&#x9ED1;&#x5BA2;&#x7684;&#x57FA;&#x672C;&#x529F;&#x3002;&#x8FD9;&#x4E9B;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x601D;&#x7EF4;&#x3002;&#x56E0;&#x4E3A;&#x5BF9;unix&#x7CFB;&#x7EDF;&#x7684;&#x540E;&#x95E8;&#x5B89;&#x88C5;&#x6211;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x6211;&#x7279;&#x6709;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x53D1;&#x73B0;&#x8FC7;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x6211;&#x4E00;&#x65E6;&#x653B;&#x514B;&#x4E86;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x540E;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x5BF9;&#x5B83;&#x7684;&#x7CFB;&#x7EDF;&#x4F5C;&#x4EFB;&#x4F55;&#x7684;&#x6539;&#x53D8;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x6709;&#x53EF;&#x80FD;1&#x5E74;&#x90FD;&#x4E0D;&#x4F1A;&#x518D;&#x6B21;&#x767B;&#x9646;&#x8FD9;&#x4E2A;server&#xFF0C;&#x88AB;&#x53D1;&#x73B0;&#x7684;&#x673A;&#x4F1A;&#x51E0;&#x4E4E;&#x7B49;&#x4E8E;0&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x91CD;&#x88C5;&#x7CFB;&#x7EDF;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E00;&#x4E2A;&#x4E13;&#x4E1A;server&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x91CD;&#x88C5;&#x5C31;&#x91CD;&#x88C5;&#x7684;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x57FA;&#x672C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x3002;&#x4ED4;&#x7EC6;&#x5206;&#x6790;&#x4E86;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x53D1;&#x73B0;&#x4ED6;&#x4EEC;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x786E;&#x5B9E;&#x6BD4;&#x8F83;&#x5389;&#x5BB3;&#xFF0C;&#x5230;&#x5904;&#x90FD;&#x662F;&#x9677;&#x9631;&#x548C;&#x76D1;&#x63A7;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4ED6;&#x7684;bin&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x7CFB;&#x7EDF;&#x7A0B;&#x5E8F;&#x5168;&#x662F;&#x88AB;&#x4F5C;&#x4E2A;&#x8BB0;&#x53F7;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x52A8;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#xFF0C;&#x7ACB;&#x523B;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x3002;&#x4E00;&#x822C;&#x7684;&#x9ED1;&#x5BA2;&#x5B89;&#x88C5;&#x540E;&#x95E8;&#x90FD;&#x662F;&#x66FF;&#x6362;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x60F3;&#x901A;&#x8FC7;&#x6539;&#x4ED6;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F60;&#x8FDF;&#x65E9;&#x4F1A;&#x88AB;&#x53D1;&#x73B0;&#x3002;&#x81F3;&#x4E8E;&#x90A3;&#x79CD;&#x7ED9;&#x81EA;&#x5DF1;&#x5EFA;&#x4E2A;root&#x6743;&#x5229;&#x5E10;&#x53F7;&#x7684;&#x83DC;&#x9E1F;&#x505A;&#x6CD5;&#xFF0C;&#x65E0;&#x5F02;&#x4E8E;&#x9001;&#x6B7B;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x6211;&#x90FD;&#x6CA1;&#x6709;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x5B89;&#x88C5;&#x540E;&#x95E8;&#x3002;&#x6211;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x76F4;&#x63A5;&#x5199;&#x78C1;&#x76D8;&#x6247;&#x533A;&#x7684;&#x65B9;&#x6CD5;&#x5B89;&#x88C5;&#x6211;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x7684;&#x542F;&#x52A8;&#x4EE3;&#x7801;&#x6FC0;&#x6D3B;&#x3002;&#x8FD9;&#x548C;&#x5F15;&#x5BFC;&#x578B;&#x75C5;&#x6BD2;&#x7684;&#x539F;&#x7406;&#x4E00;&#x6837;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x6CA1;&#x6709;&#x52A8;&#x4EFB;&#x4F55;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x8FC7;&#x76D1;&#x63A7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x6211;&#x3002;&#x6211;&#x7528;&#x6C47;&#x7F16;&#x5199;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#x7A0B;&#x5E8F;&#x3002;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;telnet&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F7F;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x65B9;&#x5F0F;&#x4FDD;&#x5B58;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x3002;&#x529F;&#x80FD;&#x975E;&#x5E38;&#x5355;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x547D;&#x4EE4;&#x529F;&#x80FD;&#xFF0C;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x8D8A;&#x5C0F;&#x9690;&#x853D;&#x6027;&#x8D8A;&#x597D;&#x3002;</p>
<p>&#x5F88;&#x5FEB;&#x5C31;&#x5B89;&#x88C5;&#x597D;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6FC0;&#x6D3B;&#x5FC5;&#x987B;&#x8981;&#x7B49;&#x5230;&#x7CFB;&#x7EDF;&#x91CD;&#x542F;&#x52A8;&#x624D;&#x884C;&#x3002;&#x8FD9;&#x4E9B;&#x4E13;&#x4E1A;server&#x4E00;&#x5E74;&#x4E0D;&#x91CD;&#x542F;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4E86;&#x9A8C;&#x8BC1;&#x548C;&#x73B0;&#x5728;&#x5C31;&#x6FC0;&#x6D3B;&#x5B83;&#xFF0C;&#x6211;&#x9A6C;&#x4E0A;&#x5199;&#x4E86;&#x4E00;&#x6BB5;&#x7A0B;&#x5E8F;&#xFF0C;&#x628A;&#x5B83;&#x6FC0;&#x6D3B;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x6211;&#x7279;&#x5236;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x9A8C;&#x8BC1;&#x4E00;&#x4E0B;&#xFF0C;ok&#xFF0C;&#x6210;&#x529F;&#x3002;</p>
<p>&#x6253;&#x626B;&#x75D5;&#x8FF9;&#xFF0C;&#x9000;&#x51FA;&#x3002;&#x6211;&#x628A;&#x6240;&#x6709;&#x7684;&#x8BB0;&#x5F55;&#x6587;&#x4EF6;&#x628A;&#x6211;&#x7684;&#x6709;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x5168;&#x90E8;&#x5220;&#x9664;&#x3002;&#x4F46;&#x662F;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x9AD8;&#x624B;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x770B;&#x5230;&#x75D5;&#x8FF9;&#x7684;,&#x4ED6;&#x4EEC;&#x7684;&#x6587;&#x4EF6;&#x76D1;&#x63A7;&#x7CFB;&#x7EDF;&#x53EF;&#x4E0D;&#x662F;&#x5403;&#x5E72;&#x996D;&#x7684;&#x3002;&#x53EA;&#x8981;&#x6211;&#x52A8;&#x4E86;&#x6587;&#x4EF6;&#xFF0C;&#x80AF;&#x5B9A;&#x5C31;&#x4F1A;&#x53D1;&#x89C9;&#x3002;&#x4F46;&#x662F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x81F3;&#x5C11;&#x4ED6;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x8C01;&#x52A8;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x53EF;&#x80FD;&#x67E5;&#x5904;&#x662F;&#x54EA;&#x4E2A;&#x5E10;&#x53F7;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x6CD5;&#x8FFD;&#x67E5;&#x5230;&#x6211;&#x7684;ip&#xFF0C;&#x8FD9;&#x5C31;&#x591F;&#x4E86;&#x3002;&#x90A3;&#x4E9B;&#x6240;&#x8C13;&#x7684;&#x6253;&#x626B;&#x75D5;&#x8FF9;&#x7684;&#x4E00;&#x70B9;&#x4E0D;&#x7559;&#x7684;&#x6587;&#x7AE0;&#x90FD;&#x662F;&#x9A97;&#x4EBA;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x5BF9;&#x65B9;&#x662F;&#x83DC;&#x9E1F;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x9000;&#x51FA;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7834;&#x574F;&#x7684;&#x8FF9;&#x8C61;&#xFF0C;&#x4F30;&#x8BA1;&#x4ED6;&#x4EEC;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x867D;&#x7136;&#x4F1A;&#x6000;&#x7591;&#xFF0C;&#x6700;&#x591A;&#x6539;&#x53D8;&#x5BC6;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6211;&#x5DF2;&#x7ECF;&#x4E0D;&#x9700;&#x8981;&#x4ED6;&#x4EEC;&#x7684;&#x5BC6;&#x7801;&#x4E86;&#x3002;&#x6211;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5165;&#x53E3;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x8FDB;&#x5165;&#x522B;&#x4EBA;&#x7684;server&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x4E0D;&#x53EF;&#x4E00;&#x4E16;&#xFF0C;&#x751F;&#x6015;&#x4E16;&#x754C;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4EC0;&#x4E48;&#x8FD8;&#x7ED9;&#x4EBA;&#x5BB6;&#x7CFB;&#x7EDF;&#x5B89;&#x4E2A;sniffer&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x60F3;&#x501F;&#x52A9;&#x4EBA;&#x5BB6;&#x7684;&#x673A;&#x5668;&#x641E;&#x5230;&#x66F4;&#x591A;&#x7684;&#x5BC6;&#x7801;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x8981;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x5178;&#x578B;&#x7684;&#x83DC;&#x9E1F;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x4F60;&#x771F;&#x4EE5;&#x4E3A;&#x4EBA;&#x5BB6;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x662F;&#x5403;&#x5E72;&#x996D;&#x7684;&#xFF1F;&#x4F60;&#x771F;&#x4EE5;&#x4E3A;&#x4F60;&#x5929;&#x4E0B;&#x7B2C;&#x4E00;&#xFF1F;&#x7A0D;&#x7A0D;&#x597D;&#x70B9;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x54EA;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x4E0D;&#x6BD4;&#x7F51;&#x4E0A;&#x90A3;&#x4E9B;&#x5199;&#x9ED1;&#x5BA2;&#x6559;&#x7A0B;&#x7684;&#x5BB6;&#x4F19;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#xFF1F;&#x90A3;&#x4E9B;&#x7BA1;&#x7406;&#x5458;&#x90FD;&#x662F;&#x9ED1;&#x522B;&#x4EBA;&#x7684;&#x7F51;&#x7AD9;&#x78E8;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4F60;&#x8FD9;&#x4E9B;&#x5E7C;&#x7A1A;&#x7684;&#x62DB;&#x6570;&#xFF0C;&#x4EBA;&#x5BB6;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4ED6;&#x771F;&#x7684;&#x8BE5;&#x4E0B;&#x8BFE;&#x4E86;&#x3002;&#x90A3;&#x4E9B;&#x6559;&#x7A0B;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x8DEF;&#x4EBA;&#x90FD;&#x77E5;&#x7684;&#x8FC7;&#x65F6;&#x7684;&#x62DB;&#x6570;&#x3002;&#x522B;&#x4EE5;&#x4E3A;&#x4EBA;&#x5BB6;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x90FD;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x5176;&#x5B9E;&#x4ED6;&#x4EEC;&#x76F8;&#x5F53;&#x5389;&#x5BB3;&#x3002;&#x9ED1;&#x5BA2;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x654C;&#x540E;&#x7684;&#x7279;&#x79CD;&#x5175;&#xFF0C;&#x4F60;&#x4E00;&#x66B4;&#x9732;&#xFF0C;&#x5C31;&#x6B7B;&#x5B9A;&#x3002;&#x522B;&#x542C;&#x4EC0;&#x4E48;&#x5B64;&#x5355;&#x82F1;&#x96C4;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x90A3;&#x662F;&#x5439;&#x725B;&#x7684;&#xFF01;&#x4F60;&#x7559;&#x4E0B;&#x7684;&#x4E1C;&#x897F;&#x8D8A;&#x5C11;&#x8D8A;&#x597D;&#x3002;&#x8D8A;&#x5C11;&#x5C31;&#x8D8A;&#x4E0D;&#x5BB9;&#x6613;&#x66B4;&#x9732;&#x3002;&#x800C;&#x4E14;&#x6CA1;&#x4E8B;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x8FDB;&#x53BB;&#x90FD;&#x4EE5;&#x666E;&#x901A;&#x4EBA;&#x8EAB;&#x4EFD;&#x8FDB;&#x53BB;&#x3002;&#x6211;&#x6709;&#x4E2A;&#x4E60;&#x60EF;&#xFF0C;&#x6211;&#x4E00;&#x65E6;&#x653B;&#x514B;&#x4E86;&#x67D0;&#x4E2A;server&#xFF0C;&#x4E00;&#x822C;&#x6211;&#x9000;&#x51FA;&#x4E4B;&#x540E;&#xFF0C;&#x6211;1&#x4E2A;&#x6708;&#x5185;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x518D;&#x53BB;&#x7B2C;&#x4E8C;&#x6B21;&#x3002;&#x751A;&#x81F3;&#x534A;&#x5E74;1&#x5E74;&#x90FD;&#x4E0D;&#x4F1A;&#x53BB;&#x7B2C;&#x4E8C;&#x6B21;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x8FD9;&#x662F;&#x7EDD;&#x5BF9;&#x6B63;&#x786E;&#x7684;&#x3002;&#x6211;&#x8FD8;&#x6CA1;&#x88AB;&#x53D1;&#x73B0;&#x8FC7;&#x3002;&#x5F53;&#x7136;&#x6211;&#x4E0A;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x83DC;&#x9E1F;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x88AB;&#x4EBA;&#x5BB6;&#x6293;&#x4F4F;&#x90A3;&#x662F;&#x4E0D;&#x7B97;&#x7684;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x4F60;&#x60F3;&#x554A;&#xFF0C;&#x90A3;&#x4E9B;&#x7BA1;&#x7406;&#x5458;&#x4E2A;&#x4E2A;&#x90FD;&#x662F;&#x5389;&#x5BB3;&#x7684;&#x89D2;&#x8272;&#x3002;&#x4ED6;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x4EC0;&#x4E48;&#x4E0D;&#x5BF9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x6700;&#x8FD1;&#x4E00;&#x5468;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x4E2A;&#x6708;&#x90FD;&#x4F1A;&#x5168;&#x529B;&#x76D1;&#x63A7;&#xFF0C;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x518D;&#x6B21;&#x767B;&#x9646;&#xFF0C;&#x4F60;&#x4E0D;&#x662F;&#x627E;&#x6B7B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x5389;&#x5BB3;&#xFF0C;&#x4F60;&#x518D;&#x5389;&#x5BB3;&#xFF0C;&#x4F60;&#x80FD;&#x5389;&#x5BB3;&#x8FC7;&#x4EBA;&#x5BB6;&#x5C31;&#x5750;&#x5728;server&#x9762;&#x524D;&#x64CD;&#x4F5C;&#xFF0C;&#x60F3;&#x6709;&#x4EC0;&#x4E48;&#x6743;&#x5229;&#x5C31;&#x6709;&#x4EC0;&#x4E48;&#x6743;&#x5229;&#x7684;&#x7BA1;&#x7406;&#x5458;&#xFF1F;&#x4F60;&#x4F1A;&#x5199;&#x7A0B;&#x5E8F;&#xFF1F;&#x4EBA;&#x5BB6;&#x628A;&#x7F16;&#x8BD1;&#x5668;&#x7ED9;&#x4F60;&#x5220;&#x9664;&#x4E86;&#x4F60;&#x7F16;&#x8BD1;&#x4E2A;&#x7403;&#x5440;&#xFF1F;&#x6240;&#x4EE5;&#xFF0C;&#x5F3A;&#x9F99;&#x4F60;&#x4E5F;&#x6597;&#x4E0D;&#x8FC7;&#x5730;&#x5934;&#x86C7;&#x3002;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x6211;&#x5C31;&#x662F;&#x4E0D;&#x6765;&#xFF0C;&#x4F60;&#x76D1;&#x63A7;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x6211;&#x770B;&#x4F60;&#x80FD;&#x76D1;&#x63A7;&#x591A;&#x4E45;&#x3002;&#x4EBA;&#x5C31;&#x8FD9;&#x4E2A;&#x6BDB;&#x75C5;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x4E0D;&#x4F8B;&#x5916;&#xFF0C;&#x65F6;&#x95F4;&#x4E00;&#x957F;&#xFF0C;&#x6CA1;&#x6709;&#x52A8;&#x9759;&#xFF0C;&#x5C31;&#x677E;&#x61C8;&#x4E86;&#x3002;&#x6211;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;server&#x7684;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x6211;&#x4E00;&#x6837;&#x6709;&#x8FD9;&#x4E2A;&#x6BDB;&#x75C5;&#x3002;&#x5F53;&#x6211;&#x53D1;&#x73B0;&#x6709;&#x4E0D;&#x5BF9;&#xFF0C;&#x6211;&#x7ACB;&#x523B;&#x4F1A;&#x51E0;&#x5468;&#x751A;&#x81F3;&#x4E00;&#x4E2A;&#x6708;&#x6743;&#x5229;&#x76D1;&#x63A7;&#x3002;&#x4F46;&#x662F;&#x65F6;&#x95F4;&#x4E00;&#x957F;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x6CA1;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x5C31;&#x677E;&#x61C8;&#x4E86;&#x3002;&#x662F;&#x4EBA;&#x90FD;&#x6709;&#x8FD9;&#x4E2A;&#x6BDB;&#x75C5;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x4E00;&#x4E2A;&#x9AD8;&#x624B;&#xFF0C;&#x4F60;&#x548C;&#x4ED6;&#x8BF4;&#x8BDD;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x3002;&#x6211;&#x5E38;&#x5728;&#x7F51;&#x4E0A;&#x901B;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x725B;&#x4EBA;&#x591A;&#x7684;&#x5F88;&#x3002;&#x90A3;&#x5929;&#x5230;&#x4E00;&#x4E2A;&#x8BED;&#x97F3;&#x804A;&#x5929;&#x7F51;&#x7AD9;&#x53BB;&#x89E3;&#x95F7;&#x3002;&#x521A;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x624D;3&#x5206;&#x949F;&#x4E0D;&#x5230;&#x3002;&#x4E00;&#x4E2A;&#x725B;&#x4EBA;&#x51B2;&#x8FDB;&#x6765;&#xFF0C;&#x62A2;&#x4E86;mic&#xFF0C;&#x725B;&#x6C14;&#x51B2;&#x5929;&#x7684;&#x8BF4;&#xFF1A;&#x201C;&#x623F;&#x95F4;&#x91CC;&#x7684;&#x4EBA;&#xFF0C;&#x542C;&#x7740;&#xFF0C;&#x4F60;&#x4EEC;&#x7ACB;&#x523B;&#x7ED9;&#x6211;&#x51FA;&#x53BB;&#xFF0C;&#x5426;&#x5219;&#x6211;&#x7ACB;&#x523B;&#x8E22;&#x4F60;&#x4EEC;&#x51FA;&#x53BB;&#x3002;&#x800C;&#x4E14;&#x5C01;&#x6389;&#x4F60;&#x4EEC;&#x7684;ip&#xFF0C;&#x8BA9;&#x4F60;&#x4EEC;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x4E0A;&#x7F51;&#xFF0C;&#x5FEB;&#x70B9;&#xFF01;&#x201D;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x522B;&#x8BF4;&#xFF0C;&#x8FD8;&#x771F;&#x6709;&#x4E56;&#x4E56;&#x9000;&#x51FA;&#x7684;&#x3002;&#x6211;&#x4ECE;&#x4ED6;&#x7684;&#x4F4D;&#x7F6E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4ED6;&#x4E0D;&#x662F;&#x623F;&#x4E3B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x6015;&#x3002;&#x6CA1;&#x7406;&#x4ED6;&#x3002;&#x5C31;&#x662F;&#x623F;&#x4E3B;&#xFF0C;&#x4ED6;&#x4E5F;&#x5C01;&#x4E0D;&#x6389;&#x6211;&#x7684;ip&#x3002;</p>
<p>&#x6211;&#x6CA1;&#x7406;&#x4ED6;&#xFF0C;&#x623F;&#x95F4;&#x91CC;&#x9762;&#x5C31;&#x5269;&#x4E0B;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#x4E86;&#xFF0C;&#x90A3;&#x4E2A;&#x725B;&#x4EBA;&#x7EE7;&#x7EED;&#x53EB;&#x9A82;&#xFF0C;&#x7EE7;&#x7EED;&#x5A01;&#x80C1;&#x8981;&#x5C01;&#x6211;&#x7684;ip&#x3002;&#x6211;&#x5B9E;&#x5728;&#x662F;&#x70E6;&#x4E86;&#xFF0C;&#x7ED9;&#x4ED6;&#x6253;&#x4E86;&#x5B57;&#xFF1A;&#x201C;&#x6EDA;&#xFF01;&#x83DC;&#x9E1F;&#xFF01;&#x201D;</p>
<p>&#x54C8;&#x54C8;&#xFF0C;&#x4ED6;&#x4E2A;&#x5BB6;&#x4F19;&#x53EF;&#x80FD;&#x6CA1;&#x60F3;&#x5230;&#x4F1A;&#x9047;&#x5230;&#x6BD4;&#x4ED6;&#x8FD8;&#x725B;&#x7684;&#xFF0C;&#x771F;&#x7684;&#x5C31;&#x8D70;&#x4E86;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x7B11;&#x4E86;&#x3002;</p>
<p>&#x771F;&#x6B63;&#x7684;&#x9AD8;&#x624B;&#xFF0C;&#x4ED6;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x7ED9;&#x4F60;&#x8BF4;&#x6280;&#x672F;&#x95EE;&#x9898;&#x3002;&#x9664;&#x975E;&#x9047;&#x5230;&#x4E86;&#x540C;&#x9053;&#x4E2D;&#x4EBA;&#xFF0C;&#x800C;&#x4E14;&#x786E;&#x5B9E;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x548C;&#x522B;&#x4EBA;&#x8C08;&#x8BBA;&#x9ED1;&#x5BA2;&#x95EE;&#x9898;&#x3002;&#x751A;&#x81F3;&#x8FDE;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x61D2;&#x5F97;&#x8C08;&#xFF0C;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x5C31;&#x628A;&#x81EA;&#x5DF1;&#x4F2A;&#x88C5;&#x6210;&#x4E00;&#x4E2A;&#x6B4C;&#x624B;&#xFF0C;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x5531;&#x6B4C;&#xFF0C;&#x542C;&#x6B4C;&#xFF0C;&#x95F2;&#x804A;&#x3002;&#x751F;&#x6D3B;&#x6BD5;&#x7ADF;&#x662F;&#x591A;&#x9762;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;</p>
<p>&#x9000;&#x51FA;&#x4E86;server&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x770B;&#x770B;&#x4E00;&#x4E9B;&#x4F11;&#x95F2;&#x7F51;&#x7AD9;&#x3002;&#x90A3;&#x4E2A;&#x76EE;&#x6807;&#x6210;&#x4E3A;&#x6211;&#x7684;&#x5386;&#x53F2;&#x3002;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x8BF4;&#x4E86;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x5B8C;&#x4E86;&#xFF1F;&#x5BF9;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x5B8C;&#x4E86;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x53D6;&#x5F97;&#x4E86;&#x4ED6;&#x7684;&#x63A7;&#x5236;&#x6743;&#x5229;&#xFF0C;&#x8FD8;&#x8981;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x4E0D;&#x5BF9;&#x5440;&#xFF0C;&#x8FD9;&#x662F;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x7F51;&#x7AD9;&#xFF0C;&#x600E;&#x4E48;&#x4E0D;&#x641E;&#x70B9;&#x4EC0;&#x4E48;&#x60C5;&#x62A5;&#xFF0C;&#x4EC0;&#x4E48;&#x822A;&#x7A7A;&#x6BCD;&#x8230;&#x7684;&#x8BBE;&#x8BA1;&#x56FE;&#xFF0C;&#x6216;&#x8005;&#x5BFC;&#x5F39;&#x7684;&#x8BBE;&#x8BA1;&#x56FE;&#xFF0C;&#x6216;&#x8005;&#x4F0A;&#x62C9;&#x514B;&#x6218;&#x4E89;&#x5BC6;&#x6587;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;&#x8FD9;&#x5BF9;&#x4F60;&#x4E0D;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x5417;&#xFF1F;</p>
<p>&#x54C8;&#x54C8;&#x54C8;&#xFF0C;&#x8981;&#x4E0D;&#x6211;&#x600E;&#x4E48;&#x4F1A;&#x9A82;&#x90A3;&#x4E9B;&#x5BFC;&#x6F14;&#x90FD;&#x662F;TMD&#x7684;sb&#x5462;&#xFF1F;&#x95EE;&#x9898;&#x5C31;&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x5927;&#x5BB6;&#x53D7;&#x90A3;&#x5E2E;&#x4EBA;&#x7684;&#x6BD2;&#x5BB3;&#x592A;&#x6DF1;&#x4E86;&#xFF0C;&#x8981;&#x4E0D;&#x600E;&#x4E48;&#x8BF4;&#x8C0E;&#x8BDD;&#x8BF4;&#x4E00;&#x5343;&#x6B21;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x771F;&#x7406;&#x7684;&#x5462;&#xFF1F;&#x524D;&#x4EBA;&#x7684;&#x603B;&#x7ED3;&#x771F;&#x662F;&#x7CBE;&#x8F9F;&#x5440;&#xFF01;&#x62DC;&#x6258;&#xFF0C;&#x8FD9;&#x662F;&#x7F8E;&#x519B;&#x5BF9;&#x5916;&#x516C;&#x5F00;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x90FD;&#x662F;&#x5199;&#x53EF;&#x4EE5;&#x53D1;&#x5E03;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x771F;&#x6B63;&#x653E;&#x519B;&#x4E8B;&#x8D44;&#x6599;&#x7684;&#x4E1C;&#x897F;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x5BF9;&#x5916;&#x516C;&#x5F00;&#x5462;&#xFF1F;&#x4F60;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x7684;&#x673A;&#x5BC6;&#x8D44;&#x6599;&#x4F1A;&#x4E0D;&#x4F1A;&#x653E;&#x5230;&#x5317;&#x4EAC;&#x56FE;&#x4E66;&#x9986;&#xFF1F;&#x5373;&#x4F7F;&#x6709;&#x4E25;&#x683C;&#x89C4;&#x5B9A;&#x4E0D;&#x51C6;&#x4EFB;&#x4F55;&#x4EBA;&#x501F;&#x9605;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x8BF4;&#x53EF;&#x80FD;&#x653E;&#x5230;&#x5317;&#x4EAC;&#x56FE;&#x4E66;&#x9986;&#x8FD9;&#x4E2A;&#x5927;&#x5BB6;&#x90FD;&#x53EF;&#x4EE5;&#x6765;&#x7684;&#x5730;&#x65B9;&#xFF1F;&#x663E;&#x7136;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4F60;&#x8BF4;&#x4FE1;&#x606F;&#x5316;&#x6C34;&#x5E73;&#x6700;&#x9AD8;&#x7684;&#x7F8E;&#x519B;&#x53EF;&#x80FD;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x7EDC;&#x548C;&#x6C11;&#x7528;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x5417;&#xFF1F;&#x90A3;&#x4E9B;&#x4F7F;&#x7528;&#x6C11;&#x7528;&#x7F51;&#x7EDC;&#x8FDB;&#x5165;&#x4EBA;&#x5BB6;&#x519B;&#x4E8B;&#x8981;&#x5730;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x626F;&#x6DE1;&#xFF01;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#xFF0C;&#x4EBA;&#x5BB6;&#x7EBF;&#x8DEF;&#x90FD;&#x6CA1;&#x6709;&#x7ED9;&#x4F60;&#x8FDE;&#x63A5;&#xFF0C;&#x4F60;&#x672C;&#x4E8B;&#x518D;&#x9AD8;&#xFF0C;&#x80FD;&#x8FDB;&#x5165;&#x5417;&#xFF1F;&#x3000;&#x5927; &#x5BB6;&#x662F;&#x4E0D;&#x662F;&#x4EE5;&#x4E3A;&#x7F8E;&#x56FD;&#x6CA1;&#x6709;&#x9ED1;&#x5BA2;&#xFF0C;&#x6216;&#x8005;&#x7F8E;&#x56FD;&#x519B;&#x961F;&#x4E2D;&#x4E0D;&#x77E5;&#x9053;&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x4F5C;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF1F;&#x6655;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x9ED1;&#x5BA2;&#x7684;&#x8001;&#x7956;&#x5B97;&#xFF0C;&#x597D;&#x4E0D;&#x597D;&#xFF1F;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x50BB;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x673A;&#x5BC6;&#x6570;&#x636E;&#x5E93;&#x7ED9;&#x4F60;&#x653E;&#x5230;internet&#x4E0A;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x5E10;&#x53F7;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x5730;&#x6B65;&#x5427;&#xFF1F;</p>
<p>&#x9ED1;&#x5BA2;&#x4E0D;&#x662F;&#x795E;&#xFF0C;&#x5C31;&#x662F;&#x666E;&#x901A;&#x4EBA;&#x3002;&#x5E38;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x4EBA;&#x8BF4;&#x9ED1;&#x5BA2;&#x8FDB;&#x5165;&#x67D0;&#x67D0;&#x94F6;&#x884C;&#x600E;&#x4E48;&#x600E;&#x4E48;&#x6837;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x626F;&#x6DE1;&#xFF0C;&#x9664;&#x975E;&#x662F;&#x5185;&#x90E8;&#x4EBA;&#x5458;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x5426;&#x5219;&#x66F4;&#x672C;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x4EC0;&#x4E48;&#x6539;&#x4EC0;&#x4E48;&#x5E10;&#x53F7;&#x5440;&#xFF0C;&#x7ED9;&#x91CC;&#x9762;&#x8F6C;&#x591A;&#x5C11;&#x94B1;&#x5440;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x6211;&#x5F53;&#x9ED1;&#x5BA2;&#x5C31;&#x662F;&#x5174;&#x8DA3;&#x3002;&#x6211;&#x6BCF;&#x5929;&#x8FD8;&#x662F;&#x8981;&#x4E0A;&#x73ED;&#x5403;&#x996D;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x60F3;&#x5982;&#x4F55;&#x53D1;&#x8D22;&#x3002;&#x6211;&#x4E00;&#x6837;&#x7FA1;&#x6155;&#x4EBA;&#x5BB6;&#x6709;&#x94B1;&#x6709;&#x52BF;&#x3002;&#x4F60;&#x770B;&#x8FC7;&#x6709;&#x4EBA;&#x9760;&#x9ED1;&#x5BA2;&#x6280;&#x672F;&#x8FC7;&#x7684;&#x6ECB;&#x6DA6;&#x7684;&#xFF1F;&#x6CA1;&#x6709;&#x3002;&#x6700;&#x597D;&#x7684;&#x5C31;&#x662F;&#x53BB;&#x5F53;&#x5B89;&#x5168;&#x4EBA;&#x5458;&#x548C;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x3002;</p>
<p>&#x9000;&#x51FA;&#x4E86;&#x7F8E;&#x56FD;&#x6D77;&#x519B;server&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x6708;&#x4E0D;&#x518D;&#x8BBF;&#x95EE;&#x5B83;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;5&#x70B9;&#x949F;&#x4E86;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x7761;&#x89C9;&#x4E86;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x8FD8;&#x6BD4;&#x8F83;&#x4EA2;&#x594B;&#x3002;&#x51B2;&#x51B2;&#x811A;&#xFF0C;&#x8EBA;&#x5012;&#x6211;&#x7684;&#x5355;&#x4EBA;&#x5E8A;&#x4E0A;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x5C31;&#x8FDB;&#x5165;&#x68A6;&#x4E61;&#x3002;&#x71AC;&#x591C;&#x5C31;&#x662F;&#x8FD9;&#x70B9;&#x597D;&#xFF0C;&#x51B3;&#x4E0D;&#x62C5;&#x5FC3;&#x6CA1;&#x778C;&#x7761;&#x3002;&#x8EBA;&#x5230;&#x5E8A;&#x4E0A;&#x4E0D;&#x8D85;&#x8FC7;10&#x5206;&#x949F;&#xFF0C;&#x7ACB;&#x523B;&#x7761;&#x7684;&#x548C;&#x6B7B;&#x732A;&#x4E00;&#x4E2A;&#x6837;&#x3002;</p>
<p>&#x4F9D;&#x7A00;&#x7684;&#x68A6;&#x4E2D;&#x3002;&#x3002;&#x3002;&#x3002;&#x6211;&#x597D;&#x50CF;&#x770B;&#x5230;&#x5C0F;&#x654F;&#x5728;&#x5BF9;&#x6211;&#x751C;&#x751C;&#x7684;&#x7B11;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter2.html" class="navigation navigation-prev " aria-label="Previous page: 第二章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter4.html" class="navigation navigation-next " aria-label="Next page: 第四章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章","level":"1.4","depth":1,"next":{"title":"第四章","level":"1.5","depth":1,"path":"chapter4.md","ref":"chapter4.md","articles":[]},"previous":{"title":"第二章","level":"1.3","depth":1,"path":"chapter2.md","ref":"chapter2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter3.md","mtime":"2017-02-27T04:00:47.516Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

