
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第五章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter6.html" />
    
    
    <link rel="prev" href="chapter4.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第五章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x548C;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x6218;&#x4E89;-2">&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x548C;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x6218;&#x4E89; [2]</h2>
<p>&#x8FDB;&#x5165;&#x5934;&#x513F;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x53D1;&#x73B0;&#x4ED6;&#x6B63;&#x5728;&#x684C;&#x4E0A;&#x5199;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x8BBA;&#x6587;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7684;&#x5FC3;&#x653E;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x4E00;&#x822C;&#x5934;&#x513F;&#x8981;&#x6279;&#x8BC4;&#x6211;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x76EF;&#x4F4F;&#x6211;&#x7684;&#x3002;&#x73B0;&#x5728;&#x4ED6;&#x5C45;&#x7136;&#x8FDE;&#x5934;&#x90FD;&#x6CA1;&#x62AC;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x521A;&#x624D;&#x603B;&#x90E8;&#x90A3;&#x8FB9;&#x6253;&#x7535;&#x8BDD;&#x6765;&#xFF0C;&#x53EB;&#x6211;&#x4EEC;&#x6D3E;&#x4E00;&#x4E2A;&#x89E3;&#x5BC6;&#x9AD8;&#x624B;&#x8FC7;&#x53BB;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x6CA1;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x66FF;&#x6211;&#x53BB;&#x5427;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x505A;&#x4EC0;&#x4E48;&#x5440;&#xFF0C;&#x6211;&#x53EF;&#x4E0D;&#x662F;&#x5E72;&#x89E3;&#x5BC6;&#x7684;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x8001;&#x672C;&#x884C;&#x5417;&#xFF1F;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x8FD8;&#x6CA1;&#x5B8C;&#x5462;&#xFF1F;&#x201D;&#x6211;&#x8FD8;&#x8981;&#x641E;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x5462;&#xFF0C;&#x6211;&#x60F3;&#x63A8;&#x8131;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5DE5;&#x4F5C;&#x91CF;&#x7167;&#x7B97;&#xFF0C;&#x624B;&#x5934;&#x7684;&#x5DE5;&#x4F5C;&#x653E;&#x4E0B;&#xFF0C;&#x8FD9;&#x53EF;&#x662F;&#x90E8;&#x957F;&#x4EB2;&#x81EA;&#x8981;&#x7684;&#x4EBA;&#x3002;&#x201D;&#x5934;&#x513F;&#xFF0C;&#x62AC;&#x5934;&#x7B11;&#x7740;&#x770B;&#x4E86;&#x6211;&#x4E00;&#x773C;&#xFF0C;&#x7EE7;&#x7EED;&#x8BF4;&#xFF1A;&#x201C;&#x4F30;&#x8BA1;&#x4E5F;&#x90FD;&#x662F;&#x4E9B;&#x9E21;&#x6BDB;&#x849C;&#x76AE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x673A;&#x5668;&#x88AB;&#x75C5;&#x6BD2;&#x611F;&#x67D3;&#x4E4B;&#x7C7B;&#xFF0C;&#x4F60;&#x53BB;&#x73A9;&#x73A9;&#x5427;&#x3002;&#x201D;</p>
<p>&#x5929;&#xFF0C;&#x90E8;&#x957F;&#x4EB2;&#x81EA;&#x8981;&#x7684;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E0B;&#x53EF;&#x4E0D;&#x6562;&#x63A8;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x786E;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x641E;&#x5B9E;&#x4E8B;&#x7684;&#x4EBA;&#xFF0C;&#x8FDE;&#x90E8;&#x957F;&#x4EB2;&#x81EA;&#x70B9;&#x540D;&#xFF0C;&#x90FD;&#x4E0D;&#x60F3;&#x53BB;&#x8868;&#x73B0;&#x4E00;&#x4E0B;&#xFF0C;&#x628A;&#x6211;&#x9876;&#x4E0A;&#x4E86;&#x3002;&#x6211;&#x5FC3;&#x60F3;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x4E0D;&#x662F;&#x90FD;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x90A3;&#x4E9B;&#x4EBA;&#x7684;&#x4E8B;&#x60C5;&#x5417;&#xFF0C;&#x600E;&#x4E48;&#x603B;&#x90E8;&#x53EB;&#x4E0A;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x90E8;&#x7684;&#x4EBA;&#x4E86;&#xFF1F;<br>&#x3000;&#x3000;&#x603B;&#x90E8;&#x7684;&#x529E;&#x516C;&#x6402;&#x4FEE;&#x7684;&#x5C31;&#x662F;&#x4ED6;&#x5988;&#x7684;&#x6C14;&#x6D3E;&#xFF0C;&#x8FDB;&#x53BB;&#x7684;&#x611F;&#x89C9;&#x50CF;&#x8FDB;&#x4E86;&#x661F;&#x7EA7;&#x5BBE;&#x9986;&#x3002;&#x6211;&#x76F4;&#x63A5;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x3002;&#x770B;&#x89C1;&#x80E1;&#x961F;&#x957F;&#x5C45;&#x7136;&#x4E5F;&#x5728;&#xFF0C;&#x8FD8;&#x6709;&#x8D22;&#x52A1;&#x90E8;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x6BD4;&#x8F83;&#x725B;&#x7684;&#x5BB6;&#x4F19;&#x3002;&#x9664;&#x4E86;&#x90E8;&#x957F;&#x5916;&#xFF0C;&#x90E8;&#x957F;&#x5BF9;&#x9762;&#x5C45;&#x7136;&#x8FD8;&#x5750;&#x7740;&#x4E00;&#x4E2A;&#x8B66;&#x5BDF;&#xFF0C;&#x786E;&#x5207;&#x7684;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5E74;&#x8F7B;&#xFF0C;&#x4F30;&#x8BA1;22&#x4E0A;&#x4E0B;&#x7684;&#x5973;&#x8B66;&#x5BDF;&#x3002;&#x90A3;&#x8EAB;&#x8B66;&#x670D;&#xFF0C;&#x8BA9;&#x6211;&#x611F;&#x5230;&#x5F88;&#x56F0;&#x60D1;&#xFF0C;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x8C01;&#x72AF;&#x4E8B;&#x513F;&#x4E86;&#xFF1F;<br>&#x3000;&#x3000;&#x201C;&#x662F;&#x8F6F;&#x4EF6;&#x90E8;&#x7684;&#x5417;&#xFF1F;&#x5F20;&#x535A;&#x58EB;&#x600E;&#x4E48;&#x6CA1;&#x6765;&#xFF1F;&#x201D;&#x90E8;&#x957F;&#x8BF4;&#x8BDD;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x662F;&#x5F20;&#x4E3B;&#x4EFB;&#x53EB;&#x6211;&#x6765;&#x66FF;&#x4ED6;&#x7684;&#xFF0C;&#x4ED6;&#x6709;&#x4E8B;&#xFF0C;&#x6765;&#x4E0D;&#x4E86;&#x3002;&#x201D;&#x6211;&#x8D76;&#x7D27;&#x5411;&#x90E8;&#x957F;&#x89E3;&#x91CA;&#x3002;<br>&#x3000;&#x3000;&#x90E8;&#x957F;&#x6CA1;&#x8BF4;&#x4EC0;&#x4E48; &#xFF0C;&#x5F00;&#x59CB;&#x62DB;&#x547C;&#x6211;&#x5750;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x63A5;&#x7740;&#x8BF4;&#x8BDD;&#x4E86;&#xFF1A;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x6B21;&#x53EB;&#x5927;&#x5BB6;&#x6765;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x53CB;&#x597D;&#x5355;&#x4F4D;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD9;&#x4F4D;&#x662F;&#x5E02;&#x5211;&#x8B66;&#x5927;&#x961F;&#x7684;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E00;&#x4E2A;&#x6848;&#x5B50;&#x6D89;&#x53CA;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x5BB6;&#x5E2E;&#x52A9;&#x3002;&#x5728;&#x5EA7;&#x7684;&#x5404;&#x4F4D;&#x90FD;&#x662F;&#x76F8;&#x5173;&#x90E8;&#x95E8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4F18;&#x79C0;&#x4EBA;&#x624D;&#xFF0C;&#x518D;&#x8BF4;&#x534F;&#x52A9;&#x8B66;&#x5BDF;&#xFF0C;&#x6253;&#x51FB;&#x72AF;&#x7F6A;&#xFF0C;&#x4E5F;&#x662F;&#x6BCF;&#x4E2A;&#x516C;&#x6C11;&#x5E94;&#x5C3D;&#x7684;&#x4E49;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x5728;&#x5EA7;&#x7684;&#x5404;&#x4F4D;&#x5C3D;&#x529B;&#x534F;&#x52A9;&#x6797;&#x8B66;&#x5B98;&#x628A;&#x4E8B;&#x60C5;&#x529E;&#x597D;&#x3002;&#x3002;&#x3002;&#x4E0B;&#x9762;&#x8BF7;&#x6797;&#x8B66;&#x5B98;&#x548C;&#x4F60;&#x4EEC;&#x5177;&#x4F53;&#x8C08;&#x3002;&#x201D;&#x3002;&#x505A;&#x5B98;&#x7684;&#x4EBA;&#x8BF4;&#x8BDD;&#x90FD;&#x8FD9;&#x5473;&#x9053;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x5FC3;&#x91CC;&#x7ACB;&#x523B;&#x677E;&#x5F1B;&#x4E0B;&#x6765;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x770B;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x6CA1;&#x60F3;&#x5230;&#x4ECA;&#x5929;&#x8FD8;&#x548C;&#x8B66;&#x5BDF;&#x63A5;&#x89E6;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x662F;&#x4E2A;&#x6848;&#x4EF6;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x597D;&#x73A9;&#x3002;<br>&#x3000;&#x3000;&#x90E8;&#x957F;&#x548C;&#x90A3;&#x4F4D;&#x6797;&#x8B66;&#x5B98;&#x6253;&#x4E86;&#x51E0;&#x4E2A;&#x54C8;&#x54C8;&#x540E;&#xFF0C;&#x79BB;&#x5F00;&#x4E86;&#x529E;&#x516C;&#x5BA4;&#x3002;&#x73B0;&#x5728;&#x5C4B;&#x91CC;&#x5C31;&#x6211;&#x4EEC;&#x56DB;&#x4E2A;&#x4EBA;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5750;&#x5728;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x659C;&#x5BF9;&#x9762;&#xFF0C;&#x90E8;&#x957F;&#x8D70;&#x4E86;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x6CA1;&#x538B;&#x529B;&#x4E86;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x6253;&#x91CF;&#x5979;&#x3002;&#x54C7;&#xFF0C;&#x73B0;&#x5728;&#x5973;&#x8B66;&#x5BDF;&#x7684;&#x65B0;&#x5236;&#x670D;&#x8FD8;&#x771F;&#x7684;&#x597D;&#x770B;&#x3002;&#x633A;&#x7CBE;&#x795E;&#x7684;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x4F4D;&#x6797;MM&#xFF0C;&#x600E;&#x4E48;&#x5F62;&#x5BB9;&#x5462;&#xFF0C;&#x5E94;&#x8BE5;&#x8BF4;&#x5F88;&#x201C;&#x4FCA;&#x4FCF;&#x201D;&#x3002;&#x5706;&#x5706;&#x7684;&#x8138;&#xFF0C;&#x5927;&#x5927;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x767D;&#x7699;&#x7684;&#x76AE;&#x80A4;&#xFF0C;&#x77ED;&#x53D1;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x201C;&#x4E56;&#x4E56;&#x201D;&#x578B;&#x7684;&#x3002;&#x800C;&#x4E14;&#x4E24;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x9152;&#x7A9D;&#x4E5F;&#x6EE1;&#x53EF;&#x7231;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x90E8;&#x957F;&#x8D70;&#x4E86;&#xFF0C;&#x5C31;&#x5269;&#x4E0B;&#x4E09;&#x4E2A;&#x5927;&#x8001;&#x7237;&#x4EEC;&#xFF0C;&#x90FD;&#x7B49;&#x5979;&#x8BF4;&#x8BDD;&#xFF0C;&#x5C0F;&#x6797;&#x6709;&#x70B9;&#x4E0D;&#x81EA;&#x7136;&#x4E86;&#x3002;&#x770B;&#x7684;&#x51FA;&#x6765;&#xFF0C;&#x5979;&#x5E94;&#x8BE5;&#x4E5F;&#x662F;&#x521A;&#x5E72;&#x8FD9;&#x4E2A;&#x4E0D;&#x4E45;&#x5427;&#x3002;&#x5979;&#x8FC7;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x786C;&#x7740;&#x5934;&#x76AE;&#x5F00;&#x59CB;&#x7ED9;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x60C5;&#x51B5;&#x3002;<br>&#x3000;&#x3000;&#x539F;&#x6765;&#x662F;&#x4ED6;&#x4EEC;&#x6709;&#x4E2A;&#x6848;&#x4EF6;&#x4E2D;&#xFF0C;&#x6709;&#x4E2A;&#x5ACC;&#x7591;&#x72AF;&#x59CB;&#x7EC8;&#x4E0D;&#x80AF;&#x4EA4;&#x4EE3;&#x3002;&#x800C;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x8BC1;&#x636E;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4EFD;&#x88AB;&#x52A0;&#x8FC7;&#x5BC6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6587;&#x4EF6;&#x3002;&#x8B66;&#x65B9;&#x6000;&#x7591;&#x8FD9;&#x4F4D;&#x6587;&#x4EF6;&#x91CC;&#x9762;&#x90FD;&#x662F;&#x8BC1;&#x636E;&#x3002;&#x6240;&#x4EE5;&#x60F3;&#x89E3;&#x5F00;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x662F;&#x88AB;&#x4E00;&#x4E2A;&#x4E0D;&#x77E5;&#x4ECE;&#x54EA;&#x91CC;down&#x7684;&#x4E0D;&#x51FA;&#x540D;&#x7684;&#x8F6F;&#x4EF6;&#x52A0;&#x5BC6;&#x7684;&#x3002;&#x7F51;&#x4E0A;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x89E3;&#x5BC6;&#x7A0B;&#x5E8F;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x4EBA;&#x52AA;&#x529B;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x89E3;&#x5F00;&#x3002;&#x6240;&#x4EE5;&#x53EA;&#x597D;&#x8BF7;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x4EBA;&#x5E2E;&#x5FD9;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5E94;&#x7528;&#x6C34;&#x5E73;&#x5728;&#x8FD9;&#x91CC;&#x662F;&#x51FA;&#x4E86;&#x540D;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x90FD;&#x662F;&#x201C;&#x5BA3;&#x4F20;&#x201D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x201C;&#x5439;&#x725B;&#x201D;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x53CD;&#x6B63;&#x662F;&#x52A8;&#x7528;&#x7EC4;&#x7EC7;&#x5173;&#x7CFB;&#xFF0C;&#x627E;&#x4E0A;&#x95E8;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x53E5;&#x8BDD;&#x90FD;&#x6CA1;&#x8BF4;&#x3002;&#x5076;&#x5C14;&#x770B;&#x770B;&#x6797;MM&#xFF0C;&#x518D;&#x770B;&#x770B;&#x80E1;&#x961F;&#x957F;&#x3002;&#x8FD9;&#x8F6E;&#x4E0D;&#x5230;&#x6211;&#x8BF4;&#x8BDD;&#x3002;&#x6211;&#x4E5F;&#x4E0D;&#x60F3;&#x8BF4;&#x8BDD;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F1A;&#x4E0D;&#x4F1A;&#x662F;word&#x6587;&#x4EF6;&#x52A0;&#x4E86;&#x5BC6;&#x7801;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x80FD;&#x89E3;&#x5F00;&#x3002;&#x201D; &#x80E1;&#x961F;&#x957F;&#x7EC8;&#x4E8E;&#x8BF4;&#x8BDD;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5DEE;&#x70B9;&#x7B11;&#x51FA;&#x6765;&#xFF0C;&#x9760;&#xFF0C;&#x5982;&#x679C;&#x662F;word&#xFF0C;&#x7528;&#x5F97;&#x7740;&#x5211;&#x8B66;&#x961F;&#x8FD9;&#x4E48;&#x5174;&#x5E08;&#x52A8;&#x4F17;&#xFF1F;&#x4EBA;&#x5BB6;&#x4E0D;&#x662F;&#x8BF4;&#x4E86;&#x5417;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x56FD;&#x5916;down&#x7684;&#x4E0D;&#x51FA;&#x540D;&#x7684;&#x7A0B;&#x5E8F;&#x52A0;&#x7684;&#x5BC6;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4E0D;&#x662F;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x56FD;&#x5916;&#x4E0B;&#x8F7D;&#x7684;&#x53EB;filelock&#x7684;&#x7A0B;&#x5E8F;&#x52A0;&#x7684;&#x5BC6;&#x3002;&#x201D;&#x6797;mm&#x770B;&#x6765;&#x8FD8;&#x662F;&#x884C;&#x5BB6;&#x3002;&#x4ECE;&#x5979;&#x7684;&#x773C;&#x91CC;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E1D;&#x5931;&#x671B;&#x3002;&#x5927;&#x6982;&#x5979;&#x6CA1;&#x60F3;&#x5230;&#x6211;&#x4EEC;&#x8FD9;&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x9AD8;&#x624B;&#x4F1A;&#x95EE;&#x51FA;&#x8FD9;&#x4E48;&#x5916;&#x884C;&#x7684;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x53EF;&#x4EE5;&#x5230;&#x7F51;&#x4E0A;&#x641C;&#x7D22;&#x4E00;&#x4E0B;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x6709;&#x89E3;&#x5BC6;&#x7A0B;&#x5E8F;&#x3002;&#x201D;&#x80E1;&#x961F;&#x957F;&#x7EE7;&#x7EED;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6CA1;&#x627E;&#x5230;&#x3002;&#x201D;&#x5979;&#x505C;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x8865;&#x5145;&#x5230;&#xFF1A;&#x201C;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x975E;&#x5E38;&#x4E0D;&#x51FA;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8054;&#x7CFB;&#x5230;&#x4F5C;&#x8005;&#xFF0C;&#x800C;&#x4E14;&#x7F51;&#x4E0A;&#x4E00;&#x822C;&#x5F88;&#x5C11;&#x4EBA;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5BF9;&#x5B83;&#x7684;&#x7834;&#x5BC6;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x6CA1;&#x6709;&#x5427;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x4EE5;&#x60F3;&#x50CF;&#xFF0C;&#x4ED6;&#x4EEC;&#x5211;&#x8B66;&#x961F;&#x5DF2;&#x7ECF;&#x7ECF;&#x8FC7;&#x4E86;&#x4E0D;&#x5C11;&#x7684;&#x82E6;&#x6218;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x5BF9;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x9006;&#x5411;&#x5DE5;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x597D;&#x50CF;&#x52A0;&#x8FC7;&#x5BC6;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x529E;&#x6CD5;&#x8BFB;&#x61C2;&#x5B83;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8DDF;&#x8E2A;&#x4E5F;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x201D;&#x6797;MM&#x73B0;&#x5728;&#x597D;&#x50CF;&#x6BD4;&#x8F83;&#x81EA;&#x4FE1;&#x4E86;&#xFF0C;&#x5927;&#x6982;&#x770B;&#x51FA;&#x6211;&#x4EEC;&#x7684;&#x80E1;&#x961F;&#x957F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x5427;&#x3002;<br>&#x3000;&#x3000;&#x8D22;&#x52A1;&#x5904;&#x90A3;&#x4E2A;&#x54E5;&#x4EEC;&#x4E00;&#x53E5;&#x8BDD;&#x4E5F;&#x6CA1;&#x6709;&#x8BF4;&#xFF0C;&#x6211;&#x4F30;&#x8BA1;&#x4ED6;&#x542C;&#x61C2;&#x6CA1;&#x6709;&#x90FD;&#x96BE;&#x8BF4;&#xFF0C;&#x4ED6;&#x662F;&#x771F;&#x4E0D;&#x6562;&#x8BF4;&#x8BDD;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x662F;&#x4E0D;&#x60F3;&#x8BF4;&#x8BDD;&#xFF0C;&#x6211;&#x60F3;&#x770B;&#x770B;&#x80E1;&#x961F;&#x957F;&#x5230;&#x5E95;&#x6709;&#x51E0;&#x628A;&#x5237;&#x5B50;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x80E1;&#x961F;&#x957F;&#x4E5F;&#x770B;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4F4D;&#x6797;&#x8B66;&#x5B98;&#x4E0D;&#x662F;&#x5916;&#x884C;&#x3002;&#x8BF4;&#x4E0D;&#x5B9A;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x8B66;&#x961F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x9AD8;&#x624B;&#x3002;&#x8C01;&#x4E5F;&#x4E0D;&#x6BD4;&#x8C01;&#x50BB;&#x591A;&#x5C11;&#x3002;&#x5BF9;&#x5185;&#x884C;&#xFF0C;&#x9760;&#x8BF4;&#x7A7A;&#x8BDD;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x9014;&#x4E86;&#x3002;&#x4ED6;&#x5BF9;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#x518D;&#x719F;&#x6089;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x6211;&#x6562;&#x8BF4;&#x4ED6;&#x662F;&#x4E2A;&#x5916;&#x884C;&#x3002;&#x56E0;&#x4E3A;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x6280;&#x672F;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x7684;&#x5B66;&#x4E60;&#x662F;&#x5F88;&#x96BE;&#x638C;&#x63E1;&#x7684;&#x3002;&#x80E1;&#x961F;&#x957F;&#x4E00;&#x4E2A;&#x641E;&#x5316;&#x5B66;&#x7684;&#x534A;&#x8DEF;&#x51FA;&#x5BB6;&#xFF0C;&#x6574;&#x5929;&#x90FD;&#x641E;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#x53BB;&#x4E86;&#xFF0C;&#x54EA;&#x6709;&#x65F6;&#x95F4;&#x53BB;&#x7814;&#x7A76;&#x8FD9;&#x4E9B;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#x4ED6;&#x662F;&#x5916;&#x884C;&#x7EDD;&#x5BF9;&#x4E0D;&#x8FC7;&#x5206;&#x3002;&#x81F3;&#x4E8E;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x90A3;&#x4F4D;&#x54E5;&#x4EEC;&#xFF0C;&#x8FD9;&#x53EF;&#x548C;&#x6CE8;&#x518C;&#x8868;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x6000;&#x7591;&#x4ED6;&#x538B;&#x6839;&#x5C31;&#x6CA1;&#x6709;&#x542C;&#x61C2;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x90A3;&#x5C31;&#x6CA1;&#x529E;&#x6CD5;&#x4E86;&#xFF0C;&#x8C01;&#x77E5;&#x9053;&#x4ED6;&#x7528;&#x4E86;&#x4EC0;&#x4E48;&#x9B3C;&#x529E;&#x6CD5;&#x52A0;&#x7684;&#x5BC6;&#xFF1F;&#x85CF;&#x4E1C;&#x897F;&#x5BB9;&#x6613;&#xFF0C;&#x627E;&#x4E1C;&#x897F;&#x96BE;&#x5566;&#x3002;&#x201D;&#x80E1;&#x961F;&#x957F;&#x5F00;&#x59CB;&#x8981;&#x6253;&#x9000;&#x5802;&#x9F13;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x662F;&#x5440;&#x3002;&#x201D;&#x6797;MM&#x6577;&#x884D;&#x7684;&#x7B11;&#x7B11;&#x3002;&#x6709;&#x4E9B;&#x5931;&#x671B;&#x4E86;&#x3002;&#x7136;&#x540E;&#x4F8B;&#x884C;&#x516C;&#x4E8B;&#x5730;&#x8BF4;&#xFF1A;&#x201C;&#x5176;&#x4ED6;&#x4E24;&#x4F4D;&#x540C;&#x5FD7;&#x6709;&#x6CA1;&#x6709;&#x597D;&#x65B9;&#x6CD5;&#xFF1F;&#x201D;&#x5979;&#x7684;&#x76EE;&#x5149;&#x626B;&#x7740;&#x6211;&#x4EEC;&#x3002;<br>&#x3000;&#x3000;&#x8D22;&#x52A1;&#x5904;&#x90A3;&#x4F4D;&#x54E5;&#x4EEC;&#x5C34;&#x5C2C;&#x7684;&#x7B11;&#x7B11;&#x201C;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x786E;&#x5B9E;&#x56F0;&#x96BE;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x6797;MM&#x628A;&#x76EE;&#x5149;&#x505C;&#x5728;&#x6211;&#x7684;&#x8138;&#x4E0A;&#xFF0C;&#x8BE2;&#x95EE;&#x7684;&#x671B;&#x7740;&#x6211;&#x3002;&#x624B;&#x91CC;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x6536;&#x62FE;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;&#x770B;&#x6765;&#x51C6;&#x5907;&#x8D70;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4EEC;&#x80FD;&#x63D0;&#x4F9B;&#x90A3;&#x4E2A;filelock&#x8F6F;&#x4EF6;&#x5417;&#xFF1F;&#x201D;&#x6211;&#x5F00;&#x53E3;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x6797;MM&#x7684;&#x773C;&#x775B;&#x4E00;&#x4EAE;&#xFF0C;&#x4E0D;&#x8FED;&#x7684;&#x56DE;&#x7B54;&#x201C;&#x80FD;&#x80FD;&#xFF0C;&#x5F53;&#x7136;&#x80FD;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x5C31;&#x662F;&#x5206;&#x6790;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5E2E;&#x6211;&#x4EEC;&#x5206;&#x6790;&#x5417;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x61C2;&#xFF0C;&#x6BD4;&#x4F60;&#x4EEC;&#x5211;&#x8B66;&#x961F;&#x7684;&#x9AD8;&#x624B;&#x5DEE;&#x8FDC;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x4EEC;&#x770B;&#x4E00;&#x770B;&#xFF0C;&#x778E;&#x732B;&#x78B0;&#x7740;&#x6B7B;&#x8017;&#x5B50;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x96BE;&#x8BF4;&#x3002;&#x54C8;&#x54C8;&#x3002;&#x201D;&#x80E1;&#x961F;&#x957F;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8BDD;&#x4E0D;&#x80FD;&#x8BF4;&#x7684;&#x592A;&#x6EE1;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x65E5;&#x5B50;&#x4E0D;&#x597D;&#x8FC7;&#xFF0C;&#x7B49;&#x6211;&#x62FF;&#x5230;&#x4F60;&#x8DEF;&#x7531;&#x5668;&#x5BC6;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x624D;&#x4E0D;&#x6015;&#x4F60;&#x5462;&#x3002;<br>&#x3000;&#x3000;&#x6797;MM&#x8138;&#x4E0A;&#x9732;&#x51FA;&#x4E86;&#x7B11;&#x5BB9;&#x3002;&#x5176;&#x5B9E;&#x5979;&#x4E5F;&#x662F;&#x5E74;&#x8F7B;&#x4EBA;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#x5DE5;&#x4F5C;&#x5173;&#x7CFB;&#xFF0C;&#x6545;&#x610F;&#x641E;&#x7684;&#x6BD4;&#x8F83;&#x4E25;&#x8083;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x8FD9;&#x4E48;&#x4E00;&#x8BF4;&#xFF0C;&#x5979;&#x4E5F;&#x677E;&#x5F1B;&#x4E0B;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5BF9;&#x5BF9;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5C0F;&#x738B;&#x78B0;&#x78B0;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x80FD;&#x78B0;&#x51FA;&#x6765;&#x3002;&#x201D;&#x80E1;&#x961F;&#x957F;&#x6545;&#x610F;&#x628A;&#x78B0;&#x5B57;&#x8BF4;&#x7684;&#x5F88;&#x91CD;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5475;&#x5475;&#x7684;&#x50BB;&#x7B11;&#x7740;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x54C8;&#x54C8;&#x7B11;&#x7740;&#xFF0C;&#x8D70;&#x51FA;&#x529E;&#x516C;&#x5BA4;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x80E1;&#x961F;&#x957F;&#x8138;&#x4E0A;&#x7684;&#x4E00;&#x4E1D;&#x4E0D;&#x60A6;&#xFF0C;&#x5C3D;&#x7BA1;&#x4ED6;&#x5728;&#x7B11;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x7F51;&#x7EDC;&#x80AF;&#x5B9A;&#x53C8;&#x8981;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x641E;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x5FC5;&#x987B;&#x8D76;&#x5FEB;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6162;&#x817E;&#x817E;&#x7684;&#x8D70;&#x51FA;&#x603B;&#x90E8;&#x7684;&#x5927;&#x697C;&#x3002;&#x6B63;&#x5728;&#x8003;&#x8651;&#x5982;&#x4F55;&#x641E;&#x80E1;&#x961F;&#x957F;&#x7684;&#x5BC6;&#x7801;&#x3002;<br>&#x3000;&#x3000;&#x521A;&#x51FA;&#x5927;&#x95E8;&#xFF0C;&#x542C;&#x89C1;&#x6709;&#x4EBA;&#x558A;&#xFF1A;&#x201C;&#x5509;&#xFF5E;&#xFF5E;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x770B;&#xFF0C;&#x4E00;&#x8F86;&#x767D;&#x8272;&#x6851;&#x5854;&#x7EB3;&#x8B66;&#x8F66;&#xFF0C;&#x91CC;&#x9762;&#x4E00;&#x4E2A;&#x5973;&#x8B66;&#x5BDF;&#x5BF9;&#x6211;&#x5927;&#x53EB;&#x3002;&#x4E0D;&#x5C31;&#x662F;&#x521A;&#x624D;&#x90A3;&#x4E2A;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x5417;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x53EB;&#x6211;&#x5417;&#xFF1F;&#x6211;&#x4E0D;&#x59D3;&#x5509;&#xFF0C;&#x6211;&#x59D3;&#x738B;&#x3002;&#x201D;&#x6211;&#x8D70;&#x8FC7;&#x53BB;&#xFF0C;&#x201C;&#x4F60;&#x8FD8;&#x6CA1;&#x8D70;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x7B49;&#x4F60;&#x5417;&#xFF1F;&#x4F60;&#x5230;&#x54EA;&#x91CC;&#xFF0C;&#x6211;&#x9001;&#x4F60;&#x5427;&#x3002;&#x201D;&#x6797;MM&#x6709;&#x70B9;&#x817C;&#x8146;&#x7684;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x5C31;&#x4F4F;&#x57CE;&#x5317;&#xFF0C;&#x4E0D;&#x8FDC;&#xFF0C;3&#x7AD9;&#x8DEF;&#x3002;&#x201D;&#x6211;&#x5927;&#x65B9;&#x7684;&#x62C9;&#x5F00;&#x8F66;&#x95E8;&#xFF0C;&#x5750;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x5979;&#x7684;&#x65C1;&#x8FB9;&#x3002;&#x201C;&#x8D70;&#x5427;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x8B66;&#x8F66;&#x5F00;&#x52A8;&#x4E86;&#x3002;&#x8FD9;&#x8F88;&#x5B50;&#x6851;&#x5854;&#x7EB3;&#x5750;&#x7684;&#x591A;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6234;&#x8B66;&#x706F;&#x7684;&#x8FD8;&#x771F;&#x662F;&#x5934;&#x4E00;&#x56DE;&#x3002;&#x611F;&#x89C9;&#x771F;&#x662F;&#x6709;&#x70B9;&#x602A;&#x602A;&#x7684;&#x3002;&#x8F66;&#x5B50;&#x5F00;&#x52A8;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x5E2E;&#x6211;&#x4EEC;&#x7834;&#x8BD1;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E9B;&#x4EC0;&#x4E48;&#x6761;&#x4EF6;&#x548C;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C3D;&#x91CF;&#x63D0;&#x4F9B;&#x3002;&#x201D;&#x539F;&#x6765;&#x5979;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x5FD8;&#x8BB0;&#x5979;&#x7684;&#x5DE5;&#x4F5C;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x662F;&#x5B66;&#x4EC0;&#x4E48;&#x4E13;&#x4E1A;&#x7684;&#xFF1F;&#x4E0D;&#x4F1A;&#x662F;&#x5211;&#x4FA6;&#x5427;&#xFF1F;&#x201D;&#x6211;&#x95EE;&#x3002;<br>&#x3000;&#x3000; &#x5979;&#x4E00;&#x6123;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x731C;&#x5462;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x89C9;&#x5F97;&#x4F60;&#x7EDD;&#x5BF9;&#x662F;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x4E0D;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#x662F;&#x3002;&#x4F60;&#x8BF4;&#x5BF9;&#x4E0D;&#x5BF9;&#x5427;&#xFF1F;&#x201D;&#x8FD9;&#x4E2A;&#x5012;&#x4E0D;&#x662F;&#x4E71;&#x8BF4;&#x7684;&#x3002;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x9047;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x51E0;&#x53E5;&#x8BDD;&#x53EF;&#x80FD;&#x5C31;&#x80FD;&#x611F;&#x89C9;&#x51FA;&#x6765;&#x3002;&#x771F;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x7B11;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x8BF4;&#x8BDD;&#x3002;&#x6211;&#x60F3;&#x6211;&#x662F;&#x731C;&#x5BF9;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x73B0;&#x5728;&#x8BF4;&#x8BDD;&#x968F;&#x4FBF;&#x591A;&#x4E86;&#x3002;&#x201C;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x7834;&#x8BD1;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF1F;&#x201D;&#x4E24;&#x4E2A;&#x641E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x8BF4;&#x8BDD;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x8BF4;&#x5E9F;&#x8BDD;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x8DDF;&#x8E2A;&#x8FC7;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x611F;&#x89C9;&#x5982;&#x4F55;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x6709;&#x70B9;&#x96BE;&#xFF0C;&#x4ED6;&#x505A;&#x8FC7;&#x52A0;&#x5BC6;&#xFF0C;&#x8FD8;&#x6709;&#x53CD;&#x52A8;&#x6001;&#x8DDF;&#x8E2A;&#x3002;&#x6211;&#x8DDF;&#x4E86;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x5B9E;&#x5728;&#x8DDF;&#x4E0D;&#x4E0B;&#x53BB;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x770B;&#x5230;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x7B97;&#x6CD5;&#x4E86;&#x5417;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5509;&#xFF0C;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x5440;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5176;&#x5B9E;&#xFF0C;&#x52A8;&#x6001;&#x53CD;&#x8DDF;&#x8E2A;&#x8FD9;&#x4E9B;&#xFF0C;&#x5012;&#x662F;&#x8FD8;&#x597D;&#x529E;&#x3002;&#x5C31;&#x6015;&#x6700;&#x540E;&#x8DDF;&#x51FA;&#x6765;&#xFF0C;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x901A;&#x7528;&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x5C31;&#x9EBB;&#x70E6;&#x4E86;&#x3002;&#x80FD;&#x4E0D;&#x80FD;&#x7834;&#x8BD1;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x770B;&#x8FD0;&#x6C14;&#x4E86;&#x3002;&#x201D;&#x5927;&#x6982;&#x770B;&#x6211;&#x8BF4;&#x7684;&#x4E1C;&#x897F;&#x786E;&#x5B9E;&#x662F;&#x6BD4;&#x8F83;&#x5185;&#x884C;&#xFF0C;&#x73B0;&#x5728;&#x5979;&#x5B8C;&#x5168;&#x76F8;&#x4FE1;&#x6211;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x5F00;&#x59CB;&#x628A;&#x5E0C;&#x671B;&#x5BC4;&#x6258;&#x5728;&#x6211;&#x8EAB;&#x4E0A;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4E00;&#x5B9A;&#x8981;&#x5E2E;&#x5E2E;&#x5FD9;&#xFF0C;&#x8FD9;&#x4E2A;&#x6848;&#x4EF6;&#x5BF9;&#x6211;&#x4EEC;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x4E2A;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x5440;&#xFF0C;&#x6211;&#x6162;&#x6162;&#x8BD5;&#x8BD5;&#x770B;&#x5427;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x5F88;&#x5FEB;&#x5C31;&#x5230;&#x6211;&#x5BBF;&#x820D;&#x95E8;&#x524D;&#x4E86;&#xFF0C;&#x6211;&#x4E0B;&#x8F66;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5F88;&#x9AD8;&#x5174;&#x8BA4;&#x8BC6;&#x4F60;&#xFF0C;&#x6211;&#x53EB;&#x6797;&#x7D2B;&#x5AE3;&#x3002;&#x4F60;&#x53EB;&#x4EC0;&#x4E48;&#xFF0C;&#x80FD;&#x7ED9;&#x4E2A;email&#x6216;&#x8005;QQ&#x4EC0;&#x4E48;&#x7684;&#xFF1F;&#x6211;&#x628A;&#x7A0B;&#x5E8F;&#x53D1;&#x7ED9;&#x4F60;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x544A;&#x8BC9;&#x4E86;&#x5979;&#x7684;&#x6211;&#x7684;&#x540D;&#x5B57;&#x8FD8;&#x6709;&#x6211;&#x7684;&#x7535;&#x8BDD;&#xFF0C;&#x4EE5;&#x53CA;email&#x548C;QQ&#x3002;&#x5BA2;&#x5957;&#x5730;&#x8BF4;&#xFF1A;&#x201C;&#x8981;&#x4E0D;&#x4E0A;&#x53BB;&#x5750;&#x5750;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x4E0B;&#x6B21;&#x5427;&#xFF0C;bye&#x3002;&#x201D;&#x5979;&#x7684;&#x8F66;&#x5DF2;&#x7ECF;&#x5F00;&#x52A8;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x665A;&#x4E0A;&#x4E0A;&#x7F51;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53D1;&#x73B0;QQ&#x4E0A;&#x5DF2;&#x7ECF;&#x6709;&#x4EBA;&#x8BF7;&#x6C42;&#x52A0;&#x4E3A;&#x597D;&#x53CB;&#x4E86;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x4E00;&#x770B;&#xFF0C;&#x7F51;&#x540D;&#x53EB;&#x82E5;&#x70DF;&#x3002;&#x53EF;&#x80FD;&#x662F;&#x6797;&#x8B66;&#x5B98;&#x5427;&#x3002;&#x540C;&#x610F;&#x52A0;&#x4E3A;&#x597D;&#x53CB;&#x4E4B;&#x540E;&#xFF0C;&#x4E00;&#x95EE;&#xFF0C;&#x679C;&#x7136;&#x662F;&#x5979;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x628A;&#x90A3;&#x4E2A;filelock&#x7A0B;&#x5E8F;&#x7ED9;&#x53D1;&#x8FC7;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6536;&#x4E86;&#x3002;&#x7A0B;&#x5E8F;&#x5F88;&#x5C0F;&#xFF0C;100k&#x4E0D;&#x5230;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7A97;&#x53E3;&#x754C;&#x9762;&#x3002;&#x6211;&#x4E00;&#x8FB9;&#x548C;&#x5979;&#x804A;&#x7740;&#x5929;&#xFF0C;&#x4E00;&#x8FB9;&#x8C03;&#x51FA;softice&#x5F00;&#x59CB;&#x8DDF;&#x8E2A;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5176;&#x5B83;&#x4E0D;&#x6562;&#x8BF4;&#xFF0C;&#x4F46;&#x662F;&#x8DDF;&#x8E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x89E3;&#x5BC6;&#x52A0;&#x5BC6;&#x8FD8;&#x771F;&#x662F;&#x6211;&#x7684;&#x5F3A;&#x9879;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x7684;&#x9EC4;&#x91D1;&#x65F6;&#x4EE3;&#x5E94;&#x8BE5;&#x662F;&#x4F7F;&#x7528;dos&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x5C31;&#x662F;&#x9AD8;&#x624B;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#x5440;&#x3002; &#x90A3;&#x4E2A;&#x65F6;&#x4EE3;&#xFF0C;&#x65E0;&#x6570;&#x7684;&#x9AD8;&#x624B;&#x6295;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x7684;&#x6218;&#x573A;&#x4E0A;&#x6765;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x65E0;&#x8BBA;&#x52A0;&#x5BC6;&#x8FD8;&#x662F;&#x89E3;&#x5BC6;&#xFF0C;&#x60F3;&#x51FA;&#x6765;&#x7684;&#x529E;&#x6CD5;&#x90A3;&#x624D;&#x771F;&#x662F;&#x53EB;&#x7EDD;&#x5440;&#x3002;&#x73B0;&#x5728;windows&#x4E0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5927;&#x4E86;&#xFF0C;&#x8DDF;&#x8E2A;&#x7A0B;&#x5E8F;&#x6108;&#x53D1;&#x56F0;&#x96BE;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x9632;&#x76D7;&#x7248;&#x7684;&#x601D;&#x60F3;&#x4ECE;&#x6280;&#x672F;&#x5C42;&#x6B21;&#x53D1;&#x5C55;&#x5230;&#x4E86;&#x6CD5;&#x5F8B;&#x5C42;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x5C31;&#x5F31;&#x5316;&#x4E86;&#x3002;&#x52A0;&#x4E0A;&#x7F51;&#x7EDC;&#x7684;&#x6D41;&#x884C;&#xFF0C;&#x9AD8;&#x624B;&#x4EEC;&#x51E0;&#x4E4E;&#x90FD;&#x628A;&#x6CE8;&#x610F;&#x529B;&#x8F6C;&#x5411;&#x4E86;&#x7F51;&#x7EDC;&#x7A0B;&#x5E8F;&#x7684;&#x653B;&#x51FB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7684;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x529F;&#x5E95;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x65F6;&#x4EE3;&#x7EC3;&#x5C31;&#x7684;&#x3002;&#x5F53;&#x65F6;&#x89E3;&#x5BC6;kv300&#x7684;&#x94A5;&#x5319;&#x76D8;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x7684;&#x5165;&#x95E8;&#x8BFE;&#x7A0B;&#xFF0C;debug&#x5C31;&#x662F;&#x6211;&#x7684;&#x6700;&#x7231;&#x5440;&#x3002;&#x540E;&#x6765;&#x7855;&#x58EB;&#x6BD5;&#x4E1A;&#x8BBA;&#x6587;&#xFF0C;&#x6211;&#x7684;&#x8BFE;&#x9898;&#x5C31;&#x662F;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x6280;&#x672F;&#x63A2;&#x8BA8;&#x3002;&#x5F53;&#x65F6;&#x63D0;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x4E07;&#x80FD;&#x89E3;&#x5BC6;&#x6280;&#x672F;&#x5728;&#x56FD;&#x5185;&#x4E5F;&#x662F;&#x9996;&#x521B;&#x5440;&#x3002;&#x6211;&#x7684;&#x5BFC;&#x5E08;&#x90FD;&#x4F69;&#x670D;&#x7684;&#x4E0D;&#x884C;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#xFF0C;&#x8DDF;&#x8E2A;&#x7A0B;&#x5E8F;&#x4ECD;&#x7136;&#x662F;&#x975E;&#x5E38;&#x8270;&#x82E6;&#x7684;&#x3002;&#x4F60;&#x4E0D;&#x8981;&#x76F8;&#x4FE1;&#x6709;&#x4E9B;&#x4EBA;&#x5439;&#x725B;&#xFF0C;&#x8BF4;&#x81EA;&#x5DF1;&#x4E00;&#x665A;&#x4E0A;&#x5C31;&#x628A;&#x4E00;&#x4E2A;&#x51E0;&#x767E;k&#x7684;&#x7A0B;&#x5E8F;&#x8BFB;&#x61C2;&#x4E86;&#x3002;&#x8FD8;&#x7834;&#x89E3;&#x4E86;&#x3002;&#x7EDD;&#x5BF9;&#x662F;&#x5439;&#x725B;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8DDF;&#x4E86;&#x4E00;&#x6BB5;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x5F88;&#x987A;&#x5229;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5FEB;&#x5C31;&#x9677;&#x5165;&#x50F5;&#x5C40;&#x4E86;&#x3002;&#x770B;&#x6765;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x91C7;&#x7528;&#x8FC7;&#x53CD;&#x52A8;&#x6001;&#x8DDF;&#x8E2A;&#x6280;&#x672F;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x6709;&#x5E95;&#x4E86;&#x3002;&#x5BF9;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x662F;&#x666E;&#x901A;&#x7A0B;&#x5E8F;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x6162;&#x6162;&#x6765;&#x3002;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x65E2;&#x7136;&#x5199;&#x52A0;&#x5BC6;&#x7A0B;&#x5E8F;&#xFF0C;&#x5BF9;&#x89E3;&#x5BC6;&#x7EDD;&#x5BF9;&#x4E5F;&#x4E0D;&#x662F;&#x83DC;&#x9E1F;&#x3002;&#x89E3;&#x5BC6;&#x7684;&#x90A3;&#x4E9B;&#x62DB;&#x6570;&#xFF0C;&#x4ED6;&#x4F1A;&#x4E0D;&#x77E5;&#x9053;&#xFF1F;&#x53CD;&#x8DDF;&#x8E2A;&#xFF0C;&#x9996;&#x5148;&#x5C31;&#x662F;&#x53CD;&#x9759;&#x6001;&#x6C47;&#x7F16;&#x3002;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x662F;&#x52A0;&#x5BC6;&#x8005;&#x6240;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x5C31;&#x662F;&#x8BA9;&#x4F60;&#x53CD;&#x6C47;&#x7F16;&#x51FA;&#x6765;&#x7684;&#x7A0B;&#x5E8F;&#x4F60;&#x65E0;&#x6CD5;&#x8BFB;&#x61C2;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x7834;&#x8BD1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x7BA1;&#x4F60;&#x5982;&#x4F55;&#x53D8;&#x6362;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x6B63;&#x786E;&#x6267;&#x884C;&#x3002;&#x4F46;&#x662F;&#x8BA9;&#x4F60;&#x65E0;&#x6CD5;&#x8BFB;&#x61C2;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53C8;&#x80FD;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x662F;&#x5BB9;&#x6613;&#x529E;&#x5230;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x7ED9;&#x4F60;&#x52A0;&#x4E2A;1000&#x4E2A;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x5FAA;&#x73AF;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x80FD;&#x6267;&#x884C;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x80FD;&#x8BFB;&#x61C2;&#x5417;&#xFF1F;&#x4F60;&#x4E0D;&#x6267;&#x884C;&#x8FD8;&#x4E0D;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5FC5;&#x987B;&#x8981;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;1000&#x4E2A;&#x5FAA;&#x73AF;&#x6765;&#x89E3;&#x5BC6;&#x3002;&#x4F60;&#x52A8;&#x6001;&#x8DDF;&#x8E2A;&#xFF0C;&#x4ED6;&#x7ED9;&#x4F60;&#x52A0;&#x5165;&#x4E00;&#x4E9B;&#x53CD;&#x8DDF;&#x8E2A;&#x63AA;&#x65BD;&#xFF0C;&#x6BD4;&#x5982;&#x770B;&#x5185;&#x5B58;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x7ACB;&#x523B;&#x62D2;&#x7EDD;&#x6267;&#x884C;&#x3002;&#x751A;&#x81F3;&#x8BA9;&#x4F60;&#x7684;debug&#x6B7B;&#x673A;&#x3002;&#x751A;&#x81F3;&#x66F4;&#x7EDD;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x6765;&#x770B;&#x662F;&#x5426;&#x8DDF;&#x8E2A;&#xFF0C;&#x4F60;&#x5982;&#x679C;&#x8DDF;&#x8E2A;&#xFF0C;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x80AF;&#x5B9A;&#x957F;&#xFF0C;&#x76F4;&#x63A5;&#x8FDE;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x4F60;&#x80AF;&#x5B9A;&#x77ED;&#x7684;&#x591A;&#x7684;&#x591A;&#x3002;&#x5F53;&#x65F6;&#x90A3;&#x5E2E;&#x9AD8;&#x624B;&#x4EEC;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x5D07;&#x62DC;&#x7684;&#x5076;&#x50CF;&#xFF0C;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x90FD;&#x662F;IT&#x754C;&#x7684;&#x98CE;&#x4E91;&#x4EBA;&#x7269;&#x4E86;&#x3002; &#x800C;&#x4E14;&#x540E;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x91CD;&#x65B0;&#x52A0;&#x8FC7;&#x5BC6;&#x7684;&#xFF0C;&#x6267;&#x884C;&#x4E00;&#x6BB5;&#xFF0C;&#x89E3;&#x5BC6;&#x4E00;&#x6BB5;&#x3002;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x57FA;&#x672C;&#x5C31;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5F88;&#x5C11;&#x7684;&#x660E;&#x6587;&#xFF0C;&#x5168;&#x662F;&#x5BC6;&#x6587;&#x3002;&#x8981;&#x5BF9;&#x4ED8;&#x5F53;&#x65F6;&#x90A3;&#x5E2E;&#x9AD8;&#x624B;&#xFF0C;&#x624D;&#x662F;&#x771F;&#x7684;&#x96BE;&#x5440;&#xFF01;<br>&#x3000;&#x3000;&#x6211;&#x8DDF;&#x8E2A;&#x4E86;&#x4E00;&#x9635;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002;&#x4ED6;&#x7684;&#x52A0;&#x5BC6;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x7684;&#x53CD;&#x590D;&#x53D8;&#x6362;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x9996;&#x5148;&#x5C31;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x8FDB;&#x884C;&#x4E86;&#x591A;&#x6B21;&#x53D8;&#x6362;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8BF4;&#x7684;&#x52A0;&#x58F3;&#x3002;&#x800C;&#x4E14;&#x4ED6;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x73B0;&#x5728;&#x6D41;&#x884C;&#x7684;&#x4EC0;&#x4E48;arj&#xFF0C;&#x4EC0;&#x4E48;zip&#x52A0;&#x7684;&#x58F3;&#x3002;&#x800C;&#x662F;&#x81EA;&#x5DF1;&#x6574;&#x7684;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x52A0;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E00;&#x5171;&#x4F7F;&#x7528;&#x4E86;3&#x79CD;&#x53D8;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x52A0;&#x4E86;3&#x5C42;&#x5916;&#x58F3;&#x3002;&#x8FD9;&#x4E9B;&#x65E9;&#x5728;&#x6211;&#x7684;&#x9884;&#x60F3;&#x4E4B;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5F88;&#x5FEB;&#x5C31;&#x628A;&#x4ED6;&#x7684;&#x4E09;&#x4E2A;&#x5916;&#x58F3;&#x8131;&#x6389;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x5185;&#x5B58;&#x5C31;&#x51FA;&#x73B0;&#x4ED6;&#x7684;&#x539F;&#x59CB;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x4E8B;&#x60C5;&#x6CA1;&#x6709;&#x5B8C;&#xFF0C;&#x4ED6;&#x91C7;&#x7528;&#x4E86;&#x9690;&#x542B;&#x8C03;&#x7528;&#x65B9;&#x5F0F;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5F53;&#x8C03;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x662F;&#x4F7F;&#x7528;call&#x6216;&#x8005;jmp&#x7B49;&#x6307;&#x4EE4;&#x3002;&#x800C;&#x662F;&#x62FC;&#x547D;&#x5F80;&#x5806;&#x6808;&#x538B;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x5F39;&#x51FA;&#x6570;&#x636E;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x662F;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6839;&#x672C;&#x5C31;&#x662F;&#x9EBB;&#x75F9;&#x4F60;&#x7684;&#x3002;&#x7B49;&#x4F60;&#x5373;&#x4F7F;&#x662F;&#x5B59;&#x609F;&#x7A7A;&#x7684;&#x8111;&#x888B;&#x4E5F;&#x8BE5;&#x660F;&#x4E86;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x624D;&#x628A;&#x6B63;&#x786E;&#x5730;&#x5740;&#x538B;&#x5165;&#xFF0C;&#x4F7F;&#x7528;ret&#x6307;&#x4EE4;&#x5C31;&#x8F6C;&#x79FB;&#x4E86;&#x3002;&#x4F60;&#x6839;&#x672C;&#x5C31;&#x770B;&#x4E0D;&#x5230;&#x4E00;&#x53E5;call&#x548C;&#x4E00;&#x53E5;&#x8DF3;&#x8F6C;&#x6307;&#x4EE4;&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x4E86;&#x4ED6;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6709;&#x9632;softice&#x7684;&#x4EE3;&#x7801;&#x3002;&#x53EA;&#x8981;&#x4F7F;&#x7528;softice&#x7684;&#x8DDF;&#x8E2A;&#xFF0C;&#x5C31;&#x6B7B;&#x673A;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x4ED6;&#x7684;&#x62DB;&#x6570;&#x6BD4;&#x8F83;&#x8001;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x65E9;&#x6709;&#x51C6;&#x5907;&#x3002;&#x6211;&#x7684;softice&#x662F;&#x7ECF;&#x8FC7;&#x6211;&#x6539;&#x9020;&#x7684;&#x3002;&#x4ED6;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4ED8;&#x4ED6;&#x90A3;&#x4E9B;&#x53D8;&#x6362;&#x62DB;&#x6570;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x8DDF;&#x8E2A;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x90A3;&#x4E9B;&#x4EC0;&#x4E48;&#x9690;&#x542B;&#x8C03;&#x7528;&#x554A;&#xFF0C;&#x4EC0;&#x4E48;&#x52A0;&#x58F3;&#x5440;&#xFF0C;&#x5168;&#x5931;&#x53BB;&#x4E86;&#x4F5C;&#x7528;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7ED9;&#x6797;&#x8B66;&#x5B98;&#x53D1;&#x6D88;&#x606F;&#xFF1A;&#x201C;&#x4F60;&#x8DDF;&#x8E2A;&#x5230;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5C31;&#x662F;&#x8131;&#x58F3;&#x7684;&#x5173;&#x952E;&#x4EE3;&#x7801;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#x6211;&#x7684;softice&#x5C31;&#x6B7B;&#x673A;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x770B;&#x6765;&#x5979;&#x7684;softice&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;&#x6539;&#x9020;&#x3002;&#x5F53;&#x7136;&#x6B7B;&#x673A;&#x4E86;&#xFF0C;&#x6BCF;&#x4E2A;&#x89E3;&#x5BC6;&#x7684;&#x5173;&#x952E;&#x4EE3;&#x7801;&#x524D;&#x9762;&#x5C31;&#x6709;&#x53CD;softice&#x7684;&#x4EE3;&#x7801;&#x3002;&#x800C;&#x4E14;&#x4F60;&#x8FD8;&#x4E0D;&#x80FD;&#x8DF3;&#x8FC7;&#xFF0C;&#x8DF3;&#x8FC7;&#xFF0C;&#x540E;&#x9762;&#x5C31;&#x65E0;&#x6CD5;&#x89E3;&#x5BC6;&#x3002;&#x5F53;&#x7136;&#x5C31;&#x6B7B;&#x7FD8;&#x7FD8;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x8DDF;&#x8E2A;&#x5230;&#x54EA;&#x91CC;&#x4E86;&#xFF1F;&#x201D;&#x6797;MM&#x95EE;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x8131;&#x58F3;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x771F;&#x7684;&#x5417;&#xFF1F;&#x4F60;&#x600E;&#x4E48;&#x6CA1;&#x6B7B;&#x673A;&#xFF0C;&#x4F60;&#x7528;&#x4EC0;&#x4E48;&#x8DDF;&#x7684;&#xFF1F;&#x201C;<br>&#x3000;&#x3000;&#x201C;&#x5F53;&#x7136;&#x662F;softice&#xFF0C;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x554A;&#xFF0C;&#x4F60;&#x5982;&#x4F55;&#x8DF3;&#x8FC7;&#x4ED6;&#x7684;&#x53CD;&#x8DDF;&#x8E2A;&#x624B;&#x6BB5;&#x7684;&#x5440;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x5C31;&#x4E00;&#x76F4;&#x8DDF;&#x5440;&#xFF0C;&#x5C31;&#x6CA1;&#x6B7B;&#x673A;&#x3002;&#x201D;&#x6211;&#x6545;&#x610F;&#x88C5;&#x7CCA;&#x6D82;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x6015;&#x5979;&#x95EE;&#x6211;&#x8981;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x3002;&#x5230;&#x65F6;&#x5019;&#x4E0D;&#x597D;&#x63A8;&#x8F9E;&#x3002;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x662F;&#x4E0D;&#x4F1A;&#x8F7B;&#x6613;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x5177;&#x9001;&#x4EBA;&#x7684;&#x3002;&#x51B5;&#x4E14;&#x5BF9;&#x65B9;&#x8FD8;&#x662F;&#x4E2A;&#x8B66;&#x5BDF;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x9A97;&#x6211;&#x3002;&#x201D;&#x6797;MM&#x5F53;&#x7136;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x7B11;&#x7B11;&#xFF0C;&#x4E5F;&#x6CA1;&#x7EE7;&#x7EED;&#x95EE;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x5E72;&#x8B66;&#x5BDF;&#x591A;&#x4E45;&#x4E86;&#xFF1F;&#x201D; &#xFF0C;&#x6211;&#x4E00;&#x8FB9;&#x7EE7;&#x7EED;&#x8DDF;&#x8E2A;&#x5DF2;&#x7ECF;&#x8131;&#x4E86;&#x58F3;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x4ED6;&#x901A;&#x8FC7;&#x89E3;&#x5BC6;&#x6587;&#x4EF6;&#x7684;&#x4EE3;&#x7801;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4E00;&#x5E74;&#x591A;&#x70B9;&#x513F;&#x3002;&#x201D;&#x5979;&#x56DE;&#x7B54;&#xFF0C;&#x201C;&#x4F60;&#x89C9;&#x5F97;&#x7834;&#x8BD1;&#x6709;&#x5E0C;&#x671B;&#x5417;&#xFF1F;&#x201D;&#x5979;&#x603B;&#x662F;&#x5173;&#x5FC3;&#x5979;&#x7684;&#x5DE5;&#x4F5C;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4EC0;&#x4E48;&#x5B66;&#x6821;&#x6BD5;&#x4E1A;&#x7684;&#x5440;&#xFF0C;&#x201D;&#x6211;&#x65E0;&#x804A;&#x5730;&#x95EE;&#x3002;&#x540C;&#x65F6;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;&#x90A3;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x52A0;&#x5BC6;&#x4E86;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x6253;&#x5F00;&#x5B83;&#xFF0C;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#xFF0C;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x5979;&#x6821;&#x9A8C;&#x5BC6;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x67E5;&#x6237;&#x53E3;&#x5440;&#xFF0C;&#x8981;&#x67E5;&#x6237;&#x53E3;&#x6211;&#x53EF;&#x4EE5;&#x5E2E;&#x5FD9;&#x3002;&#x201D;&#x6D88;&#x606F;&#x540E;&#x9762;&#x8DDF;&#x4E86;&#x4E2A;&#x4FCF;&#x76AE;&#x7684;&#x7B11;&#x8138;&#x8868;&#x60C5;&#x7B26;&#x53F7;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#x6211;&#x56DE;&#x4E86;&#x4E2A;&#x7EA2;&#x8138;&#x7684;&#x7B26;&#x53F7;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x53D1;&#x73B0;&#x4E86;filelock&#x7A0B;&#x5E8F;&#x7684;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x4EE3;&#x7801;&#x6BB5;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x53D1;&#x73B0;&#x4E86;&#x5BC6;&#x7801;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5F53;&#x7136;&#x662F;&#x7ECF;&#x8FC7;&#x52A0;&#x5BC6;&#x53D8;&#x6362;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x53EA;&#x8981;&#x628A;&#x8FD9;&#x6BB5;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x4EE3;&#x7801;&#x8BFB;&#x61C2;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x9AD8;&#x5174;&#x8D77;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x627E;&#x5230;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x5165;&#x53E3;&#x4E86;&#x3002;&#x201D;&#x6211;&#x7ED9;&#x6797;MM&#x53D1;&#x6D88;&#x606F;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x592A;&#x597D;&#x4E86;&#x3002;&#x771F;&#x7684;&#x5417;&#xFF1F;&#x201D;&#x6211;&#x51E0;&#x4E4E;&#x80FD;&#x611F;&#x5230;&#x5979;&#x7684;&#x5174;&#x594B;&#x3002;&#x5979;&#x662F;&#x61C2;&#x884C;&#x7684;&#xFF0C;&#x77E5;&#x9053;&#x627E;&#x5230;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x5165;&#x53E3;&#xFF0C;&#x51E0;&#x4E4E;&#x5C31;&#x6210;&#x529F;&#x4E86;&#x4E00;&#x5927;&#x534A;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x522B;&#x9AD8;&#x5174;&#x7684;&#x592A;&#x65E9;&#xFF0C;&#x770B;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x7B97;&#x6CD5;&#x4E86;&#x3002;god bless you&#x3002;&#x201D;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x6CFC;&#x6CFC;&#x51B7;&#x6C34;&#x3002;&#x5176;&#x5B9E;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x624D;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5C31;&#x80FD;&#x8DDF;&#x8E2A;&#x5230;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x90E8;&#x5206;&#xFF0C;&#x5DF2;&#x7ECF;&#x5927;&#x5927;&#x51FA;&#x4E4E;&#x6211;&#x7684;&#x610F;&#x6599;&#x4E86;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x4E5F;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x4E25;&#x5BC6;&#xFF0C;&#x6BD5;&#x7ADF;&#x53EA;&#x662F;&#x7F51;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x52A0;&#x5BC6;&#x7A0B;&#x5E8F;&#x3002;&#x53C8;&#x4E0D;&#x662F;&#x5546;&#x4E1A;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x521D;&#x5B66;&#x52A0;&#x5BC6;&#x7684;&#x4EBA;&#x641E;&#x7684;&#x8BD5;&#x9A8C;&#x7A0B;&#x5E8F;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x672C;&#x6765;&#x662F;&#x505A;&#x597D;&#x901A;&#x5BB5;&#x6218;&#x6597;&#x7684;&#x51C6;&#x5907;&#x7684;&#x3002;&#x73B0;&#x5728;&#x770B;&#x6765;&#xFF0C;&#x4F3C;&#x4E4E;&#x662F;&#x975E;&#x5E38;&#x7684;&#x987A;&#x5229;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5012;&#x4E86;&#x4E00;&#x676F;&#x6C34;&#xFF0C;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x7684;&#x559D;&#x7740;&#xFF0C;&#x4E00;&#x8FB9;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x5F00;&#x59CB;&#x8BFB;&#x90A3;&#x6BB5;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x3002;&#x6839;&#x636E;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x771F;&#x6B63;&#x8003;&#x9A8C;&#x6BC5;&#x529B;&#x7684;&#x65F6;&#x5019;&#x5230;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x6BCF;&#x53E5;&#x6BCF;&#x53E5;&#x90FD;&#x8BFB;&#x61C2;&#x3002;&#x4E0D;&#x50CF;&#x52A8;&#x6001;&#x8DDF;&#x8E2A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5927;&#x6BB5;&#x5927;&#x6BB5;&#x7684;&#x81EA;&#x52A8;&#x8FD0;&#x884C;&#x3002;&#x53EA;&#x6709;&#x4F60;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E2A;&#x52A0;&#x5BC6;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x901A;&#x8FC7;&#x9006;&#x8FC7;&#x7A0B;&#x628A;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#x53D8;&#x6210;&#x660E;&#x6587;&#x3002;&#x800C;&#x91C7;&#x7528;&#x7684;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x4E3A;&#x4E86;&#x4E0D;&#x88AB;&#x522B;&#x4EBA;&#x7834;&#x8BD1;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x975E;&#x5E38;&#x590D;&#x6742;&#x3002;&#x5199;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F5C;&#x8005;&#x4E00;&#x822C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x65B9;&#x5F0F;&#x5199;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x5C31;&#x662F;&#xFF0C;&#x600E;&#x6837;&#x8BA9;&#x4F60;&#x8BFB;&#x4E0D;&#x61C2;&#xFF0C;&#x5C31;&#x600E;&#x6837;&#x5199;&#x7A0B;&#x5E8F;&#x3002;&#x53CD;&#x6B63;&#x5C31;&#x662F;&#x8BA9;&#x4F60;&#x8BFB;&#x4E0D;&#x61C2;&#x5C31;&#x5BF9;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x51E1;&#x662F;&#x8BFB;&#x8FC7;&#x522B;&#x4EBA;&#x7A0B;&#x5E8F;&#x7684;&#x4EBA;&#x4E00;&#x822C;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x8BFB;&#x522B;&#x4EBA;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x4E0D;&#x5982;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x3002;&#x73B0;&#x5728;&#x6211;&#x8BFB;&#x7684;&#x65F6;&#x5019;&#x662F;&#x522B;&#x4EBA;&#x6545;&#x610F;&#x8BA9;&#x4F60;&#x8BFB;&#x4E0D;&#x61C2;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x56F0;&#x96BE;&#x5EA6;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x53EF;&#x4EE5;&#x628A;&#x90A3;&#x6BB5;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#x7A0B;&#x5E8F;&#x53D1;&#x7ED9;&#x6211;&#x5417;&#xFF1F;&#x201D;&#x6797;MM&#x53D1;&#x6D88;&#x606F;&#x8FC7;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;of course&#x3002;&#x201D;&#x6211;&#x628A;&#x4EE3;&#x7801;&#x7684;&#x5C4F;&#x5E55;copy&#x7ED9;&#x5979;&#x53D1;&#x8FC7;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x5F00;&#x59CB;&#x8BFB;&#x7A0B;&#x5E8F;&#x3002;&#x624D;&#x8BFB;&#x4E86;&#x534A;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x3002;&#x6211;&#x7684;&#x5FC3;&#x5F00;&#x59CB;&#x4E0B;&#x6C89;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x7B97;&#x6CD5;&#x6211;&#x975E;&#x5E38;&#x7684;&#x719F;&#x6089;&#xFF0C;&#x800C;&#x4E14;&#x8FDC;&#x6CA1;&#x6709;&#x6211;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x590D;&#x6742;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#xFF0C;&#x6B63;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x611F;&#x5230;&#x5931;&#x843D;&#x3002;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x8981;&#x89E3;&#x5BC6;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FDC;&#x6CA1;&#x6709;&#x6211;&#x5F00;&#x59CB;&#x9884;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x4E50;&#x89C2;&#x3002;<br>&#x3000;&#x3000;&#x5199;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x90A3;&#x4E2A;&#x5BB6;&#x4F19;&#xFF0C;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x7684;&#x81EA;&#x5DF1;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x4ED6;&#x7684;&#x77E5;&#x8BC6;&#x6C34;&#x5E73;&#x663E;&#x7136;&#x5E76;&#x4E0D;&#x9AD8;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x7834;&#x8BD1;&#x4ED6;&#x81EA;&#x5DF1;&#x521B;&#x9020;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;&#x4ED6;&#x7684;&#x4E09;&#x5C42;&#x52A0;&#x58F3;&#xFF0C;&#x4E0D;&#x662F;&#x88AB;&#x6211;&#x5728;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x4E4B;&#x5185;&#x5C31;&#x8131;&#x7684;&#x5E72;&#x5E72;&#x51C0;&#x51C0;&#x5417;&#xFF1F;&#x5173;&#x952E;&#x662F;&#x8FD9;&#x4E2A;&#x6700;&#x5173;&#x952E;&#x7684;&#x5BC6;&#x7801;&#x53D8;&#x6362;&#xFF0C;&#x4ED6;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x7B97;&#x6CD5;&#x3002;<br>&#x3000;&#x3000;&#x4ED6;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x6211;&#x975E;&#x5E38;&#x719F;&#x6089;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x6B63;&#x56E0;&#x4E3A;&#x6211;&#x975E;&#x5E38;&#x719F;&#x6089;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x9EBB;&#x70E6;&#x771F;&#x6B63;&#x7684;&#x5F00;&#x59CB;&#x964D;&#x4E34;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x53D1;&#x4E86;&#x4E00;&#x58F0;&#x957F;&#x957F;&#x7684;&#x53F9;&#x606F;&#xFF0C;&#x7ED9;&#x6797;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x7834;&#x8BD1;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4E0D;&#x5927;&#xFF0C;&#x5C31;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x8FD0;&#x6C14;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x597D;&#x719F;&#x6089;&#x5440;&#x3002;&#x3002;&#x3002;&#x201D;&#x770B;&#x6765;&#x5979;&#x8FD8;&#x9677;&#x5728;&#x8BFB;&#x4EE3;&#x7801;&#x7684;&#x6CE5;&#x6F6D;&#x91CC;&#x9762;&#x3002;<br>&#x3000;&#x3000;&#x4ECA;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x653E;&#x5F03;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x3002;&#x4E0D;&#x653E;&#x5F03;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x8FDB;&#x5C55;&#x7684;&#x3002;</p>
<p>&#x201C;&#x770B;&#x6765;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8270;&#x82E6;&#x7684;&#x8FC7;&#x7A0B;&#x4E86;&#xFF0C;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8010;&#x5FC3;&#x5440;&#xFF1F;&#x201D;&#x6211;&#x53D1;&#x6D88;&#x606F;&#x7ED9;&#x6797;&#x8B66;&#x5B98;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x554A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;&#x540E;&#x9762;&#x5E26;&#x4E86;&#x4E00;&#x4E2A;&#x54ED;&#x6CE3;&#x7684;&#x8138;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x7B97;&#x6CD5;&#x7528;&#x7684;&#x662F;DES&#x7B97;&#x6CD5;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x201D;&#x597D;&#x4E45;&#x90FD;&#x6CA1;&#x6709;&#x56DE;&#x590D;&#x3002;&#x8FC7;&#x4E86;&#x5F88;&#x4E45;&#x624D;&#x56DE;&#x8FC7;&#x6765;&#x4E00;&#x53E5;&#xFF1A;&#x201C;&#x602A;&#x4E0D;&#x5F97;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E48;&#x719F;&#x6089;&#x5462;&#x3002;&#x5509;&#xFF5E;&#xFF5E;&#xFF5E;&#xFF0C;&#x9EBB;&#x70E6;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x5199;filelock&#x7684;&#x4EBA;&#xFF0C;&#x770B;&#x6765;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x884C;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;&#x8F83;&#x4E13;&#x4E1A;&#xFF0C;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x7B97;&#x6CD5;&#x5173;&#x952E;&#x70B9;&#x5C45;&#x7136;&#x7528;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x4F17;&#x7686;&#x77E5;&#x9053;&#x7684;&#x5BC6;&#x7801;&#x7B97;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x5927;&#x4F17;&#x7686;&#x77E5;&#x9053;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x65E0;&#x89E3;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x51E1;&#x662F;&#x641E;&#x8FC7;&#x52A0;&#x5BC6;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x60F3;&#x6CA1;&#x6709;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x6559;&#x79D1;&#x4E66;&#x91CC;&#x9762;&#x4E5F;&#x662F;&#x968F;&#x5904;&#x53EF;&#x89C1;&#x3002;DES&#x7B97;&#x6CD5;&#x662F;1977&#x5E74;&#x9881;&#x5E03;&#x7684;&#x3002;&#x5230;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x90FD;30&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5230;&#x5904;&#x90FD;&#x8FD8;&#x5728;&#x8FD0;&#x7528;&#x3002;&#x53EF;&#x89C1;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x5B89;&#x5168;&#x6027;&#x548C;&#x52A0;&#x5BC6;&#x5F3A;&#x5EA6;&#x662F;&#x503C;&#x5F97;&#x79F0;&#x9053;&#x7684;&#x3002;&#x5B83;&#x91C7;&#x7528;&#x7684;56&#x4F4D;&#x7684;&#x52A0;&#x5BC6;&#x3002;&#x5BF9;&#x666E;&#x901A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x7834;&#x8BD1;&#x51E0;&#x4E4E;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x91CC;&#x6709;&#x5FC5;&#x8981;&#x7ED9;&#x4E0D;&#x4E86;&#x89E3;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x8BFB;&#x8005;&#x8BF4;&#x4E00;&#x8BF4;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;&#x771F;&#x6B63;&#x52A0;&#x5BC6;&#x5F3A;&#x5EA6;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x516C;&#x5F00;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x573A;&#x6240;&#xFF08;&#x6BD4;&#x5982;&#x519B;&#x961F;&#xFF09;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x7B97;&#x6CD5;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x4E00;&#x4E2A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#xFF01;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x77E5;&#x9053;&#x4F60;&#x77E5;&#x9053;&#x5BC6;&#x7801;&#x7684;&#x660E;&#x6587;&#xFF0C;&#x548C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x7B97;&#x51FA;&#x4F60;&#x5BC6;&#x7801;&#x7684;&#x5BC6;&#x6587;&#x3002;&#x4F46;&#x662F;&#x77E5;&#x9053;&#x5BC6;&#x6587;&#xFF0C;&#x662F;&#x65E0;&#x6CD5;&#x63A8;&#x51FA;&#x4F60;&#x7684;&#x660E;&#x6587;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x77E5;&#x9053;&#x4E86;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x5BC6;&#x7801;&#xFF0C;&#x4F60;&#x4E5F;&#x65E0;&#x6CD5;&#x53CD;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4EBA;&#x7C7B;&#x7684;&#x667A;&#x6167;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6570;&#x5B66;&#x7684;&#x9B45;&#x529B;&#x3002;&#x4E0D;&#x4F69;&#x670D;&#x4E0D;&#x884C;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x6837;&#xFF0C;&#x6309;&#x7167;&#x6211;&#x73B0;&#x5728;&#x7684;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#xFF0C;&#x4E5F;&#x53EA;&#x662F;&#x4E00;&#x77E5;&#x534A;&#x89E3;&#x3002;&#x4F46;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x6570;&#x5B66;&#x5BB6;&#x8BC1;&#x660E;&#x8FC7;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x53CD;&#x63A8;&#x5BC6;&#x7801;&#x7684;&#x8BDD;&#xFF0C;&#x6839;&#x672C;&#x5C31;&#x662F;&#x53EF;&#x7B11;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x63A8;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4F60;&#x57FA;&#x672C;&#x4E5F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B66;&#x5BB6;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5F53;&#x7136;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x7A77;&#x4E3E;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4F60;&#x4E00;&#x4E2A;&#x5BC6;&#x7801;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x7B97;&#xFF0C;&#x7B97;&#x51FA;&#x6765;&#x770B;&#x662F;&#x5426;&#x548C;&#x5BC6;&#x6587;&#x76F8;&#x540C;&#xFF0C;&#x5982;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x5C31;&#x662F;&#x6B63;&#x786E;&#x7684;&#x5BC6;&#x7801;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x7ED9;&#x4F60;&#x9650;&#x5B9A;&#x6B21;&#x6570;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#x4E00;&#x70B9;&#x529E;&#x6CD5;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x5E78;&#x597D;&#x73B0;&#x5728;&#x662F;&#x5728;&#x5355;&#x673A;&#x4E0A;&#x3002;&#x5E78;&#x597D;&#x6211;&#x5DF2;&#x7ECF;&#x641E;&#x6E05;&#x695A;&#x4E86;&#x4ED6;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x5E78;&#x597D;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4ED6;&#x7684;&#x6B21;&#x6570;&#x9650;&#x5B9A;&#x3002;<br>&#x3000;&#x3000;&#x56E0;&#x6B64;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x7EDD;&#x671B;&#x3002;&#x4F46;&#x662F;&#x662F;&#x5426;&#x6210;&#x529F;&#xFF0C;&#x5C31;&#x770B;&#x52A0;&#x5BC6;&#x8005;&#x7684;&#x672C;&#x4EBA;&#x8F93;&#x5165;&#x7684;&#x5BC6;&#x7801;&#x7684;&#x5F3A;&#x5EA6;&#x4E86;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x770B;&#x8FD0;&#x6C14;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x7531;&#x4E8E;&#x73B0;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x901F;&#x5EA6;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#xFF0C;&#x4EE5;&#x524D;&#x5F88;&#x591A;&#x7A77;&#x4E3E;&#x65E0;&#x6CD5;&#x6210;&#x529F;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x73B0;&#x5728;&#x4E5F;&#x6709;&#x4E86;&#x53EF;&#x80FD;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6709;&#x66F4;&#x957F;&#x7684;&#x5BC6;&#x7801;&#x7B97;&#x6CD5;&#x6765;&#x4EE3;&#x66FF;des&#x4E86;&#xFF0C;&#x6BD4;&#x5982;ibm&#x7684;mars&#x7B97;&#x6CD5;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x3002;&#x5982;&#x679C;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#xFF0C;&#x6211;&#x80AF;&#x5B9A;&#x4F1A;&#x7ACB;&#x523B;&#x653E;&#x5F03;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x73B0;&#x5728;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x201D;&#x5C0F;&#x6797;MM&#x660E;&#x663E;&#x6709;&#x70B9;&#x7740;&#x6025;&#x4E86;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x5F00;&#x59CB;&#x5979;&#x80AF;&#x5B9A;&#x4EE5;&#x4E3A;&#x90FD;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x5C45;&#x7136;&#x9047;&#x5230;&#x8FD9;&#x4E48;&#x5389;&#x5BB3;&#x7684;&#x969C;&#x788D;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x53D1;&#x73B0;&#x5973;&#x4EBA;&#x5C31;&#x662F;&#x5973;&#x4EBA;&#xFF0C;&#x522B;&#x770B;&#x5C0F;&#x6797;&#x7A7F;&#x7740;&#x8B66;&#x670D;&#x5F88;&#x5A01;&#x98CE;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x660E;&#x663E;&#x4E5F;&#x4F53;&#x73B0;&#x51FA;&#x5973;&#x4EBA;&#x67D4;&#x5F31;&#x65E0;&#x52A9;&#x7684;&#x4E00;&#x9762;&#x3002;&#x5176;&#x5B9E;&#x8B66;&#x5BDF;&#x4E5F;&#x662F;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x575A;&#x5F3A;&#x7684;&#x5916;&#x58F3;&#xFF0C;&#x4F46;&#x662F;&#x5185;&#x5FC3;&#x4F9D;&#x7136;&#x548C;&#x666E;&#x901A;&#x4EBA;&#x4E00;&#x6837;&#x3002;&#x5475;&#x5475;&#x3002;&#x4E24;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x9AD8;&#x624B;&#x6700;&#x4F73;&#x642D;&#x914D;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x7537;&#x4E00;&#x5973;&#xFF0C;&#x56E0;&#x4E3A;&#x7537;&#x4EBA;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x5AC9;&#x5992;&#x5973;&#x4EBA;&#xFF0C;&#x800C;&#x5973;&#x4EBA;&#x89C9;&#x5F97;&#x7537;&#x4EBA;&#x6BD4;&#x5979;&#x81EA;&#x5DF1;&#x5F3A;&#x4E5F;&#x5F88;&#x81EA;&#x7136;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x6837;&#x4EA4;&#x6D41;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x9694;&#x9602;&#xFF0C;&#x5766;&#x8361;&#x5766;&#x8361;&#x7684;&#xFF0C;&#x6211;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x8FD9;&#x6837;&#x5766;&#x8361;&#x7684;&#x611F;&#x89C9;&#x3002;&#x6211;&#x6700;&#x8BA8;&#x538C;&#x865A;&#x4F2A;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x90A3;&#x4E2A;&#x52A0;&#x5BC6;&#x6587;&#x4EF6;&#x7684;&#x5F53;&#x4E8B;&#x4EBA;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6C34;&#x5E73;&#x5982;&#x4F55;&#xFF1F;&#x201D;&#x6211;&#x53D1;&#x6D88;&#x606F;&#x7ED9;&#x4ED6;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6839;&#x636E;&#x6211;&#x4EEC;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x4ED6;&#x662F;&#x5B66;&#x91D1;&#x878D;&#x7BA1;&#x7406;&#x7684;&#xFF0C;&#x4F1A;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4F46;&#x662F;&#x5E94;&#x8BE5;&#x4E0D;&#x662F;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x5FC3;&#x91CC;&#x6709;&#x6570;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x77E5;&#x9053;&#x5230;&#x56FD;&#x5916;&#x53BB;down&#x52A0;&#x5BC6;&#x8F6F;&#x4EF6;&#xFF0C;&#x8BF4;&#x660E;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x77E5;&#x8BC6;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x5B9A;&#x57FA;&#x7840;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6BD5;&#x7ADF;&#x4E0D;&#x662F;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x7684;&#x3002;&#x4E00;&#x822C;&#x8BF4;&#x6765;&#xFF0C;&#x6DF1;&#x5EA6;&#x5E94;&#x8BE5;&#x6709;&#x9650;&#x5EA6;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4EEC;&#x5BF9;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5206;&#x6790;&#x8FC7;&#x6CA1;&#x6709;&#xFF0C;&#x6BD4;&#x5982;&#x4ED6;&#x7684;email&#x5BC6;&#x7801;&#xFF0C;&#x4ED6;&#x7684;&#x5728;&#x7F51;&#x4E0A;&#x7ECF;&#x5E38;&#x53BB;&#x7684;&#x5730;&#x65B9;&#x7684;&#x5BC6;&#x7801;&#x6BD4;&#x5982;&#x4ED6;&#x7684;windows&#x5BC6;&#x7801;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x548C;&#x7279;&#x70B9;&#x6709;&#x5206;&#x6790;&#x6CA1;&#x6709;&#x3002;&#x201D;&#x6211;&#x53C8;&#x53D1;&#x6D88;&#x606F;&#x8FC7;&#x53BB;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5F53;&#x7136;&#x5206;&#x6790;&#x8FC7;&#xFF0C;&#x4ED6;&#x5728;&#x7F51;&#x4E0A;&#x7684;&#x5BC6;&#x7801;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x7531;&#x5B57;&#x7B26;&#x548C;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#xFF0C;&#x800C;&#x4E14;&#x957F;&#x5EA6;&#x4E00;&#x822C;&#x90FD;&#x662F;6&#x4F4D;&#x4EE5;&#x4E0B;&#x3002;&#x4ED6;&#x7684;window&#x7684;&#x5BC6;&#x7801;&#x4E5F;&#x624D;5&#x4F4D;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x770B;&#x6765;&#x8FD9;&#x4F4D;&#x52A0;&#x5BC6;&#x8005;&#x672C;&#x4EBA;&#x5BF9;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x5E76;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x5728;&#x610F;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x4E0D;&#x4F1A;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E48;&#x77ED;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x5BF9;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x8FDB;&#x884C;&#x7A77;&#x4E3E;&#x5E94;&#x8BE5;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x5E0C;&#x671B;&#x3002;<br>&#x3000;&#x3000;&#x201C;ok&#xFF0C;&#x7B49;&#x6211;&#x5199;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x627E;&#x4E2A;&#x597D;&#x70B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8DD1;&#x4E00;&#x8DD1;&#x5427;&#xFF0C;&#x4E5F;&#x8BB8;&#x53EF;&#x4EE5;&#x628A;&#x5BC6;&#x7801;&#x8DD1;&#x51FA;&#x6765;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x597D;&#x597D;&#xFF0C;&#x7A0B;&#x5E8F;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x7ED9;&#x6211;&#xFF1F;&#x201D;&#x8FD9;&#x4E2A;&#x6797;MM&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x7EDD;&#x5BF9;&#x662F;&#x4E2A;&#x6025;&#x6027;&#x5B50;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x660E;&#x5929;&#x6211;&#x4E0B;&#x73ED;&#x7684;&#x65F6;&#x5019;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;ok&#xFF0C;&#x660E;&#x5929;&#x4E0B;&#x5348;5&#x70B9;&#xFF0C;&#x6211;&#x6765;&#x627E;&#x4F60;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4EEC;&#x8B66;&#x5BDF;&#x4F5C;&#x4E8B;&#x60C5;&#xFF0C;&#x597D;&#x5047;&#x5440;&#xFF1F;&#x201D;&#x6211;&#x5F00;&#x59CB;&#x8C03;&#x4F83;&#x5979;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x600E;&#x4E48;&#x5047;&#x4E86;&#xFF1F;&#x201D;&#x5979;&#x53CD;&#x5E94;&#x5F88;&#x5FEB;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4E0D;&#x662F;&#x8BF4;&#x4F60;&#xFF0C;&#x6211;&#x521A;&#x624D;&#x5728;&#x7535;&#x89C6;&#x4E0A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x94F6;&#x884C;&#x7684;&#x53CD;&#x62A2;&#x52AB;&#x6F14;&#x4E60;&#xFF0C;&#x4E00;&#x4E2A;&#x62A2;&#x532A;&#x62FF;&#x7740;&#x624B;&#x67AA;&#xFF0C;&#x8B66;&#x5BDF;&#x548C;&#x4FDD;&#x5B89;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x6015;&#xFF0C;&#x4E5F;&#x4E0D;&#x7BA1;&#x4EBA;&#x8D28;&#x7684;&#x6B7B;&#x6D3B;&#xFF0C;&#x76F4;&#x63A5;&#x5C31;&#x6251;&#x4E0A;&#x53BB;&#xFF0C;&#x6253;&#x7FA4;&#x67B6;&#xFF0C;&#x76F4;&#x63A5;&#x5C31;&#x628A;&#x90A3;&#x4E2A;&#x532A;&#x5F92;&#x6309;&#x5012;&#x4E86;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x8981;&#x662F;&#x771F;&#x7684;&#x532A;&#x5F92;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x8FD9;&#x4E48;&#x4E0D;&#x6015;&#x6B7B;&#x5417;&#xFF1F;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4E5F;&#x662F;&#x611A;&#x8822;&#x7684;&#x5427;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#x3002;&#x201D;&#x770B;&#x5230;&#x6211;&#x8BF4;&#x7684;&#x4E0D;&#x662F;&#x5979;&#xFF0C;&#x5979;&#x53EF;&#x80FD;&#x8F7B;&#x677E;&#x4E86;&#x4E9B;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6F14;&#x4E60;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5566;&#xFF0C;&#x96BE;&#x9053;&#x4F60;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x771F;&#x7684;&#x7528;&#x5B9E;&#x5F39;&#xFF0C;&#x771F;&#x7684;&#x628A;&#x4EBA;&#x6253;&#x6B7B;&#x3002;&#x201D;&#x5979;&#x5F00;&#x59CB;&#x89E3;&#x91CA;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x65E2;&#x7136;&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5728;&#x7535;&#x89C6;&#x4E0A;&#x8868;&#x6F14;&#x4E86;&#x561B;&#xFF0C;&#x8FD9;&#x662F;&#x635F;&#x574F;&#x4F60;&#x4EEC;&#x8B66;&#x5BDF;&#x7684;&#x5F62;&#x8C61;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#x3002;&#x201D;&#x5979;&#x6CA1;&#x6709;&#x518D;&#x89E3;&#x91CA;&#x3002;&#x8BF4;&#x4E86;&#x4E00;&#x58F0;&#x201C;&#x6211;&#x8981;&#x7761;&#x89C9;&#x4E86;&#xFF0C;bye&#x3002;&#x201D;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x5979;&#x4ECE;QQ&#x4E0A;&#x6D88;&#x5931;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x7761;&#x610F;&#xFF0C;&#x8D81;&#x70ED;&#x6253;&#x94C1;&#xFF0C;&#x628A;&#x90A3;&#x4E2A;&#x89E3;&#x5BC6;&#x7A0B;&#x5E8F;&#x5199;&#x51FA;&#x6765;&#x3002;&#x4F7F;&#x7528;&#x6807;&#x51C6;c&#x8BED;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x754C;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x754C;&#x9762;&#x53CB;&#x597D;&#x3002;&#x7136;&#x540E;&#x5BC6;&#x7801;&#x7B56;&#x7565;&#x6211;&#x5B9A;&#x4E3A;&#xFF1A;6&#x4F4D;&#xFF0C;5&#x4F4D;&#xFF0C;4&#x4F4D;&#xFF0C;&#x7136;&#x540E;7&#x4F4D;&#xFF0C;8&#x4F4D;&#x5230;&#xFF0C;12&#x4F4D;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x662F;3&#x4F4D;&#xFF0C;&#x7136;&#x540E;&#x7EE7;&#x7EED;13&#x4F4D;&#x4E0A;&#x9762;&#x52A0;&#x3002;&#x8FD9;&#x6837;&#x6839;&#x636E;&#x90A3;&#x4E2A;&#x52A0;&#x5BC6;&#x4EBA;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5E94;&#x8BE5;&#x53EF;&#x80FD;&#x6027;&#x8981;&#x5927;&#x4E9B;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x6211;&#x4EE5;&#x524D;&#x5199;&#x8FC7;&#x591A;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x628A;&#x4EE5;&#x524D;&#x7684;&#x7A0B;&#x5E8F;&#x7A0D;&#x7A0D;&#x6539;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x5C31;ok&#x4E86;&#x3002;&#x5B58;&#x5230;&#x6211;&#x7684;ftp&#x4E0A;&#x3002;&#x5230;&#x65F6;&#x5019;down&#x7ED9;&#x5979;&#xFF0C;&#x8BA9;&#x5979;&#x81EA;&#x5DF1;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x7B97;&#x5427;&#xFF0C;&#x6211;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x7B97;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x7B97;&#x4E0D;&#x7B97;&#x5F97;&#x51FA;&#x6765;&#x5C31;&#x770B;&#x90A3;&#x4F4D;&#x52A0;&#x5BC6;&#x8005;&#x52A0;&#x7684;&#x5BC6;&#x7801;&#x591A;&#x5C11;&#x4F4D;&#x4E86;&#x3002;&#x6211;&#x53EF;&#x4E0D;&#x662F;&#x795E;&#x4ED9;&#x3002;&#x89E3;&#x4E0D;&#x51FA;&#x6765;&#x6211;&#x4E5F;&#x6CA1;&#x529E;&#x6CD5;&#x3002;<br>&#x3000;&#x3000;&#x7761;&#x89C9;&#x7684;&#x65F6;&#x5019;&#x5DF2;&#x7ECF;&#x5FEB;2&#x70B9;&#x4E86;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x8FD9;&#x4E48;&#x665A;&#x7761;&#x89C9;&#x3002;&#x5728;&#x68A6;&#x4E2D;&#xFF0C;&#x6211;&#x5C45;&#x7136;&#x68A6;&#x89C1;&#x6211;&#x5F97;&#x5230;&#x4E86;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x800C;&#x4E14;&#x80E1;&#x961F;&#x957F;&#x53EA;&#x8981;&#x4E00;&#x6539;&#xFF0C;&#x6211;&#x5C31;&#x9A6C;&#x4E0A;&#x77E5;&#x9053;&#x4E86;&#x3002;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x68A6;&#x662F;&#x6CA1;&#x6709;&#x9053;&#x7406;&#x53EF;&#x8BB2;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x80E1;&#x961F;&#x957F;&#xFF0C;&#x6211;&#x6765;&#x4E86;&#x3002;&#x4E0D;&#x641E;&#x6389;&#x4F60;&#xFF0C;&#x6211;&#x4E0D;&#x7518;&#x5FC3;&#x3002;<br>&#x3000;&#x3000;&#x7167;&#x4F8B;&#x61F5;&#x61F5;&#x61C2;&#x61C2;&#x7684;&#x8D77;&#x5E8A;&#xFF0C;&#x5306;&#x5306;&#x5FD9;&#x5FD9;&#x7684;&#x4E0A;&#x73ED;&#x3002;<br>&#x3000;&#x3000;&#x521A;&#x5230;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x5934;&#x513F;&#x5C31;&#x53EB;&#x6211;&#x8FDB;&#x53BB;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x521A;&#x624D;&#x603B;&#x90E8;&#x6253;&#x7535;&#x8BDD;&#x6765;&#x4E86;&#xFF0C;&#x8981;&#x4F60;&#x5168;&#x529B;&#x534F;&#x52A9;&#x8B66;&#x5BDF;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x4E0D;&#x8981;&#x4E22;&#x4E86;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x8138;&#x3002;&#x624B;&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x6682;&#x65F6;&#x653E;&#x4E0B;&#x3002;&#x201D;&#x5934;&#x513F;&#x7B11;&#x7740;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x6211;&#x4F30;&#x8BA1;&#x4ED6;&#x4E5F;&#x77E5;&#x9053;&#x4E86;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5440;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x6709;&#x8B66;&#x5BDF;&#xFF1F;&#x201D;&#x770B;&#x6765;&#x4ED6;&#x5BF9;&#x7EC6;&#x8282;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5176;&#x5B9E;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x89E3;&#x4E00;&#x4E2A;DES&#x5BC6;&#x7801;&#x3002;&#x201D;&#x548C;&#x5185;&#x884C;&#x8BF4;&#x8BDD;&#x5C31;&#x662F;&#x7B80;&#x5355;&#x3002;&#x4E00;&#x8BF4;&#x5C31;&#x660E;&#x767D;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x89E3;DES&#x5440;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x80E1;&#x961F;&#x957F;&#x61C2;&#x4E2A;&#x5C41;&#x5440;&#x3002;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x628A;&#x63E1;&#xFF1F;&#x6211;&#x4EEC;&#x7684;&#x673A;&#x5668;&#x901F;&#x5EA6;&#x53EF;&#x80FD;&#x592A;&#x6162;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x662F;&#x5440;&#xFF0C;&#x6211;&#x4E0D;&#x7BA1;&#xFF0C;&#x5199;&#x4E2A;&#x7A0B;&#x5E8F;&#x8BA9;&#x4ED6;&#x4EEC;&#x5211;&#x8B66;&#x961F;&#x81EA;&#x5DF1;&#x627E;&#x673A;&#x5668;&#x89E3;&#x5427;&#x3002;&#x884C;&#x4E0D;&#x884C;&#xFF0C;&#x770B;&#x8FD0;&#x6C14;&#x4E86;&#x5427;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x73B0;&#x5728;&#x673A;&#x5668;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x89E3;DES&#x5E94;&#x8BE5;&#x662F;&#x8FDF;&#x65E9;&#x7684;&#x95EE;&#x9898;&#x3002;&#x201D;&#x5934;&#x513F;&#x786E;&#x5B9E;&#x662F;&#x5185;&#x884C;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x597D;&#x4E86;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x7ED9;&#x5211;&#x8B66;&#x5BF9;&#x628A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x4E86;&#x518D;&#x8BF4;&#x3002;&#x201D;&#x5934;&#x513F;&#x8BF4;&#x5B8C;&#x5C31;&#x57CB;&#x5934;&#x641E;&#x4ED6;&#x7684;&#x8BBA;&#x6587;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x4ECE;&#x5934;&#x513F;&#x529E;&#x516C;&#x5BA4;&#x51FA;&#x6765;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x62B1;&#x6028;&#x4ECA;&#x5929;&#x7684;&#x7F51;&#x901F;&#x597D;&#x6162;&#x3002;&#x6211;&#x6253;&#x5F00;flashget&#x4E00;&#x770B;&#xFF0C;&#x53EF;&#x4E0D;&#x662F;&#xFF0C;&#x4EE5;&#x524D;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x4E3A;100&#x591A;K&#x7684;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x73B0;&#x5728;&#x5C45;&#x7136;&#x624D;&#x4E0D;&#x5230;10k&#xFF0C;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#x57FA;&#x672C;&#x611F;&#x89C9;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E0B;&#x8F7D;&#x8F6F;&#x4EF6;&#x611F;&#x89C9;&#x662F;&#x975E;&#x5E38;&#x660E;&#x663E;&#x7684;&#x3002;&#x6211;&#x6000;&#x7591;&#x662F;&#x4E0D;&#x662F;&#x53C8;&#x662F;&#x80E1;&#x961F;&#x957F;&#x5728;&#x641E;&#x9B3C;&#x3002;&#x4E0D;&#x8FC7;&#x7F51;&#x7EDC;&#x6709;&#x65F6;&#x5019;&#x6162;&#x4E5F;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x6562;&#x786E;&#x5B9A;&#x3002;&#x8DD1;&#x5230;&#x9694;&#x58C1;&#x8D22;&#x52A1;&#x5904;&#xFF0C;&#x8BF4;&#x770B;&#x770B;&#x7F51;&#x7EDC;&#x901F;&#x5EA6;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x70B9;&#x6162;&#xFF1F;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x90FD;&#x8BF4;&#xFF0C;&#x5FEB;&#x5440;&#xFF0C;&#x6BD4;&#x6628;&#x5929;&#x8FD8;&#x5FEB;&#x3002;&#x6211;&#x4EB2;&#x81EA;&#x4E0B;&#x8F7D;&#x4E86;&#x540C;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x679C;&#x7136;&#x662F;120k&#x5DE6;&#x53F3;&#x3002;&#x5F88;&#x5FEB;&#x5440;&#xFF0C;&#x9760;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x8FD9;&#x62DB;&#x591F;&#x6BD2;&#x7684;&#x3002;&#x8BA9;&#x4F60;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x4E0B;&#x8F7D;&#x5C31;&#x662F;&#x6162;&#x3002;&#x6211;&#x4EEC;&#x6162;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x96BE;&#x602A;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x4EBA;&#x8BF4;&#x6BD4;&#x6628;&#x5929;&#x8FD8;&#x5FEB;&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x6765;&#x4E0D;&#x80FD;&#x653E;&#x8FC7;&#x80E1;&#x961F;&#x957F;&#xFF0C;&#x4E0D;&#x641E;&#x5230;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x770B;&#x6765;&#x662F;&#x6C38;&#x65E0;&#x5B81;&#x65E5;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8981;&#x641E;&#x5230;&#x80E1;&#x961F;&#x957F;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x653B;&#x5165;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x540E;&#x95E8;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E0D;&#x7BA1;&#x4ED6;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x5BC6;&#x7801;&#x5982;&#x4F55;&#x53D8;&#x6362;&#xFF0C;&#x4E5F;&#x9003;&#x4E0D;&#x8FC7;&#x6211;&#x7684;&#x638C;&#x63E1;&#x3002;&#x53EF;&#x662F;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x4E5F;&#x4E0D;&#x662F;&#x83DC;&#x9E1F;&#x3002;&#x4ED6;&#x7684;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x9632;&#x62A4;&#x5F97;&#x5F88;&#x4E25;&#xFF0C;&#x6CA1;&#x5F00;&#x4EFB;&#x4F55;&#x670D;&#x52A1;&#xFF0C;&#x8FDE;&#x7A7A;&#x8FDE;&#x63A5;&#x90FD;&#x88AB;&#x7981;&#x6B62;&#x4E86;&#x3002;&#x60F3;&#x4ECE;&#x7F51;&#x7EDC;&#x4E0A;&#x76F4;&#x63A5;&#x653B;&#x7834;&#xFF0C;&#x663E;&#x7136;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x3002;<br>&#x3000;&#x3000;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF0C;&#x6211;&#x6B63;&#x60F3;&#x7740;&#x3002;&#x7A81;&#x7136;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5973;&#x8B66;&#x5BDF;&#x8FDB;&#x5165;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x4E2A;&#x5973;&#x8B66;&#x5BDF;&#x95EE;&#x4E86;&#x5750;&#x5728;&#x95E8;&#x53E3;&#x7684;&#x674E;MM&#x540E;&#xFF0C;&#x5F84;&#x76F4;&#x5411;&#x6211;&#x7684;&#x529E;&#x516C;&#x684C;&#x8D70;&#x6765;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x54E5;&#x4EEC;&#x5305;&#x62EC;&#x674E;MM&#x90FD;&#x7AD9;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x5C31;&#x8FD9;&#x4E48;&#x50BB;&#x770B;&#x7740;&#x8FD9;&#x4E2A;&#x5973;&#x8B66;&#x5BDF;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x8D70;&#x5230;&#x6211;&#x8DDF;&#x524D;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x7591;&#x60D1;&#x7684;&#x773C;&#x795E;&#x4E92;&#x76F8;&#x4EA4;&#x4E92;&#x7740;&#xFF0C;&#x6709;&#x4E2A;&#x54E5;&#x4EEC;&#x5B9E;&#x5728;&#x5FCD;&#x4E0D;&#x4F4F;&#x4E86;&#x3002;&#x5C31;&#x95EE;&#x674E;MM&#xFF1A;&#x201C;&#x5C0F;&#x738B;&#xFF0C;&#x72AF;&#x4EC0;&#x4E48;&#x4E8B;&#x513F;&#x5566;&#xFF1F;&#x201D;&#x674E;MM&#x5C31;&#x6447;&#x5934;&#xFF0C;&#x867D;&#x7136;&#x4ED6;&#x6545;&#x610F;&#x538B;&#x4F4E;&#x58F0;&#x97F3;&#xFF0C;&#x4F46;&#x6211;&#x8FD8;&#x662F;&#x542C;&#x89C1;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x9760;&#xFF0C;&#x8FD9;&#x4E2A;&#x9ED1;&#x9505;&#x53EF;&#x80CC;&#x4E0D;&#x5F97;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5404;&#x4F4D;&#xFF0C;&#x8FD9;&#x4F4D;&#x662F;&#x6797;&#x8B66;&#x5B98;&#xFF0C;&#x627E;&#x6211;&#x662F;&#x5E2E;&#x4ED6;&#x4EEC;&#x5199;&#x7A0B;&#x5E8F;&#x7684;&#x3002;&#x201D;&#x6211;&#x5927;&#x58F0;&#x8BF4;&#x3002;&#x6211;&#x4E00;&#x8BF4;&#x5B8C;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x201C;&#x5207;&#x201D;&#x7684;&#x4E00;&#x8EAB;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x7B11;&#x51E0;&#x58F0;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x7F29;&#x5230;&#x81EA;&#x5DF1;&#x684C;&#x5B50;&#x4E0A;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x542C;&#x89C1;&#x6211;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x663E;&#x7136;&#x660E;&#x767D;&#x8FC7;&#x6765;&#xFF0C;&#x5979;&#x8BD5;&#x56FE;&#x626D;&#x5934;&#x7ED9;&#x5927;&#x5BB6;&#x89E3;&#x91CA;&#xFF0C;&#x4F46;&#x662F;&#x5979;&#x56DE;&#x5934;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x4EBA;&#x5934;&#x90FD;&#x6CA1;&#x770B;&#x89C1;&#x3002;&#x5979;&#x5634;&#x5DF4;&#x52A8;&#x52A8;&#xFF0C;&#x7B11;&#x7B11;&#xFF0C;&#x628A;&#x8BDD;&#x541E;&#x56DE;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5509;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x597D;&#x4E0B;&#x5348;&#x4E0B;&#x73ED;&#x540E;&#x5417;&#xFF0C;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x65E9;&#x5C31;&#x6765;&#x4E86;&#x3002;&#x201D;&#x6211;&#x8D76;&#x7D27;&#x62DB;&#x547C;&#x5979;&#x5750;&#x4E0B;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6848;&#x4EF6;&#x4E0D;&#x7B49;&#x4EBA;&#x5440;&#xFF0C;&#x8D8A;&#x65E9;&#x8D8A;&#x597D;&#x5440;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x7ED9;&#x4F60;&#x4EEC;&#x5934;&#x6253;&#x8FC7;&#x62DB;&#x547C;&#x4E86;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x5E2E;&#x6211;&#x4EEC;&#x3002;&#x201D;&#x5C0F;&#x6797;&#x7B11;&#x7740;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x5979;&#x663E;&#x7136;&#x5BF9;&#x6211;&#x8BF4;&#x8BDD;&#x968F;&#x4FBF;&#x591A;&#x4E86;&#x3002;&#x5982;&#x679C;&#x8BF4;&#x4E0A;&#x6B21;&#x5B8C;&#x5168;&#x662F;&#x6000;&#x7591;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x4FE1;&#x4EFB;&#x7684;&#x6001;&#x5EA6;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5211;&#x8B66;&#x961F;&#x7684;&#x9762;&#x5B50;&#x5C31;&#x662F;&#x5927;&#xFF0C;&#x96BE;&#x602A;&#x521A;&#x624D;&#x5934;&#x513F;&#x7ED9;&#x6211;&#x8BF4;&#x3002;&#x96BE;&#x602A;&#xFF0C;&#x5979;&#x73B0;&#x5728;&#x5C31;&#x76F4;&#x63A5;&#x6765;&#x627E;&#x6211;&#x3002;&#x770B;&#x6765;&#x4ED6;&#x4EEC;&#x548C;&#x6211;&#x4EEC;&#x90E8;&#x957F;&#x7684;&#x5173;&#x7CFB;&#x4E0D;&#x4E00;&#x822C;&#x3002;<br>&#x3000;&#x3000;&#x90E8;&#x957F;&#x90FD;&#x53D1;&#x8BDD;&#x4E86;&#xFF0C;&#x6211;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x8BF4;&#x7684;&#x5462;&#x3002;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x53C8;&#x8F7B;&#x677E;&#xFF0C;&#x662F;&#x4E2A;&#x7F8E;&#x5DEE;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x7A0B;&#x5E8F;&#x5199;&#x597D;&#x6CA1;&#x6709;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;ok&#x4E86;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5C31;copy&#x7ED9;&#x4F60;&#xFF1F;&#x201D;&#x6211;&#x7684;&#x624B;&#x6478;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x952E;&#x76D8;&#x4E0A;&#x5F00;&#x59CB;&#x6572;&#x51FB;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4E0D;&#xFF0C;&#x8FD8;&#x662F;&#x4F60;&#x8DDF;&#x6211;&#x8D70;&#x4E00;&#x8D9F;&#x5427;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x6655;&#xFF0C;&#x5F53;&#x6211;&#x662F;&#x72AF;&#x4EBA;&#x5440;&#xFF0C;&#x8DDF;&#x4F60;&#x8D70;&#x4E00;&#x8D9F;&#xFF0C;&#x6211;&#x5DEE;&#x70B9;&#x7B11;&#x51FA;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x5230;&#x6211;&#x4F3C;&#x7B11;&#x975E;&#x7B11;&#x7684;&#x773C;&#x795E;&#x3002;&#x6797;&#x8B66;&#x5B98;&#x7ACB;&#x523B;&#x5C31;&#x660E;&#x767D;&#x8FC7;&#x6765;&#x3002;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x5730;&#x7B11;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5BF9;&#x4E0D;&#x8D77;&#xFF0C;&#x804C;&#x4E1A;&#x4E60;&#x60EF;&#x3002;&#x6211;&#x7684;&#x610F;&#x601D;&#x662F;&#x4F60;&#x548C;&#x6211;&#x4E00;&#x8D77;&#x5230;&#x6211;&#x4EEC;&#x673A;&#x623F;&#x53BB;&#x5B89;&#x88C5;&#x8C03;&#x8BD5;&#xFF0C;&#x7701;&#x5F97;&#x9EBB;&#x70E6;&#x3002;&#x597D;&#x5417;&#xFF1F;&#x201C;<br>&#x3000;&#x3000;&#x90E8;&#x957F;&#x90FD;&#x8BF4;&#x8BDD;&#x4E86;&#xFF0C;&#x6211;&#x8FD8;&#x80FD;&#x8BF4;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x51FA;&#x53BB;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x5211;&#x8B66;&#x961F;&#x7684;&#x673A;&#x623F;&#x4E5F;&#x597D;&#xFF0C;&#x6211;&#x4E5F;&#x6EE1;&#x597D;&#x5947;&#x7684;&#x3002;&#x5211;&#x8B66;&#x961F;&#x7684;&#x4EBA;&#x7A7F;&#x7740;&#x8B66;&#x670D;&#x641E;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD8;&#x771F;&#x7684;&#x597D;&#x7279;&#x522B;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x5E76;&#x6392;&#x8D70;&#x7740;&#xFF0C;&#x6CA1;&#x8BF4;&#x8BDD;&#x3002;&#x6211;&#x8D70;&#x7684;&#x5FEB;&#xFF0C;&#x8D85;&#x8FC7;&#x4E86;&#x5979;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x5979;&#x6025;&#x6025;&#x7684;&#x8DDF;&#x3002;<br>&#x3000;&#x3000;&#x51FA;&#x5927;&#x95E8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x95E8;&#x536B;&#x5C45;&#x7136;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x786E;&#x5207;&#x7684;&#x8BF4;&#x662F;&#x770B;&#x7740;&#x6211;&#x4EEC;&#xFF0C;&#x5C45;&#x7136;&#x6CA1;&#x6709;&#x95EE;&#x6211;&#x8981;&#x51FA;&#x5165;&#x8BC1;&#x3002;&#x8981;&#x77E5;&#x9053;&#x975E;&#x5178;&#x65F6;&#x671F;&#xFF0C;&#x6211;&#x4EEC;&#x51FA;&#x5165;&#x5C31;&#x662F;&#x90E8;&#x957F;&#x90FD;&#x662F;&#x8981;&#x51FA;&#x5165;&#x8BC1;&#x7684;&#x3002;&#x4F55;&#x51B5;&#x662F;&#x6211;&#xFF1F;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#x4ECA;&#x5929;&#xFF0C;&#x90A3;&#x4E2A;&#x5BB6;&#x4F19;&#x5C31;&#x662F;&#x6CA1;&#x95EE;&#x6211;&#x8981;&#xFF0C;&#x4ED6;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x8B66;&#x5BDF;&#x8DDF;&#x5728;&#x540E;&#x9762;&#xFF0C;&#x5F53;&#x7136;&#x4ED6;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#x95E8;&#x5916;&#x7684;&#x8B66;&#x8F66;&#x3002;<br>&#x3000;&#x3000;&#x5F53;&#x6211;&#x770B;&#x5230;&#x8B66;&#x8F66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x56DE;&#x5473;&#x95E8;&#x536B;&#x7684;&#x773C;&#x795E;&#xFF0C;&#x6211;&#x7ACB;&#x523B;&#x660E;&#x767D;&#x8FC7;&#x6765;&#xFF0C;&#x611F;&#x60C5;&#x90A3;&#x4E2A;&#x5B59;&#x5B50;&#x771F;&#x662F;&#x4EE5;&#x4E3A;&#x6211;&#x72AF;&#x4E86;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x4E2A;&#x8B66;&#x5BDF;&#x662F;&#x6765;&#x6293;&#x6211;&#x7684;&#x5427;&#xFF1F;<br>&#x3000;&#x3000;&#x9760;&#xFF01;&#x778E;&#x4E86;&#x4F60;&#x7684;&#x72D7;&#x773C;&#xFF0C;&#x6211;&#x53EF;&#x662F;&#x8B66;&#x5BDF;&#x8BF7;&#x6211;&#x53BB;&#x7684;&#x3002;&#x6211;&#x5DEE;&#x70B9;&#x7B11;&#x51FA;&#x6765;&#x3002;&#x54C8;&#x54C8;&#x3002;<br>&#x3000;&#x3000;&#x4E0A;&#x4E86;&#x8F66;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x662F;&#xFF1A;&#x201D;&#x4EE5;&#x540E;&#x4F60;&#x6765;&#x627E;&#x6211;&#xFF0C;&#x4E0D;&#x8981;&#x7A7F;&#x8B66;&#x670D;&#x884C;&#x5417;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;MM&#x6123;&#x4E86;&#x5927;&#x7EA6;10&#x79D2;&#x949F;&#xFF0C;&#x7136;&#x540E;&#x54C8;&#x54C8;&#x54C8;&#x5927;&#x7B11;&#x8D77;&#x6765;&#x3002;&#x7B11;&#x5F97;&#x4F0F;&#x5230;&#x65B9;&#x5411;&#x76D8;&#x4E0A;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x5982;&#x6B64;&#x5927;&#x7B11;&#xFF0C;&#x611F;&#x89C9;&#x8FD9;&#x624D;&#x662F;&#x4E00;&#x4E2A;&#x5973;&#x751F;&#x561B;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x89C9;&#x5F97;&#x5979;&#x4E0D;&#x662F;&#x8B66;&#x5BDF;&#x3002;&#x770B;&#x5979;&#x7B11;&#x7684;&#x90A3;&#x4E48;&#x5F00;&#x5FC3;&#xFF0C;&#x6211;&#x4E5F;&#x8DDF;&#x7740;&#x50BB;&#x7B11;&#x3002;&#x5979;&#x7B11;&#x7684;&#x6108;&#x53D1;&#x5389;&#x5BB3;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x53BB;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x9014;&#x4E2D;&#xFF0C;&#x5C0F;&#x6797;MM&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x53C8;&#x4F1A;&#x770B;&#x6211;&#x4E00;&#x773C;&#x3002;&#x6211;&#x5C31;&#x6545;&#x610F;&#x77AA;&#x5979;&#xFF0C;&#x5979;&#x5C31;&#x770B;&#x7740;&#x524D;&#x9762;&#x62BF;&#x5634;&#x7B11;&#x3002;</p>
<p>&#x516C;&#x5B89;&#x5C40;&#x7684;&#x529E;&#x516C;&#x5927;&#x697C;&#x4FEE;&#x7684;&#x6C14;&#x6D3E;&#x90A3;&#x662F;&#x8DEF;&#x4EBA;&#x7686;&#x77E5;&#x7684;&#x3002;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x5916;&#x9762;&#x770B;&#xFF0C;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x66FE;&#x8FDB;&#x6765;&#x8FC7;&#x3002;&#x73B0;&#x5728;&#x8FDB;&#x6765;&#x4E86;&#xFF0C;&#x770B;&#x5230;&#x5168;&#x662F;&#x7A7F;&#x8B66;&#x670D;&#x7684;&#xFF0C;&#x5C31;&#x6211;&#x4E00;&#x4E2A;&#x4FBF;&#x88C5;&#x3002;&#x8FD8;&#x771F;&#x662F;&#x6D51;&#x8EAB;&#x90FD;&#x4E0D;&#x81EA;&#x5728;&#x3002;&#x4E0A;&#x4E86;&#x7535;&#x68AF;&#xFF0C;&#x76F4;&#x63A5;&#x5C31;&#x5954;&#x9876;&#x6402;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x7535;&#x68AF;&#x5C31;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x5B64;&#x7537;&#x5BE1;&#x5973;&#x7684;&#xFF0C;&#x6211;&#x66F4;&#x52A0;&#x4E0D;&#x81EA;&#x5728;&#x3002;<br>&#x3000;&#x3000;&#x80E1;&#x4E71;&#x8BF4;&#x7740;&#xFF1A;&#x201C;&#x4F60;&#x4EEC;&#x4F4F;&#x8FD9;&#x4E48;&#x9AD8;&#xFF0C;&#x771F;&#x662F;&#x5E78;&#x798F;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x8C03;&#x4F83;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x5C31;&#x7B11;&#x3002;&#x6211;&#x4EE5;&#x524D;&#x600E;&#x4E48;&#x6CA1;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x6797;&#x8B66;&#x5B98;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x7231;&#x7B11;&#x3002;&#x96BE;&#x9053;&#x6211;&#x771F;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x641E;&#x7B11;&#x7684;&#x4EBA;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x5F88;&#x5FEB;&#x5C31;&#x5230;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x3002;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x5B66;30&#x51E0;&#x5C81;&#x7684;&#x4EBA;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x50CF;&#x8B66;&#x5BDF;&#xFF0C;&#x50CF;&#x4E2A;&#x5927;&#x5B66;&#x6559;&#x5E08;&#x3002;&#x70ED;&#x60C5;&#x7684;&#x62DB;&#x547C;&#x6211;&#x4EEC;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x674E;&#x79D1;&#x957F;&#x3002;&#x201D;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x70ED;&#x60C5;&#x7684;&#x4ECB;&#x7ECD;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x4F4D;&#x662F;&#x67D0;&#x67D0;&#x90E8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x9AD8;&#x624B;&#xFF0C;&#x5C0F;&#x738B;&#x3002;&#x201D;&#x5979;&#x4ECB;&#x7ECD;&#x6211;&#x7684;&#x65F6;&#x5019;&#x6545;&#x610F;&#x628A;&#x9AD8;&#x624B;&#x4E24;&#x4E2A;&#x5B57;&#x8BF4;&#x7684;&#x5F88;&#x91CD;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x77AA;&#x4E86;&#x5979;&#x4E00;&#x773C;&#xFF0C;&#x5979;&#x5C31;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8D76;&#x7D27;&#x548C;&#x674E;&#x79D1;&#x957F;&#x70ED;&#x60C5;&#x7684;&#x63E1;&#x624B;&#x3002;<br>&#x3000;&#x3000;&#x674E;&#x79D1;&#x957F;&#x975E;&#x5E38;&#x70ED;&#x60C5;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5C0F;&#x6797;&#xFF0C;&#x4F60;&#x5E26;&#x5C0F;&#x738B;&#x5230;&#x6211;&#x4EEC;&#x673A;&#x623F;&#x53BB;&#x89E3;&#x5BC6;&#x5427;&#x3002;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x8BBE;&#x5907;&#xFF0C;&#x4F60;&#x8C03;&#x5C31;&#x662F;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5168;&#x529B;&#x652F;&#x6301;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x624D;&#x770B;&#x5230;&#x529E;&#x516C;&#x5BA4;&#x7684;&#x724C;&#x5B50;&#xFF1A;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x79D1;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6700;&#x6015;&#x548C;&#x5F53;&#x5B98;&#x7684;&#x4EBA;&#x6253;&#x4EA4;&#x9053;&#x3002;&#x5C3D;&#x7BA1;&#x4EBA;&#x5BB6;&#x674E;&#x79D1;&#x957F;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x53EF;&#x4EB2;&#xFF0C;&#x800C;&#x4E14;&#x611F;&#x89C9;&#x6BD4;&#x8F83;&#x5112;&#x96C5;&#x3002;&#x4F46;&#x662F;&#x6211;&#x5C31;&#x662F;&#x4E0D;&#x81EA;&#x5728;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x8D70;&#x5ECA;&#x4E0A;&#xFF0C;&#x6211;&#x81EA;&#x5728;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5509;&#xFF0C;&#x9EBB;&#x70E6;&#x4F60;&#x4EE5;&#x540E;&#x4E0D;&#x8981;&#x4ECB;&#x7ECD;&#x6211;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x9AD8;&#x624B;&#x597D;&#x4E0D;&#x597D;&#xFF1F;&#x201D;&#x6211;&#x65E0;&#x8F9C;&#x7684;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x90A3;&#x4ECB;&#x7ECD;&#x4F60;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x4E0D;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x9AD8;&#x624B;&#x5417;&#xFF1F;&#x201D;&#x5C0F;&#x6797;&#x4E50;&#x5F00;&#x4E86;&#x82B1;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x662F;&#x3002;&#x6211;&#x5C31;&#x662F;&#x5C0F;&#x738B;&#x3002;ok&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x8FD8;&#x662F;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x4EEC;&#x90A3;&#x4E2A;&#x674E;&#x79D1;&#x957F;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x50CF;&#x8B66;&#x5BDF;&#x3002;&#x201D;&#x6211;&#x5F00;&#x59CB;&#x8F6C;&#x79FB;&#x8BDD;&#x9898;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x4ED6;&#x662F;&#x6211;&#x4EEC;&#x516C;&#x5B89;&#x5C40;&#x6587;&#x51ED;&#x6700;&#x9AD8;&#x7684;&#xFF0C;&#x67D0;&#x67D0;&#x5927;&#x5B66;&#x7684;&#x535A;&#x58EB;&#x3002;&#x641E;&#x7F51;&#x7EDC;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x5929;&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x6709;&#x4E00;&#x62FC;&#x3002;&#x770B;&#x6765;&#x516C;&#x5B89;&#x5C40;&#x8FD8;&#x662F;&#x6709;&#x4EBA;&#x624D;&#x561B;&#x3002;&#x6211;&#x5410;&#x5410;&#x820C;&#x5934;&#x3002;<br>&#x3000;&#x3000;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x516C;&#x5B89;&#x5C40;&#x5728;&#x6211;&#x5FC3;&#x91CC;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x5FC3;&#x91CC;&#xFF0C;&#x90FD;&#x662F;&#x8BA4;&#x4E3A;&#x90FD;&#x662F;&#x4E9B;&#x201C;&#x7C97;&#x4EBA;&#x201D;&#x7EC4;&#x6210;&#x7684;&#x3002;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x9000;&#x4F0D;&#x519B;&#x4EBA;&#xFF0C;&#x8B66;&#x6821;&#x6BD5;&#x4E1A;&#x751F;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x6211;&#x5C45;&#x7136;&#x9047;&#x5230;&#x7684;&#x5C31;&#x662F;&#x4E2A;&#x540D;&#x724C;&#x5927;&#x5B66;&#x7684;&#x535A;&#x58EB;&#x3002;&#x96BE;&#x602A;&#x6211;&#x89C9;&#x5F97;&#x4ED6;&#x4E0D;&#x50CF;&#x8B66;&#x5BDF;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4E0D;&#x50CF;&#x6211;&#x5FC3;&#x4E2D;&#x7684;&#x8B66;&#x5BDF;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x5728;&#x53D8;&#x5316;&#xFF0C;&#x56FD;&#x5BB6;&#x4E5F;&#x5728;&#x53D8;&#xFF0C;&#x516C;&#x5B89;&#x5C40;&#x4E5F;&#x5728;&#x53D8;&#x3002;&#x540E;&#x6765;&#x6211;&#x624D;&#x77E5;&#x9053;&#x516C;&#x5B89;&#x5C40;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x85CF;&#x9F99;&#x5367;&#x864E;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x5DF2;&#x7ECF;&#x5230;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x673A;&#x623F;&#x3002;&#x95E8;&#x53E3;&#x6302;&#x7740;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x79D1;1&#x673A;&#x623F;&#x7684;&#x724C;&#x5B50;&#xFF0C;&#x65C1;&#x8FB9;&#x8FD8;&#x6709;&#x4E2A;&#x8B66;&#x544A;&#xFF1A;&#x673A;&#x623F;&#x91CD;&#x5730;&#xFF0C;&#x95F2;&#x4EBA;&#x514D;&#x8FDB;&#x3002;<br>&#x3000;&#x3000;&#x8FDB;&#x53BB;&#x4E00;&#x770B;&#xFF0C;&#x770B;&#x5230;&#x4E00;&#x6E9C;&#x7684;&#x8054;&#x60F3;&#x53F0;&#x5F0F;&#x673A;&#x5668;&#xFF0C;&#x684C;&#x4E0A;&#x770B;&#x5230;&#x4E00;&#x6E9C;&#x7684;IBM&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x6E9C;&#x7684;&#x4EBA;&#x5750;&#x5728;&#x81EA;&#x5DF1;&#x684C;&#x5B50;&#x524D;&#x9762;&#x5728;&#x64CD;&#x4F5C;&#x7740;&#x3002;&#x53C8;&#x770B;&#x4E86;&#x770B;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x5728;&#x4E0A;&#x7F51;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x5728;&#x5206;&#x6790;&#x7A0B;&#x5E8F;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x5728;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD8;&#x6709;&#x4E9B;&#x4EBA;&#x5728;&#x8C03;&#x8BD5;&#x75C5;&#x6BD2;&#x3002;&#x8FD9;&#x4E9B;&#x6211;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x6211;&#x4E00;&#x770B;&#x5C31;&#x770B;&#x51FA;&#x6765;&#x3002;&#x90A3;&#x4E2A;&#x8C03;&#x8BD5;&#x75C5;&#x6BD2;&#x7684;&#x4EBA;&#x4E0D;&#x505C;&#x7684;&#x5728;&#x4E00;&#x8FB9;&#x8DDF;&#x8E2A;&#xFF0C;&#x4E00;&#x8FB9;&#x663E;&#x793A;&#x6548;&#x679C;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x8FDB;&#x53BB;&#x540E;&#xFF0C;&#x91CC;&#x9762;&#x90FD;&#x662F;&#x4E9B;&#x7537;&#x8B66;&#x5BDF;&#xFF0C;&#x53EA;&#x88C5;&#x886C;&#x8863;&#xFF0C;&#x5916;&#x8863;&#x90FD;&#x6302;&#x5728;&#x540E;&#x9762;&#x7684;&#x6905;&#x5B50;&#x4E0A;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x540C;&#x5979;&#x6253;&#x54C8;&#x54C8;&#x3002;&#x5F00;&#x73A9;&#x7B11;&#x3002;&#x8FD9;&#x4E2A;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x5973;&#x5B69;&#x5B50;&#x5728;&#x529E;&#x516C;&#x5BA4;&#x90FD;&#x662F;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x3002;&#x5C24;&#x5176;&#x662F;&#x7537;&#x5973;&#x6BD4;&#x4F8B;&#x4E25;&#x91CD;&#x4E0D;&#x5E73;&#x8861;&#x7684;&#x65F6;&#x5019;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x548C;&#x4ED6;&#x4EEC;&#x8BF4;&#x7B11;&#x4E00;&#x4F1A;&#x513F;&#x4E4B;&#x540E;&#xFF0C;&#x6307;&#x7740;&#x6211;&#x5927;&#x58F0;&#x8BF4;&#xFF1A;&#x201C;&#x8FD9;&#x4F4D;&#x662F;&#x6211;&#x8BF7;&#x6765;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x89E3;&#x5BC6;&#x9AD8;&#x624B;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x6765;&#x89E3;&#x90A3;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5BC6;&#x7801;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x72E0;&#x72E0;&#x7684;&#x77AA;&#x4E86;&#x5979;&#x4E00;&#x773C;&#xFF0C;&#x4F46;&#x662F;&#x5DF2;&#x7ECF;&#x665A;&#x4E86;&#xFF0C;&#x51E0;&#x4E2A;&#x5927;&#x8001;&#x7237;&#x4EEC;&#x7684;&#x773C;&#x775B;&#x50CF;&#x5200;&#x5B50;&#x4E00;&#x6837;&#x5237;&#x5237;&#x7684;&#x5C31;&#x5411;&#x6211;&#x98DE;&#x8FC7;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x540C;&#x884C;&#x662F;&#x51A4;&#x5BB6;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x3002;&#x8FD9;&#x51E0;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x4E13;&#x95E8;&#x641E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x3002;&#x800C;&#x4E14;&#x662F;&#x5728;&#x516C;&#x5B89;&#x5C40;&#x91CC;&#x9762;&#x3002;&#x672C;&#x6765;&#x5C31;&#x725B;&#x7684;&#x8981;&#x547D;&#x3002;&#x73B0;&#x5728;&#x5C45;&#x7136;&#x6709;&#x4EBA;&#x516C;&#x5F00;&#x5230;&#x8FD9;&#x91CC;&#x53EB;&#x677F;&#xFF0C;&#x800C;&#x4E14;&#x5F53;&#x7740;MM&#x7684;&#x9762;&#xFF0C;&#x4F60;&#x8BF4;&#x4ED6;&#x4EEC;&#x5FC3;&#x91CC;&#x80FD;&#x597D;&#x53D7;&#x5417;&#xFF1F;&#x5FC3;&#x91CC;&#x4E0D;&#x8212;&#x670D;&#xFF0C;&#x76EE;&#x5149;&#x80FD;&#x53CB;&#x5584;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x522B;&#x542C;&#x6797;&#x8B66;&#x5B98;&#x778E;&#x5439;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x6765;&#x5B66;&#x4E60;&#x7684;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x9886;&#x5BFC;&#x8BA9;&#x6211;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x542C;&#x4E0D;&#x884C;&#x5440;&#xFF0C;&#x6211;&#x6BD4;&#x5404;&#x4F4D;&#x5DEE;&#x8FDC;&#x4E86;&#x3002;&#x5475;&#x5475;&#x3002;&#x201D;&#x6211;&#x50BB;&#x7B11;&#x7740;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x7684;&#x76EE;&#x5149;&#x53CB;&#x5584;&#x4E9B;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x5F00;&#x59CB;&#x6253;&#x7740;&#x54C8;&#x54C8;&#x3002;<br>&#x3000;&#x3000;&#x62BD;&#x7A7A;&#x6211;&#x518D;&#x6B21;&#x6076;&#x72E0;&#x72E0;&#x77AA;&#x4E86;&#x5C0F;&#x6797;&#x4E00;&#x773C;&#x3002;&#x4F46;&#x662F;&#x5979;&#x88C5;&#x4F5C;&#x6CA1;&#x770B;&#x5230;&#x3002;&#x62BF;&#x5634;&#x7B11;&#x7740;&#x770B;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x53BB;&#x4E86;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter4.html" class="navigation navigation-prev " aria-label="Previous page: 第四章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter6.html" class="navigation navigation-next " aria-label="Next page: 第六章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第五章","level":"1.6","depth":1,"next":{"title":"第六章","level":"1.7","depth":1,"path":"chapter6.md","ref":"chapter6.md","articles":[]},"previous":{"title":"第四章","level":"1.5","depth":1,"path":"chapter4.md","ref":"chapter4.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter5.md","mtime":"2017-02-27T04:03:13.426Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

