
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第七章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter8.html" />
    
    
    <link rel="prev" href="chapter6.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第七章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6211;&#x548C;&#x5C0F;&#x654F;&#x7684;&#x6545;&#x4E8B;">&#x6211;&#x548C;&#x5C0F;&#x654F;&#x7684;&#x6545;&#x4E8B;</h2>
<p>&#x7B2C;&#x4E00;&#x6B21;&#x89C1;&#x5230;&#x5C0F;&#x654F;&#x662F;&#x5728;&#x8BFB;&#x7814;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6211;&#x81F3;&#x4ECA;&#x975E;&#x5E38;&#x6000;&#x5FF5;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5149;&#x3002;&#x73B0;&#x5728;&#x6211;&#x6709;&#x65F6;&#x5019;&#x5230;&#x6211;&#x4EEC;&#x54E5;&#x4EEC;&#x6240;&#x5728;&#x7684;&#x5927;&#x5B66;&#x91CC;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x770B;&#x5230;&#x5468;&#x672B;&#x8349;&#x5730;&#x4E0A;&#x4E09;&#x4E09;&#x4E24;&#x4E24;&#x7684;&#x7537;&#x5B69;&#x5B50;&#x5973;&#x5B69;&#x5B50;&#xFF0C;&#x6211;&#x5C31;&#x65E0;&#x9650;&#x7684;&#x611F;&#x6168;&#xFF0C;&#x771F;&#x7684;&#xFF0C;&#x6211;&#x5C31;&#x60F3;&#x8D77;&#x90A3;&#x9996;&#x6C88;&#x5E86;&#x7684;&#x300A;&#x9752;&#x6625;&#x300B;&#x548C;&#x8001;&#x72FC;&#x7684;&#x300A;&#x540C;&#x684C;&#x7684;&#x4F60;&#x300B;&#x3002;&#x6211;&#x60F3;&#x8D77;&#x6211;&#x7684;&#x9752;&#x6625;&#xFF0C;&#x6211;&#x7FA1;&#x6155;&#x8FD9;&#x4E9B;&#x5355;&#x7EAF;&#x7684;&#x5145;&#x6EE1;&#x671D;&#x6C14;&#x7684;&#x5B66;&#x5F1F;&#x5B66;&#x59B9;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x5B66;&#x6821;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x662F;&#x4E2A;&#x5E76;&#x4E0D;&#x8D77;&#x773C;&#xFF0C;&#x5916;&#x8868;&#x51B7;&#x6F20;&#x7684;&#x4EBA;&#x3002;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4E0D;&#x77E5;&#x9053;&#x5706;&#x6ED1;&#x662F;&#x4F55;&#x7269;&#x3002;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x9760;&#x611F;&#x89C9;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x522B;&#x7684;&#x7231;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E24;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x662F;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x4E0A;&#x673A;&#xFF0C;&#x770B;&#x8BA1;&#x7B97;&#x673A;&#x65B9;&#x9762;&#x7684;&#x4E66;&#x7C4D;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x662F;&#x6211;&#x7684;&#x4E13;&#x4E1A;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x662F;&#x7B97;&#x597D;&#x4E8B;&#x60C5;&#x3002;<br>&#x3000;&#x3000;&#x53E6;&#x4E00;&#x4EF6;&#x5C31;&#x662F;&#x5F39;&#x5409;&#x4ED6;&#x5531;&#x6B4C;&#xFF0C;&#x73B0;&#x5728;&#x7684;&#x5409;&#x4ED6;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x4E0A;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x59D0;&#x59D0;&#x7ED9;&#x4E70;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x548C;&#x5C0F;&#x654F;&#x7684;&#x4EA4;&#x53C9;&#x70B9;&#x53EA;&#x53EF;&#x80FD;&#x548C;&#x8FD9;&#x4E24;&#x4EF6;&#x4E8B;&#x60C5;&#x6709;&#x5173;&#x3002;<br>&#x3000;&#x3000;&#x7B2C;&#x4E00;&#x6B21;&#x89C1;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7CFB;&#x548C;&#x533B;&#x5B66;&#x9662;&#x7684;&#x67D0;&#x7CFB;&#x641E;&#x8054;&#x6B22;&#x665A;&#x4F1A;&#xFF0C;&#x5927;&#x5B66;&#x91CC;&#x9762;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x5F88;&#x5E73;&#x5E38;&#x3002;&#x51E0;&#x4E4E;&#x6BCF;&#x5468;&#x90FD;&#x6709;&#x4E0D;&#x540C;&#x7CFB;&#x7684;&#x665A;&#x4F1A;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7684;&#x5409;&#x4ED6;&#x5F39;&#x5531;&#x662F;&#x6211;&#x4EEC;&#x620F;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x8282;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x665A;&#x4F1A;&#x524D;&#x4E00;&#x5929;&#x5230;&#x5927;&#x793C;&#x5802;&#x5F69;&#x6392;&#x3002;&#x5F53;&#x7136;&#x5979;&#x4EEC;&#x7CFB;&#x7684;&#x8282;&#x76EE;&#x4E5F;&#x662F;&#x4E00;&#x8D77;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5B66;&#x91CC;&#x9762;&#x7684;&#x665A;&#x4F1A;&#x8D28;&#x91CF;&#x771F;&#x662F;&#x63A7;&#x5236;&#x5F88;&#x4E25;&#x683C;&#x7684;&#xFF0C;&#x4EBA;&#x624D;&#x592A;&#x591A;&#x3002;&#x4E00;&#x5207;&#x90FD;&#x975E;&#x5E38;&#x6B63;&#x89C4;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x5927;&#x5BB6;&#x90FD;&#x4E0A;&#x53F0;&#x5B9E;&#x9645;&#x7684;&#x8D70;&#x4E00;&#x6B21;&#xFF0C;&#x4E0D;&#x5408;&#x683C;&#x7684;&#x4F1A;&#x88AB;&#x53D6;&#x6D88;&#x6B63;&#x5F0F;&#x8868;&#x6F14;&#x7684;&#x8D44;&#x683C;&#x3002;&#x5C0F;&#x654F;&#x662F;&#x5F53;&#x65F6;&#x7684;&#x8BC4;&#x59D4;&#x4E4B;&#x4E00;&#xFF0C;&#x8BC4;&#x59D4;&#x90FD;&#x662F;&#x5B66;&#x751F;&#x5E72;&#x90E8;&#x7EC4;&#x6210;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5F53;&#x65F6;&#x62B1;&#x7740;&#x6211;&#x7684;&#x5409;&#x4ED6;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x58EB;&#x5175;&#x62B1;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x67AA;&#x4E00;&#x6837;&#x5750;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x4E0A;&#x3002;&#x6211;&#x51B7;&#x51B7;&#x7684;&#x770B;&#x7740;&#x53F0;&#x4E0A;&#x7A7F;&#x68AD;&#x7684;&#x8282;&#x76EE;&#xFF0C;&#x8FD8;&#x6709;&#x5FD9;&#x788C;&#x7684;&#x5E03;&#x666F;&#x7684;&#x540C;&#x5B66;&#x3002;&#x524D;&#x9762;&#x7684;&#x8282;&#x76EE;&#x5F88;&#x7CBE;&#x5F69;&#x3002;&#x4F46;&#x662F;&#x6211;&#x8FDE;&#x624B;&#x90FD;&#x6CA1;&#x6709;&#x62CD;&#x4E00;&#x4E0B;&#x3002;&#x600E;&#x4E48;&#x5F62;&#x5BB9;&#x5F53;&#x65F6;&#x6211;&#x7684;&#x6837;&#x5B50;&#x5462;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x7A7F;&#x7684;&#x4E00;&#x8EAB;&#x7684;&#x725B;&#x4ED4;&#x670D;&#xFF0C;&#x5934;&#x53D1;&#x6709;&#x70B9;&#x5FAE;&#x5FAE;&#x4E71;&#xFF0C;&#x4EBA;&#x7626;&#x7626;&#x7684;&#xFF0C;&#x5F88;&#x6709;&#x8F6E;&#x5ED3;&#x611F;&#xFF0C;&#x8FD8;&#x6234;&#x4E2A;&#x58A8;&#x955C;&#x3002;&#x53CD;&#x6B63;&#x6211;&#x5C31;&#x559C;&#x6B22;&#x5409;&#x4ED6;&#x5F39;&#x5531;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5176;&#x4ED6;&#x8282;&#x76EE;&#x6211;&#x90FD;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x6211;&#x60F3;&#x5927;&#x5BB6;&#x80FD;&#x770B;&#x51FA;&#x5F53;&#x65F6;&#x6211;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x9E1F;&#x201D;&#x4EBA;&#xFF0C;&#x85D0;&#x89C6;&#x4E00;&#x5207;&#xFF0C;&#x51B7;&#x51B7;&#x6253;&#x91CF;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;&#x7528;&#x73B0;&#x5728;&#x7684;&#x8BDD;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x88C5;cool&#xFF01;&#x5475;&#x5475;&#x3002;&#x5BF9;&#xFF0C;&#x5C31;&#x662F;&#x88C5;cool&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x65F6;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x88C5;&#x51FA;&#x6765;&#xFF0C;&#x7EDD;&#x5BF9;&#x5C31;&#x662F;&#x9AA8;&#x5B50;&#x91CC;&#x9762;&#x6D41;&#x9732;&#x51FA;&#x6765;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x4E8E;&#x662F;&#x5F88;&#x5FEB;&#x5C31;&#x5230;&#x6211;&#x4E86;&#xFF0C;&#x6211;&#x542C;&#x5230;&#x6211;&#x4EEC;&#x7CFB;&#x7684;&#x6587;&#x5A31;&#x90E8;&#x957F;&#x558A;&#x6211;&#x7684;&#x540D;&#x5B57;&#x3002;&#x5927;&#x5BB6;&#x624D;&#x6CE8;&#x610F;&#x5230;&#x8FD8;&#x6709;&#x6211;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;<br>&#x3000;&#x3000;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x5C31;&#x62B1;&#x7740;&#x6211;&#x7684;&#x5409;&#x4ED6;&#x4E0A;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x9762;&#xFF0C;&#x5F39;&#x5409;&#x4ED6;&#x662F;&#x5F88;&#x65F6;&#x9AE6;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x3002;&#x5E94;&#x8BE5;&#x5F88;&#x8BA8;&#x5973;&#x5B69;&#x5B50;&#x7684;&#x559C;&#x6B22;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x53CD;&#x6B63;&#x5927;&#x5B66;&#x7684;&#x5973;&#x751F;&#x6CA1;&#x51E0;&#x4E2A;&#x4E0D;&#x559C;&#x6B22;&#x542C;&#x5409;&#x4ED6;&#x5F39;&#x5531;&#x7684;&#x3002;&#x6211;&#x73B0;&#x5728;&#x4E5F;&#x8BA4;&#x4E3A;&#xFF0C;&#x53EA;&#x6709;&#x5409;&#x4ED6;&#x624D;&#x80FD;&#x8868;&#x73B0;&#x5927;&#x5B66;&#x751F;&#x6D3B;&#x7684;&#x7EAF;&#x771F;&#xFF0C;&#x53EA;&#x6709;&#x5409;&#x4ED6;&#x624D;&#x80FD;&#x8868;&#x73B0;&#x5927;&#x5B66;&#x751F;&#x6D3B;&#x7684;&#x6734;&#x5B9E;&#x548C;&#x7F8E;&#x4E3D;&#x3002;<br>&#x3000;&#x3000;&#x5C24;&#x5176;&#x662F;&#x5927;&#x5B66;&#x751F;&#x4EEC;&#x5E76;&#x4E0D;&#x4E13;&#x4E1A;&#x7684;&#x8F7B;&#x8F7B;&#x5F39;&#x5531;&#xFF0C;&#x66F4;&#x6709;&#x4E00;&#x756A;&#x9B45;&#x529B;&#x3002;&#x5F53;&#x65F6;&#x5168;&#x56FD;&#x6821;&#x56ED;&#x6C11;&#x8C23;&#x7279;&#x522B;&#x6D41;&#x884C;&#x3002;&#x5F53;&#x65F6;&#x6700;&#x6D41;&#x884C;&#x7684;&#x5C31;&#x662F;&#x540C;&#x684C;&#x7684;&#x4F60;&#x548C;&#x9752;&#x6625;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5F53;&#x65F6;&#x5531;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x9996;&#x9752;&#x6625;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x662F;&#x6211;&#x559C;&#x6B22;&#x7684;&#x6B4C;&#xFF0C;&#x6DE1;&#x6DE1;&#x7684;&#x5FE7;&#x4F24;&#x3002;&#x6211;&#x559C;&#x6B22;&#x6DE1;&#x6DE1;&#x7684;&#x5FE7;&#x4F24;&#x7684;&#x611F;&#x89C9;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x5728;&#x5531;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x624D;&#x770B;&#x6E05;&#x695A;&#x53F0;&#x4E0B;&#x7684;&#x4E00;&#x6E9C;&#x201C;&#x8BC4;&#x59D4;&#x201D;&#x540C;&#x5B66;&#x3002;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x5973;&#x5B69;&#x5B50;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x7537;&#x751F;&#x3002;&#x5979;&#x4EEC;&#x90FD;&#x662F;&#x7CFB;&#x6587;&#x5A31;&#x90E8;&#x7684;&#x5E72;&#x90E8;&#x3002;&#x5927;&#x5B66;&#x6587;&#x5A31;&#x90E8;&#x7684;&#x5973;&#x5B69;&#x5B50;&#x90FD;&#x662F;&#x80FD;&#x6B4C;&#x5584;&#x821E;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x6F02;&#x4EAE;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x4EEC;&#x542C;&#x7684;&#x5F88;&#x8BA4;&#x771F;&#xFF0C;&#x6211;&#x5531;&#x7684;&#x5F88;&#x6295;&#x5165;&#x3002;&#x771F;&#x7684;&#xFF0C;&#x6211;&#x7684;&#x58F0;&#x7EBF;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x8FD9;&#x9996;&#x6B4C;&#xFF0C;&#x6211;&#x7684;&#x8868;&#x60C5;&#x4E5F;&#x8868;&#x73B0;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x5FE7;&#x90C1;&#x3002;<br>&#x3000;&#x3000;&#x5F53;&#x65F6;&#x6211;&#x770B;&#x5230;&#x5979;&#xFF0C;&#x5C0F;&#x654F;&#x3002;&#x5979;&#x5728;&#x8FD9;&#x4E9B;&#x6F02;&#x4EAE;&#x5973;&#x5B69;&#x5B50;&#x91CC;&#x9762;&#x4ECD;&#x7136;&#x662F;&#x5F88;&#x7A81;&#x51FA;&#x7684;&#x3002;&#x5F53;&#x65F6;&#x5979;&#x7A7F;&#x7684;&#x662F;&#x4E00;&#x4EF6;&#x767D;&#x8272;&#x7684;&#x6BDB;&#x8863;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x6761;&#x7070;&#x767D;&#x725B;&#x4ED4;&#x88E4;&#x5B50;&#x3002;&#x5F88;&#x7D20;&#x96C5;&#xFF0C;&#x4F46;&#x662F;&#x975E;&#x5E38;&#x6709;&#x4E2A;&#x6027;&#x3002;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x7A81;&#x51FA;&#xFF0C;&#x4F46;&#x662F;&#x5C31;&#x662F;&#x90A3;&#x4E48;&#x7684;&#x9752;&#x6625;&#x3002;&#x5BF9;&#xFF0C;&#x7528;&#x9752;&#x6625;&#x8FD9;&#x4E2A;&#x8BCD;&#x592A;&#x8D34;&#x5207;&#x4E86;&#x3002;&#x5C31;&#x662F;&#x5F88;&#x9752;&#x6625;&#x7684;&#x611F;&#x89C9;&#x3002;&#x5979;&#x77ED;&#x53D1;&#xFF0C;&#x5F88;&#x52A8;&#x611F;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x4F46;&#x662F;&#x51B3;&#x4E0D;&#x62DB;&#x6447;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x5979;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x5979;&#x7D27;&#x7D27;&#x7684;&#x76EF;&#x7740;&#x6211;&#xFF0C;&#x542C;&#x7684;&#x5F88;&#x8BA4;&#x771F;&#x3002;&#x6211;&#x77E5;&#x9053;&#x5979;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x5728;&#x770B;&#x4ED6;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6234;&#x7740;&#x58A8;&#x955C;&#x3002;<br>&#x3000;&#x3000;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x5C31;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x5979;&#x3002;&#x4EBA;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x5947;&#x602A;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6709;&#x7684;&#x4EBA;&#x4F60;&#x770B;&#x4E00;&#x773C;&#xFF0C;&#x5C31;&#x4F1A;&#x8BB0;&#x4F4F;&#x5979;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x4EBA;&#xFF0C;&#x5929;&#x5929;&#x89C1;&#xFF0C;&#x4E5F;&#x672A;&#x5FC5;&#x80FD;&#x611F;&#x89C9;&#x5230;&#x4EC0;&#x4E48;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x60F3;&#x6211;&#x5F53;&#x65F6;&#x6709;&#x5FC3;&#x52A8;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6DE1;&#x6DE1;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x793C;&#x5802;&#x91CC;&#x9762;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x58F0;&#x97F3;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x7684;&#x6B4C;&#x58F0;&#xFF0C;&#x901A;&#x8FC7;&#x6269;&#x97F3;&#x5668;&#x3002;&#x5728;&#x793C;&#x5802;&#x4E2D;&#x56DE;&#x8361;&#xFF0C;&#x4E0D;&#x5C11;&#x8DEF;&#x8FC7;&#x7684;&#x540C;&#x5B66;&#x7AD9;&#x5728;&#x95E8;&#x53E3;&#x542C;&#x3002;&#x90A3;&#x4E9B;&#x201C;&#x8BC4;&#x59D4;&#x201D;&#x540C;&#x5B66;&#x90FD;&#x542C;&#x50BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5531;&#x5B8C;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x58F0;&#x97F3;&#x3002;&#x5927;&#x5BB6;&#x8FD8;&#x50BB;&#x50BB;&#x7684;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8868;&#x60C5;&#xFF0C;&#x6211;&#x4E00;&#x4E2A;&#x5B57;&#x4E5F;&#x6CA1;&#x6709;&#x8BF4;&#x3002;&#x6211;&#x5F88;cool&#x7684;&#x97A0;&#x4E86;&#x4E2A;&#x8EAC;&#xFF0C;&#x8BF4;&#x662F;&#x97A0;&#x8EAC;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x5C31;&#x662F;&#x70B9;&#x70B9;&#x4E86;&#x5934;&#x3002;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x62FF;&#x8D77;&#x6211;&#x7684;&#x7434;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x8DF3;&#x4E0B;&#x53F0;&#x6765;&#x3002;&#x90A3;&#x4E2A;&#x821E;&#x53F0;&#x4E0D;&#x662F;&#x5F88;&#x9AD8;&#x3002;&#x7136;&#x540E;&#x5927;&#x5BB6;&#x624D;&#x53CD;&#x6620;&#x8FC7;&#x6765;&#xFF0C;&#x5F00;&#x59CB;&#x563B;&#x563B;&#x62C9;&#x62C9;&#x7684;&#x9F13;&#x638C;&#x3002;&#x6211;&#x770B;&#x5230;&#x90A3;&#x4E2A;&#x7A7F;&#x6BDB;&#x8863;&#x7684;&#x5973;&#x5B69;&#x5B50;&#xFF0C;&#x8138;&#x4E0A;&#x6709;&#x4E86;&#x7B11;&#x610F;&#xFF0C;&#x6DE1;&#x6DE1;&#x7684;&#x90A3;&#x79CD;&#x3002;&#x7136;&#x540E;&#x4F4E;&#x4E0B;&#x5934;&#x53BB;&#x5728;&#x672C;&#x5B50;&#x4E0A;&#x5199;&#x4E1C;&#x897F;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x89C1;&#x9762;&#xFF0C;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5979;&#x662F;&#x8C01;&#xFF0C;&#x5979;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x662F;&#x8C01;&#x3002;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8BF4;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x662F;&#x5728;&#x821E;&#x53F0;&#x4E0A;&#x821E;&#x53F0;&#x4E0B;&#x770B;&#x8FC7;&#x5BF9;&#x65B9;&#xFF0C;&#x751A;&#x81F3;&#xFF0C;&#x5979;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x5531;&#x6B4C;&#x7684;&#x65F6;&#x5019;&#x770B;&#x7684;&#x5C31;&#x662F;&#x5979;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x77E5;&#x9053;&#x73B0;&#x5728;&#x7684;&#x5927;&#x5B66;&#x751F;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x7684;&#x4E3B;&#x52A8;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5BF9;&#x559C;&#x6B22;&#x7684;&#x5973;&#x5B69;&#x5B50;&#x8BF4;&#xFF1A;&#x6211;&#x4EEC;&#x505A;&#x4E2A;&#x670B;&#x53CB;&#x597D;&#x5417;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x65F6;&#x5916;&#x8868;&#x51B7;&#x6F20;&#xFF0C;&#x5185;&#x5FC3;&#x72C2;&#x70ED;&#x7684;&#x6211;&#xFF0C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x8FD9;&#x6837;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x89C9;&#x5F97;&#x7231;&#x60C5;&#xFF0C;&#x6700;&#x7F8E;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x6DE1;&#x6DE1;&#x7684;&#x5FC3;&#x52A8;&#x3002;&#x6DE1;&#x6DE1;&#x7684;&#xFF0C;&#x50CF;&#x7A7A;&#x6C14;&#x4E2D;&#x6F02;&#x8FC7;&#x7684;&#x82B1;&#x9999;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6B21;&#x89C1;&#x9762;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x7CFB;&#x7684;&#x673A;&#x623F;&#x91CC;&#x9762;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5F53;&#x65F6;&#x662F;&#x7CFB;&#x4E0A;&#x673A;&#x623F;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x3002;&#x6211;&#x4EEC;&#x7CFB;&#x7684;&#x673A;&#x623F;&#x90FD;&#x662F;&#x5B66;&#x751F;&#x7BA1;&#x7406;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x72C2;&#x70ED;&#x7231;&#x597D;&#xFF0C;&#x548C;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x64CD;&#x4F5C;&#x7684;&#x7CBE;&#x901A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#xFF0C;&#x5BFC;&#x5E08;&#x8BA9;&#x6211;&#x6210;&#x4E86;&#x7BA1;&#x7406;&#x5458;&#x3002;&#x5F53;&#x65F6;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x9AD8;&#x6821;&#x91CC;&#x9762;&#x7EDD;&#x5BF9;&#x8FD8;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x7A00;&#x6709;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x50CF;&#x73B0;&#x5728;&#x5728;&#x5783;&#x573E;&#x5806;&#x68C0;&#x51FA;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x6765;&#xFF0C;&#x6211;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x611F;&#x5230;&#x8BE7;&#x5F02;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7B49;&#x7EA7;&#x8003;&#x8BD5;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5916;&#x7CFB;&#x7684;&#x4EBA;&#x5230;&#x6211;&#x4EEC;&#x673A;&#x623F;&#x4E0A;&#x673A;&#x51E0;&#x4E4E;&#x662F;&#x552F;&#x4E00;&#x7684;&#x9009;&#x62E9;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5176;&#x4ED6;&#x7CFB;&#x5927;&#x591A;&#x6CA1;&#x6709;&#x673A;&#x623F;&#x3002;&#x533B;&#x5B66;&#x9662;&#x5F53;&#x7136;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x623F;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5979;&#x4EEC;&#x90FD;&#x662F;&#x5230;&#x6211;&#x4EEC;&#x7CFB;&#x4E0A;&#x673A;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x6B21;&#x662F;&#x6211;&#x503C;&#x73ED;&#xFF0C;&#x90A3;&#x5929;&#x6765;&#x4E0A;&#x673A;&#x7684;&#x4EBA;&#x90FD;&#x662F;&#x6765;&#x641E;&#x8003;&#x524D;&#x57F9;&#x8BAD;&#x7684;&#x3002;&#x5468;&#x672B;&#x5C31;&#x8981;&#x8003;&#x8BD5;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x4E00;&#x8FDB;&#x5165;&#x673A;&#x623F;&#xFF0C;&#x6211;&#x5C31;&#x8BA4;&#x51FA;&#x5979;&#x6765;&#x4E86;&#x3002;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x4E0D;&#x8BA4;&#x5F97;&#x3002;&#x90A3;&#x5929;&#x7684;&#x7ED9;&#x6211;&#x5F71;&#x50CF;&#x4E00;&#x76F4;&#x5C31;&#x5728;&#x6211;&#x5FC3;&#x91CC;&#x3002;&#x5979;&#x548C;&#x4E09;&#x4E2A;&#x5973;&#x540C;&#x5B66;&#xFF0C;&#x540E;&#x6765;&#x77E5;&#x9053;&#x90FD;&#x662F;&#x5979;&#x4EEC;&#x5BDD;&#x5BA4;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x6211;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#x62FF;&#x7740;&#x4E0A;&#x673A;&#x724C;&#x5FD9;&#x4F5C;&#x627E;&#x4F4D;&#x7F6E;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x51E0;&#x4E2A;&#x5973;&#x751F;&#x56E0;&#x4E3A;&#x4F4D;&#x7F6E;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x90FD;&#x5404;&#x81EA;&#x5206;&#x6563;&#x7684;&#x627E;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6211;&#x770B;&#x5230;&#x5979;&#x5F00;&#x59CB;&#x64CD;&#x4F5C;&#x8D77;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8D70;&#x51FA;&#x6211;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x6211;&#x7684;&#x673A;&#x5668;&#x662F;&#x6559;&#x5E08;&#x7528;&#x673A;&#xFF0C;&#x4E0D;&#x548C;&#x5979;&#x4EEC;&#x7684;&#x673A;&#x5668;&#x6446;&#x5728;&#x4E00;&#x8D77;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5728;&#x673A;&#x623F;&#x91CC;&#x9762;&#x8D70;&#x52A8;&#xFF0C;&#x8F85;&#x5BFC;&#x4F7F;&#x6211;&#x7684;&#x4EBA;&#x7269;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x53EB;&#x5979;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;&#x6839;&#x672C;&#x5C31;&#x53EF;&#x4EE5;&#x8BF4;&#x4E0D;&#x8BA4;&#x8BC6;&#x3002;</p>
<p>&#x5979;&#x4EEC;&#x90FD;&#x662F;&#x9762;&#x5BF9;&#x5899;&#x5EA7;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5979;&#x770B;&#x4E0D;&#x5230;&#x6211;&#x3002;&#x6211;&#x4E5F;&#x5728;&#x5FC3;&#x4E0D;&#x5728;&#x7109;&#x7684;&#x8F85;&#x5BFC;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x771F;&#x662F;&#x7B28;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x7684;&#x813E;&#x6C14;&#x4E5F;&#x662F;&#x5F88;&#x597D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x5B66;&#x751F;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x80FD;&#x4F53;&#x9A8C;&#x8001;&#x5E08;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x5F88;&#x8212;&#x670D;&#x7684;&#x3002;&#x4E0D;&#x7BA1;&#x591A;&#x4E48;&#x5F31;&#x667A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x90FD;&#x662F;&#x8DB3;&#x591F;&#x7684;&#x8010;&#x5FC3;&#x3002;<br>&#x3000;&#x5979;&#x7EC8;&#x4E8E;&#x9047;&#x5230;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x5979;&#x4E3E;&#x624B;&#x4E86;&#x3002;<br>&#x3000;&#x6211;&#x8D70;&#x5230;&#x5979;&#x7684;&#x8EAB;&#x8FB9;&#xFF0C;&#x6211;&#x7684;&#x5FC3;&#x8DF3;&#x7684;&#x5F88;&#x5389;&#x5BB3;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7684;&#x8138;&#x4E0A;&#x5199;&#x6EE1;&#x4E86;&#x51B7;&#x6F20;&#x3002;<br>&#x3000;&#x201D;&#x8001;&#x5E08;&#xFF0C;&#x6211;&#x7684;&#x4E2D;&#x6587;&#x600E;&#x4E48;&#x8F93;&#x5165;&#x4E0D;&#x8FDB;&#x53BB;&#x4E86;&#x201C;&#x5979;&#x7684;&#x58F0;&#x97F3;&#x5F88;&#x751C;&#x3002;<br>&#x3000;&#x6211;&#x4E00;&#x770B;&#xFF0C;&#x5979;&#x628A;&#x8F93;&#x5165;&#x6CD5;&#x5207;&#x6362;&#x5230;&#x4E86;&#x5927;&#x5199;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x8F93;&#x5165;&#x5168;&#x662F;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x80FD;&#x8F93;&#x5165;&#x4E86;&#x3002;<br>&#x201D;&#x628A;&#x8F93;&#x5165;&#x6CD5;&#x5207;&#x6362;&#x5230;&#x5C0F;&#x5199;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x201C;&#x6211;&#x4E0D;&#x52A8;&#x58F0;&#x8272;&#x7684;&#x8BF4;&#x3002;<br>&#x5979;&#x6123;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x5C0F;&#x58F0;&#x8BF4;&#x201D;&#x600E;&#x4E48;&#x5207;&#x6362;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#xFF0C;&#x5475;&#x5475; &#x201C;&#x3002;&#x5F88;&#x5C0F;&#x58F0;&#xFF0C;&#x5F88;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x7684;&#x6837;&#x5B50;&#x3002;<br>&#x3000;&#x6211;&#x5FC3;&#x91CC;&#x6697;&#x6697;&#x597D;&#x7B11;&#xFF0C;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x9762;&#x524D;&#x5979;&#x662F;&#x4E00;&#x70B9;&#x81EA;&#x4FE1;&#x90FD;&#x6CA1;&#x6709;&#x3002;<br>&#x3000;&#x6211;&#x6CA1;&#x8BF4;&#x8BDD;&#xFF0C;&#x4F0F;&#x4E0B;&#x8EAB;&#x53BB;&#xFF0C;&#x5E2E;&#x5979;&#x6309;&#x4E86;&#x90A3;&#x4E2A;capslock&#x952E;&#x76D8;&#x3002;<br>&#x3000;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5979;&#x770B;&#x5230;&#x4E86;&#x6211;&#x7684;&#x8138;&#x3002;<br>&#x3000;&#x5979;&#x76EF;&#x4F4F;&#x6211;&#xFF0C;&#x5F88;&#x5403;&#x60CA;&#x7684;&#x6837;&#x5B50;&#xFF1A;&#x201C;&#x5443;&#xFF1F;&#x662F;&#x4F60;&#x3002;&#x3002;&#x3002;&#x3002;&#x662F;&#x4F60;&#x5440;&#x3002;&#x3002;&#x3002;&#x201D;<br>&#x3000;&#x6211;&#x77E5;&#x9053;&#x5979;&#x8BA4;&#x51FA;&#x6211;&#x6765;&#x4E86;&#x3002;&#x6211;&#x6DE1;&#x6DE1;&#x7684;&#x7B11;&#x4E86;&#x4E00;&#x4E0B;&#x3002;<br>&#x3000;&quot;&#x8003;&#x51E0;&#x7EA7;&#x5440;&#xFF1F;&#x201C;<br>&#x3000;&#x201C;&#x4E00;&#x7EA7;&#x201D;&#x5979;&#x6709;&#x70B9;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x3002;<br>&#x3000;&#x3000;&quot;&#x5E94;&#x8BE5;&#x6CA1;&#x95EE;&#x9898;&#x5427;&#xFF1F;&#x201C;&#x6211;&#x7B11;&#x7740;&#x770B;&#x5979;&#x3002;<br>&#x3000;&#x201D;&#x6709;&#x95EE;&#x9898;&#x5440;&#x3002;&#x5509;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x61C2;&#x201C;&#x3002;<br>&#x3000;&#x6211;&#x8FD8;&#x662F;&#x6DE1;&#x6DE1;&#x7684;&#x7B11;&#x3002;<br>&#x3000;&quot;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x201D;<br>&#x3000;&#x201C;&#x4F60;&#x7684;&#x6B4C;&#x5F88;&#x597D;&#x542C;&#xFF0C;&#x771F;&#x7684;&#x201D;<br>&#x3000;&#x6211;&#x7B11;&#x4E86;&#x7B11;&#xFF0C;&#x8D70;&#x5F00;&#x4E86;&#x3002;&#x201C;&#x6709;&#x95EE;&#x9898;&#x53EB;&#x6211;&#x201D;&#x3002;</p>
<p>&#x5FEB;&#x5230;&#x4E0B;&#x673A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C0F;&#x654F;&#x53C8;&#x5411;&#x6211;&#x4E3E;&#x624B;&#x4E86;&#x3002;<br>&#x3000;&#x3000; &#x201C;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x201D;&#x6211;&#x8FC7;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000; &#x201C;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x5E2E;&#x6211;&#x4E00;&#x4E2A;&#x5FD9;&#xFF1F;&#x201D;<br>&#x3000;&#x3000; &#x201C;&#x5F53;&#x7136;&#x3002;&#x201D;<br>&#x3000;&#x3000; &#x201C;&#x6211;&#x8FD9;&#x5F20;&#x78C1;&#x76D8;&#x600E;&#x4E48;&#x590D;&#x5236;&#x4E0B;&#x6765;&#x4E0D;&#x80FD;&#x7528;&#xFF0C;&#x53EA;&#x80FD;&#x539F;&#x6765;&#x90A3;&#x5F20;&#x80FD;&#x7528;&#xFF1F;&#x201C;<br>&#x3000;&#x3000;&#x3000;&#x6211;&#x62FF;&#x8FC7;&#x78C1;&#x76D8;&#x4E00;&#x770B;&#xFF0C;&#x662F;&#x4E00;&#x5F20;1.44M&#x7684;3&#x5BF8;&#x76D8;&#x3002;&#x4E0A;&#x9762;&#x8D34;&#x7740;&#x5168;&#x56FD;&#x8BA1;&#x7B97;&#x673A;&#x7B49;&#x7EA7;&#x8003;&#x8BD5;&#x6A21;&#x62DF;&#x8003;&#x8BD5;&#x7684;&#x5B57;&#x6837;&#x3002;&#x539F;&#x6765;&#x662F;&#x7B49;&#x7EA7;&#x8003;&#x8BD5;&#x6A21;&#x62DF;&#x76D8;&#x3002;<br>&#x3000;&#x3000;&#x3000;&#x8FD9;&#x662F;&#x52A0;&#x8FC7;&#x5BC6;&#x7684;&#xFF0C;&#x5F53;&#x7136;copy&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;<br>&#x3000;&#x3000; &#x201D;&#x8FD9;&#x662F;&#x52A0;&#x8FC7;&#x5BC6;&#x7684;&#xFF0C;&#x666E;&#x901A;&#x7684;&#x62F7;&#x8D1D;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;&#x201C;&#x6211;&#x8BF4;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x60F3;&#x5979;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x52A0;&#x5BC6;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;<br>&#x3000;&#x3000; &#x201D;&#x90A3;&#xFF0C;&#x80FD;&#x5426;&#x5E2E;&#x6211;copy&#x51E0;&#x4EFD;&#xFF0C;&#x6211;&#x4EEC;&#x5BDD;&#x5BA4;&#x73B0;&#x5728;&#x5C31;&#x8FD9;&#x4E48;&#x4E00;&#x4EFD;&#x3002;&#x592A;&#x7D27;&#x5F20;&#x4E86;&#x3002;&#x201C;<br>&#x3000;&#x3000; &#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x867D;&#x7136;&#x7834;&#x89E3;&#x5BC6;&#x94A5;&#x76D8;&#x5F53;&#x65F6;&#x662F;&#x6211;&#x5B66;&#x751F;&#x65F6;&#x4EE3;&#x7684;&#x6700;&#x7231;&#x3002;&#x4F46;&#x662F;&#x5728;&#x7834;&#x89E3;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x4E5F;&#x662F;&#x6CA1;&#x5E95;&#x7684;&#x3002;&#x5F53;&#x65F6;&#x7684;&#x52A0;&#x5BC6;&#x624B;&#x6BB5;&#x4E94;&#x82B1;&#x516B;&#x95E8;&#x3002;&#x6709;&#x4E9B;&#x771F;&#x662F;&#x975E;&#x5E38;&#x96BE;&#x4E8E;&#x7834;&#x89E3;&#x7684;&#x3002;<br>&#x3000;&#x3000; &#x4F46;&#x662F;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x4E0D;&#x53EF;&#x80FD;&#x62D2;&#x7EDD;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x62D2;&#x7EDD;&#x3002;<br>&#x3000;&#x3000; &#x201D;&#x80FD;&#x4E0D;&#x80FD;&#x6210;&#x529F;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x8BD5;&#x4E00;&#x8BD5;&#x201C;<br>&#x3000;&#x3000; &#x201D;&#x597D;&#xFF0C;&#x8C22;&#x8C22;&#xFF0C;&#x8C22;&#x8C22;&#x3002;&#x201C;&#x89C1;&#x6211;&#x7B54;&#x5E94;&#x4E86;&#xFF0C;&#x5979;&#x4F3C;&#x4E4E;&#x76F8;&#x4FE1;&#x6211;&#x4E00;&#x5B9A;&#x80FD;&#x7834;&#x8BD1;&#x4E00;&#x6837;&#x3002;&#x8138;&#x4E0A;&#x9732;&#x51FA;&#x707F;&#x70C2;&#x7684;&#x7B11;&#x5BB9;&#x3002;&#x770B;&#x7684;&#x6211;&#x5FC3;&#x52A8;&#x3002;<br>&#x3000;&#x3000; &#x201D;&#x738B;*&#xFF0C;&#x4F60;&#x4F4F;&#x54EA;&#x91CC;&#x5440;&#x201C;&#x5979;&#x5C45;&#x7136;&#x53EB;&#x51FA;&#x4E86;&#x6211;&#x7684;&#x540D;&#x5B57;&#x3002;<br>&#x3000;&#x3000; &#x201C;&#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x6211;&#x7684;&#x540D;&#x5B57;&#xFF1F;&#x201D;&#x6211;&#x771F;&#x7684;&#x5F88;&#x60CA;&#x5F02;&#x3002;<br>&#x3000;&#x3000; &#x201C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x4EEC;&#x6587;&#x5A31;&#x90E8;&#x957F;&#x8BF4;&#x7684;&#x3002;&#x201D;&#x5979;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x7684;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x3000;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x95EE;&#x4E86;&#x5979;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5979;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5979;&#x7684;&#x540D;&#x5B57;&#x53EB;&#x5C0F;&#x654F;&#x3002;</p>
<p>&#x673A;&#x623F;&#x91CC;&#x9762;&#x7684;&#x4EBA;&#x8D70;&#x5149;&#x4E86;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x7ED9;&#x5C0F;&#x654F;&#x7834;&#x89E3;&#x8FD9;&#x5F20;&#x78C1;&#x76D8;&#x3002;&#x6211;&#x7559;&#x4E0B;&#x6765;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x662F;&#x7ECF;&#x5E38;&#x8FD9;&#x4E48;&#x7B49;&#x5176;&#x4ED6;&#x4EBA;&#x8D70;&#x4E86;&#xFF0C;&#x518D;&#x81EA;&#x5DF1;&#x4F5C;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x3002;&#x5B88;&#x95E8;&#x7684;&#x5927;&#x7237;&#x4E5F;&#x548C;&#x6211;&#x5F88;&#x719F;&#x6089;&#x4E86;&#x3002;&#x4ED6;&#x4E0D;&#x7BA1;&#x6211;&#x5DE5;&#x4F5C;&#x5230;&#x591A;&#x665A;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E72;&#x6D89;&#x6211;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x628A;&#x90A3;&#x5F20;&#x78C1;&#x76D8;&#x63D2;&#x5165;&#x8F6F;&#x9A71;&#xFF0C;&#x4F7F;&#x7528;hdcopy&#x5BF9;&#x78C1;&#x76D8;&#x5F00;&#x59CB;&#x626B;&#x63CF;&#x3002;&#x6211;&#x770B;&#x5230;&#x597D;&#x51E0;&#x4E2A;&#x7EA2;&#x8272;E&#x3002;&#x90A3;&#x8868;&#x793A;&#x8BFB;&#x9519;&#x8BEF;&#x7684;&#x6807;&#x5FD7;&#x3002;&#x663E;&#x7136;&#x8FD9;&#x4E9B;&#x6807;&#x7EA2;&#x8272;E&#x7684;&#x4F4D;&#x7F6E;&#x5C31;&#x662F;&#x4ED6;&#x7684;&#x52A0;&#x5BC6;&#x70B9;&#x3002;<br>&#x3000;&#x3000; &#x89E3;&#x52A0;&#x8FC7;&#x5BC6;&#x7684;&#x78C1;&#x76D8;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x603B;&#x662F;&#x901A;&#x8FC7;&#x5236;&#x4F5C;&#x548C;&#x539F;&#x6765;&#x78C1;&#x76D8;&#x76F8;&#x540C;&#x7684;&#x5BC6;&#x94A5;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x52A0;&#x5BC6;&#x70B9;&#x662F;&#x65E0;&#x6CD5;copy&#x7684;&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x591A;&#x5389;&#x5BB3;&#x3002;&#x6BD4;&#x5982;&#x78C1;&#x9053;&#x63A5;&#x7F1D;&#x6280;&#x672F;&#x7684;&#x52A0;&#x5BC6;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x5236;&#x4F5C;&#x5BC6;&#x94A5;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x884C;&#x4E0D;&#x901A;&#x7684;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x6700;&#x62C5;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x3002;&#x4E0D;&#x8FC7;&#x4ECE;hdcopy&#x626B;&#x63CF;&#x7684;&#x7ED3;&#x679C;&#x770B;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x7684;&#x78C1;&#x9053;&#x63A5;&#x7F1D;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x574F;&#x9053;&#x3002;<br>&#x3000;&#x3000; &#x5148;&#x628A;&#x8FD9;&#x4E9B;&#x574F;&#x7684;&#x5730;&#x65B9;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x518D;&#x8BF4;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x542F;&#x52A8;&#x4E86;&#x6211;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x62E6;&#x622A;&#x7A0B;&#x5E8F;&#x3002;&#x4ED6;&#x53EF;&#x4EE5;&#x62E6;&#x622A;int13 &#x5BF9;&#x78C1;&#x76D8;&#x7684;&#x8C03;&#x7528;&#x3002;&#x628A;&#x4ED6;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x7684;&#x8BFB;&#x78C1;&#x76D8;&#x7684;&#x53C2;&#x6570;&#x62E6;&#x622A;&#x4E0B;&#x6765;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x771F;&#x5B9E;&#x7684;&#x78C1;&#x76D8;&#x7684;&#x4EA7;&#x751F;&#x7ED3;&#x6784;&#x3002;<br>&#x3000;&#x3000; &#x7136;&#x540E;&#x6211;&#x518D;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x5236;&#x9020;&#x4E00;&#x4E2A;&#x4E00;&#x6478;&#x4E00;&#x6837;&#x7684;&#x78C1;&#x76D8;&#x7ED3;&#x6784;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x90A3;&#x4E48;copy&#x7684;&#x78C1;&#x76D8;&#x5C31;&#x80FD;&#x4F7F;&#x7528;&#x4E86;&#x3002;&#x8FDE;&#x7A0B;&#x5E8F;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x8DDF;&#x8E2A;&#x3002;<br>&#x3000;&#x3000; &#x5475;&#x5475;&#xFF0C;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x64CD;&#x4F5C;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x5F20;&#x7B49;&#x7EA7;&#x8003;&#x8BD5;&#x7684;&#x52A0;&#x5BC6;&#x5F3A;&#x5EA6;&#x975E;&#x5E38;&#x4F4E;&#x3002;&#x6BD5;&#x7ADF;&#x624D;20&#x5143;&#x94B1;&#x4E00;&#x5F20;&#x3002;&#x4ED6;&#x7528;&#x7684;&#x5C31;&#x662F;&#x51E0;&#x4E2A;&#x4E0D;&#x89C4;&#x5219;&#x6247;&#x533A;&#x5F97;&#x52A0;&#x5BC6;&#x65B9;&#x6CD5;&#x3002;&#x666E;&#x901A;&#x5F97;&#x8F6F;&#x76D8;&#xFF0C;&#x5728;&#x683C;&#x5F0F;&#x5316;&#x5F97;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x662F;&#x6BCF;&#x4E2A;&#x78C1;&#x9053;&#x6BCF;&#x4E2A;&#x6247;&#x533A;512&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x51CF;&#x5C11;&#x6247;&#x533A;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x52A0;&#x5927;&#x6BCF;&#x4E2A;&#x6247;&#x533A;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#x53D8;&#x6210;1024&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x666E;&#x901A;&#x7684;copy&#x547D;&#x4EE4;&#x4F7F;&#x7528;&#x6B63;&#x5E38;&#x7684;&#x78C1;&#x76D8;&#x8BFB;&#x5199;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x4F1A;&#x62A5;&#x9519;&#x3002;&#x5F53;&#x7136;&#x4E5F;&#x65E0;&#x6CD5;copy&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x592A;&#x5C0F;case&#x4E86;&#x3002;&#x6211;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x62E6;&#x622A;&#x8F6F;&#x4EF6;&#x5F88;&#x5FEB;&#x5C31;&#x83B7;&#x5F97;&#x4E86;&#x4E86;&#x4ED6;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x5B9E;&#x9645;&#x53C2;&#x6570;&#x3002;<br>&#x3000;&#x3000;&#x5148;&#x4F7F;&#x7528;hdcopy&#x590D;&#x5236;&#x4E86;&#x4E00;&#x5F20;&#x3002;&#x51FA;&#x9519;&#x4E5F;&#x4E0D;&#x7BA1;&#x4ED6;&#x3002;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;debug&#x5199;&#x4E86;&#x4E00;&#x6BB5;&#x7A0B;&#x5E8F;&#x3002;&#x9A6C;&#x4E0A;&#x6309;&#x7167;&#x6BCD;&#x76D8;&#x7684;&#x52A0;&#x5BC6;&#x70B9;&#x683C;&#x5F0F;&#x5316;&#x4E86;&#x51E0;&#x4E2A;&#x7279;&#x6B8A;&#x78C1;&#x9053;&#x3002;<br>&#x3000;&#x3000;&#x8FD0;&#x884C;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x54C8;&#xFF0C;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x54C8;&#x54C8;&#xFF0C;&#x8FD9;&#x4E2A;&#x76D8;&#x7684;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x592A;&#x70C2;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x53E3;&#x6C14;&#x590D;&#x5236;&#x4E86;5&#x5F20;&#x78C1;&#x76D8;&#x3002;&#x8F93;&#x4E86;&#x4E00;&#x53E3;&#x6C14;&#x3002;&#x60F3;&#x5230;&#x5C0F;&#x654F;&#x62FF;&#x5230;&#x78C1;&#x76D8;&#x7684;&#x65F6;&#x5019;&#x7684;&#x7B11;&#x5BB9;&#x3002;&#x6211;&#x7684;&#x5FC3;&#x9189;&#x4E86;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;<br>&#x4ECE;&#x628A;&#x7834;&#x89E3;&#x7684;&#x78C1;&#x76D8;&#x4EA4;&#x7ED9;&#x5C0F;&#x654F;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x4EEC;&#x624D;&#x7B97;&#x662F;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x4EA4;&#x5F80;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x5468;&#x672B;&#x5728;&#x4E00;&#x8D77;&#x5531;&#x6B4C;&#xFF0C;&#x6211;&#x5F39;&#x6211;&#x5531;&#xFF0C;&#x5979;&#x4E5F;&#x5531;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x901B;&#x8857;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x770B;&#x7535;&#x5F71;&#x3002;&#x5176;&#x4ED6;&#x4EBA;&#x90FD;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x5728;&#x5F39;&#x604B;&#x7231;&#x3002;&#x4F46;&#x662F;&#x4ECE;&#x6211;&#x4EEC;&#x8BA4;&#x8BC6;&#xFF0C;&#x5012;&#x6211;&#x4EEC;&#x6BD5;&#x4E1A;&#x79BB;&#x5F00;&#x6821;&#x56ED;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x6CA1;&#x6709;&#x4E92;&#x76F8;&#x8BF4;&#x8FC7;&#x4E00;&#x4E2A;&#x201C;&#x7231;&quot;&#x5B57;&#x3002;&#x6211;&#x53EA;&#x662F;&#x89C9;&#x5F97;&#x548C;&#x5979;&#x5728;&#x4E00;&#x8D77;&#x5F88;&#x5FEB;&#x4E50;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x60F3;&#x90A3;&#x4E48;&#x591A;&#x3002;&#x800C;&#x4E14;&#x5E73;&#x65F6;&#x6211;&#x7684;&#x5927;&#x90E8;&#x5206;&#x8BFE;&#x4F59;&#x65F6;&#x95F4;&#x90FD;&#x82B1;&#x5728;&#x673A;&#x623F;&#x91CC;&#x9762;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x662F;&#x7ECF;&#x5E38;&#x89C1;&#x9762;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x90FD;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x5FEB;&#x4E50;&#x3002;&#x90A3;&#x79CD;&#x6ECB;&#x5473;&#x4EE4;&#x4EBA;&#x9676;&#x9189;&#x3002;&#x96BE;&#x9053;&#x8FD9;&#x5C31;&#x662F;&#x521D;&#x604B;&#x7684;&#x5473;&#x9053;&#xFF1F;<br>&#x3000;&#x3000;&#x76F4;&#x5230;&#x6BD5;&#x4E1A;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x6CA1;&#x6709;&#x5411;&#x5BF9;&#x65B9;&#x8868;&#x767D;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0D;&#x662F;&#x88C5;&#x7CCA;&#x6D82;&#xFF0C;&#x800C;&#x662F;&#x5F53;&#x65F6;&#x771F;&#x7684;&#x5C31;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x3002;&#x5DF2;&#x7ECF;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x597D;&#x4E86;&#xFF0C;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x6EE1;&#x8DB3;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x5FC5;&#x8981;&#x8BF4;&#x5176;&#x4ED6;&#x7684;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x6BD5;&#x4E1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E3A;&#x4E86;&#x5199;&#x4E86;&#x4E00;&#x9996;&#x6B4C;&#xFF0C;&#x540D;&#x5B57;&#x53EB;&#x300A;&#x56DE;&#x5230;&#x8FC7;&#x53BB;&#x300B;&#xFF0C;&#x6211;&#x5531;&#x7ED9;&#x5979;&#x542C;&#xFF0C;&#x5F53;&#x65F6;&#x5979;&#x5C31;&#x54ED;&#x4E86;&#x3002;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x5979;&#x6D41;&#x6CEA;&#x3002;&#x771F;&#x7684;&#xFF0C;&#x5C0F;&#x654F;&#x5728;&#x6211;&#x5FC3;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;&#x575A;&#x5F3A;&#x72EC;&#x7ACB;&#x6709;&#x4E3B;&#x89C1;&#x7684;&#x5973;&#x5B69;&#x5B50;&#xFF0C;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x770B;&#x5230;&#x8FC7;&#x5979;&#x7684;&#x773C;&#x6CEA;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x5929;&#x5979;&#x771F;&#x7684;&#x54ED;&#x4E86;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x6240;&#x63AA;&#xFF0C;&#x95EE;&#x5979;&#x600E;&#x4E48;&#x4E86;&#xFF1F;&#x5979;&#x6C89;&#x9ED8;&#x4E86;&#x597D;&#x4E45;&#xFF0C;&#x6700;&#x540E;&#x8BF4;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#xFF0C;&#x8981;&#x5206;&#x522B;&#x4E86;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x4EE5;&#x540E;&#x8FD8;&#x80FD;&#x4E0D;&#x80FD;&#x89C1;&#x9762;&#xFF0C;&#x8FD8;&#x80FD;&#x4E0D;&#x80FD;&#x542C;&#x6211;&#x5531;&#x6B4C;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5FC3;&#x91CC;&#x4E00;&#x9178;&#xFF0C;&#x771F;&#x7684;&#xFF0C;&#x957F;&#x8FD9;&#x4E48;&#x5927;&#xFF0C;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x6709;&#x4E86;&#x5FC3;&#x9178;&#x7684;&#x611F;&#x89C9;&#x3002;&#x5F53;&#x65F6;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x5979;&#x4EEC;&#x5BB6;&#x5DF2;&#x7ECF;&#x7ED9;&#x4ED6;&#x8054;&#x7CFB;&#x597D;&#x4E86;&#x5979;&#x6240;&#x5728;&#x7684;&#x57CE;&#x5E02;&#x6700;&#x597D;&#x7684;&#x533B;&#x9662;&#x3002;&#x800C;&#x6211;&#x5F53;&#x65F6;&#x7684;&#x5DE5;&#x4F5C;&#x8FD8;&#x6CA1;&#x6709;&#x5B9A;&#x3002;&#x6211;&#x7684;&#x7236;&#x6BCD;&#x90FD;&#x662F;&#x6559;&#x5E08;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x9760;&#x81EA;&#x5DF1;&#x3002;<br>&#x3000;&#x3000;&#x6BD5;&#x4E1A;&#x7684;&#x65F6;&#x95F4;&#x5012;&#x4E86;&#xFF0C;&#x90A3;&#x4E2A;&#x590F;&#x5929;&#xFF0C;&#x5979;&#x5728;&#x6211;&#x7684;&#x7559;&#x8A00;&#x518C;&#x4E0A;&#x7559;&#x4E0B;&#x4E00;&#x6BB5;&#x795D;&#x798F;&#x7684;&#x8BDD;&#x3002;&#x653E;&#x4E0A;&#x4E00;&#x5F20;&#x7167;&#x7247;&#xFF0C;&#x8BF4;&#xFF1A;&#x6709;&#x7A7A;&#x6765;&#x770B;&#x6211;&#xFF0C;&#x522B;&#x5FD8;&#x4E86;&#x6211;&#x3002;&#x5979;&#x8D70;&#x4E86;&#xFF0C;&#x771F;&#x7684;&#x8D70;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x6709;&#x65F6;&#x5019;&#x4EBA;&#x771F;&#x662F;&#x6709;&#x7F18;&#x5206;&#x7684;&#x3002;&#x5979;&#x79BB;&#x5F00;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x5F88;&#x5FEB;&#x6709;&#x4E86;&#x7709;&#x76EE;&#x3002;&#x5979;&#x6240;&#x5728;&#x7684;&#x90A3;&#x4E2A;&#x57CE;&#x5E02;&#x7684;&#x67D0;&#x90E8;&#x7EC4;&#x5EFA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#xFF0C;&#x6211;&#x53BB;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x548C;&#x5979;&#x5904;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x57CE;&#x5E02;&#x8FD9;&#x4E48;&#x5927;&#xFF0C;&#x4E0D;&#x518D;&#x662F;&#x90A3;&#x4E2A;&#x8C61;&#x7259;&#x5854;&#x7684;&#x65F6;&#x5019;&#x4E86;&#x3002;&#x6211;&#x5174;&#x594B;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x975E;&#x5E38;&#x8FF7;&#x832B;&#x3002;</p>
<p>&#x5F53;&#x65F6;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x8981;&#x6C42;&#x65B0;&#x6765;&#x7684;&#x5458;&#x5DE5;&#x5FC5;&#x987B;&#x8981;&#x4F53;&#x68C0;&#x3002;&#x4F53;&#x68C0;&#x7684;&#x5355;&#x4F4D;&#x5C31;&#x662F;&#x5C0F;&#x654F;&#x6240;&#x5728;&#x7684;&#x533B;&#x9662;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x80FD;&#x78B0;&#x89C1;&#x5C0F;&#x654F;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x80FD;&#x7ED9;&#x5979;&#x4E00;&#x4E2A;&#x60CA;&#x559C;&#x3002;<br>&#x3000;&#x3000;&#x5F53;&#x6211;&#x5012;&#x533B;&#x9662;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x624D;&#x53D1;&#x73B0;&#x8981;&#x627E;&#x4E00;&#x4E2A;&#x4EBA;&#x4E0D;&#x662F;&#x5BB9;&#x6613;&#x7684;&#x3002;&#x533B;&#x9662;&#x5F88;&#x5927;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x5B66;&#x6821;&#x5DEE;&#x4E0D;&#x591A;&#x3002;&#x6211;&#x4F53;&#x68C0;&#x7684;&#x90A3;&#x5EA7;&#x6402;&#x4E5F;&#x6709;5&#xFF0C;6&#x5C42;&#x9AD8;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5979;&#x5728;&#x90A3;&#x4E2A;&#x90E8;&#x95E8;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x90A3;&#x7740;&#x4F53;&#x68C0;&#x8868;&#xFF0C;&#x5230;&#x5904;&#x4F53;&#x68C0;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5C31;&#x76EF;&#x7740;&#x5973;&#x533B;&#x751F;&#x770B;&#x3002;&#x5230;&#x5904;&#x90FD;&#x662F;&#x7A7F;&#x767D;&#x5927;&#x8902;&#x7684;&#x533B;&#x751F;&#x62A4;&#x58EB;&#x6765;&#x6765;&#x5F80;&#x5F80;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x5C0F;&#x654F;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x6211;&#x80FD;&#x8BA4;&#x51FA;&#x5979;&#x6765;&#x3002;&#x5373;&#x4F7F;&#x5979;&#x7A7F;&#x7740;&#x767D;&#x5927;&#x8902;&#xFF0C;&#x6234;&#x7740;&#x53E3;&#x7F69;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x5916;&#x79D1;&#x68C0;&#x67E5;&#x8EAB;&#x4F53;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6D4B;&#x4F53;&#x91CD;&#xFF0C;&#x8EAB;&#x9AD8;&#xFF0C;&#x68C0;&#x67E5;&#x4F53;&#x8868;&#x3002;&#x662F;&#x4E2A;&#x7537;&#x533B;&#x751F;&#x3002;&#x8131;&#x5149;&#x4E86;&#xFF0C;&#x8BA9;&#x4ED6;&#x770B;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x68C0;&#x67E5;&#x5B8C;&#x6BD5;&#xFF0C;&#x521A;&#x7A7F;&#x597D;&#x8863;&#x670D;&#x3002;&#x4E00;&#x4F4D;&#x533B;&#x751F;&#x8FDB;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x5F20;&#x533B;&#x751F;&#xFF0C;&#x8BF7;&#x5230;&#x624B;&#x672F;&#x5BA4;&#x53BB;&#xFF0C;&#x4E3B;&#x4EFB;&#x627E;&#x4F60;&#x3002;&#x4F60;&#x8FD9;&#x91CC;&#x6211;&#x6765;&#x66FF;&#x4F60;&#x4E00;&#x4F1A;&#x513F;&#x201C;&#x542C;&#x58F0;&#x97F3;&#x662F;&#x4E2A;&#x5973;&#x533B;&#x751F;&#xFF0C;&#x7531;&#x4E8E;&#x6234;&#x7740;&#x53E3;&#x7F69;&#x3002;&#x58F0;&#x97F3;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6CA1;&#x6709;&#x542C;&#x51FA;&#x6765;&#x5979;&#x5C31;&#x662F;&#x5C0F;&#x654F;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x5728;&#x6574;&#x7406;&#x8863;&#x670D;&#x3002;&#x6CA1;&#x6CE8;&#x610F;&#xFF0C;&#x800C;&#x4E14;&#x5979;&#x5168;&#x8EAB;&#x5C31;&#x9732;&#x51FA;&#x4E24;&#x4E2A;&#x773C;&#x775B;&#x3002;&#x597D;&#x50CF;&#x521A;&#x4ECE;&#x624B;&#x672F;&#x5BA4;&#x51FA;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#x5979;&#x8BA4;&#x51FA;&#x4E86;&#x6211;&#xFF0C;&#x5F53;&#x65F6;&#x5979;&#x6CA1;&#x6709;&#x62DB;&#x547C;&#x6211;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x4F4D;&#x7537;&#x533B;&#x751F;&#x7ED9;&#x4ED6;&#x4EA4;&#x4EE3;&#x51E0;&#x53E5;&#x51FA;&#x53BB;&#x4E86;&#x3002;&#x5979;&#x7ED9;&#x6211;&#x586B;&#x8868;&#x3002;&#x5979;&#x62FF;&#x7740;&#x6211;&#x7684;&#x4F53;&#x68C0;&#x8868;&#xFF0C;&#x770B;&#x7740;&#x4E0A;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6211;&#x60F3;&#x5979;&#x770B;&#x5230;&#x4E86;&#x6211;&#x7684;&#x540D;&#x5B57;&#x548C;&#x5355;&#x4F4D;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x6211;&#x8981;&#x91CD;&#x65B0;&#x68C0;&#x67E5;&#x201C;&#x5979;&#x8BF4;&#x3002;&#x6211;&#x8FD8;&#x6CA1;&#x542C;&#x51FA;&#x5979;&#x7684;&#x58F0;&#x97F3;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x554A;&#x201C;&#x6211;&#x4E00;&#x6123;&#xFF0C;&#x521A;&#x624D;&#x624D;&#x68C0;&#x67E5;&#x8FC7;&#x4E86;&#x3002;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x8131;&#x8863;&#x670D;&#xFF0C;&#x522B;&#x5E9F;&#x8BDD;&#xFF01;&#x201C;<br>&#x3000;&#x3000;&#x201D;&#x8FD9;&#x3002;&#x3002;&#x3002;&#x3002;&#x201C;&#x4F60;&#x662F;&#x5973;&#x7684;&#xFF0C;&#x6211;&#x600E;&#x4E48;&#x8131;&#x5440;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4E0D;&#x6562;&#x8BF4;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5C31;&#x90A3;&#x4E48;&#x7EA2;&#x7740;&#x8138;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x529E;&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x5230;&#x6211;&#x5982;&#x6B64;&#x7684;&#x7A98;&#x8FEB;&#xFF0C;&#x5979;&#x771F;&#x7684;&#x662F;&#x5728;&#x5FCD;&#x4E0D;&#x4F4F;&#x4E86;&#x3002;&#x62C9;&#x4E0B;&#x53E3;&#x7F69;&#xFF0C;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x54C8;&#x54C8;&#x54C8;&#x5927;&#x7B11;&#x8D77;&#x6765;&#xFF0C;&#x7B11;&#x5F97;&#x90FD;&#x8DB4;&#x5728;&#x684C;&#x4E0A;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x4E0B;&#x5C31;&#x8BA4;&#x51FA;&#x4E86;&#x5979;&#x3002;&#x5C0F;&#x654F;&#xFF01;<br>&#x3000;&#x3000;&#x6211;&#x4E5F;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x7684;&#x7B11;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x6B7B;&#x59AE;&#x5B50;&#xFF0C;&#x6076;&#x4F5C;&#x5267;&#x7684;&#x813E;&#x6C14;&#x8FD8;&#x662F;&#x6CA1;&#x6539;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x804A;&#x5929;&#x4E86;&#xFF0C;&#x5C0F;&#x654F;&#x610F;&#x5916;&#x7684;&#x770B;&#x5230;&#x6211;&#xFF0C;&#x770B;&#x7684;&#x51FA;&#x6765;&#xFF0C;&#x5979;&#x4E5F;&#x975E;&#x5E38;&#x7684;&#x9AD8;&#x5174;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x6211;&#x73B0;&#x5728;&#x8981;&#x5728;&#x8FD9;&#x5EA7;&#x57CE;&#x5E02;&#x624E;&#x4E0B;&#x6839;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x53EF;&#x4EE5;&#x5929;&#x5929;&#x89C1;&#x9762;&#x4E86;&#x201C;&#x6211;&#x9AD8;&#x5174;&#x7684;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x654F;&#x5C31;&#x76EF;&#x7740;&#x6211;&#x7B11;&#xFF0C;&#x6700;&#x540E;&#x8BF4;&#xFF1A;&#x201D;&#x4ECA;&#x5929;&#x6211;&#x8BF7;&#x5BA2;&#xFF0C;&#x4F60;&#x60F3;&#x5403;&#x4EC0;&#x4E48;&#x968F;&#x4FBF;&#x70B9;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5BA2;&#x968F;&#x4E3B;&#x4FBF;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x4E0D;&#x4F1A;&#x653E;&#x8FC7;&#x4F60;&#x3002;&#x5475;&#x5475;&#x201D;&#x6211;&#x6545;&#x4F5C;&#x8D2A;&#x5A6A;&#x88C5;&#x3002;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8FD9;&#x4E48;&#x5F00;&#x73A9;&#x7B11;&#x3002;</p>
<p>&#x5979;&#x4E0B;&#x73ED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53BB;&#x5403;&#x7684;&#x662F;&#x9999;&#x8FA3;&#x87F9;&#xFF0C;&#x5473;&#x9053;&#x771F;&#x7684;&#x597D;&#x3002;&#x4E0D;&#x77E5;&#x662F;&#x5473;&#x9053;&#x786E;&#x5B9E;&#x597D;&#xFF0C;&#x8FD8;&#x662F;&#x6211;&#x7684;&#x5FC3;&#x60C5;&#x597D;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x654F;&#x5F53;&#x65F6;&#x7A7F;&#x7684;&#x662F;&#x4E00;&#x4EF6;&#x767D;&#x8272;&#x7684;&#x8FDE;&#x8863;&#x88D9;&#xFF0C;&#x597D;&#x770B;&#x7684;&#x5C31;&#x50CF;&#x4E00;&#x53EA;&#x8774;&#x8776;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x4E5F;&#x5F88;&#x9AD8;&#x5174;&#xFF0C;&#x6211;&#x90A3;&#x5929;&#x559D;&#x9152;&#x4E86;&#x3002;&#x559D;&#x4E86;2&#x74F6;&#x5564;&#x9152;&#x3002;&#x521A;&#x597D;&#x662F;&#x5934;&#x8111;&#x6655;&#xFF0C;&#x4F46;&#x662F;&#x8EAB;&#x4F53;&#x6B63;&#x5E38;&#x7684;&#x9636;&#x6BB5;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8BF4;&#x4E86;&#x597D;&#x591A;&#x7684;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x5B8C;&#x4E86;&#xFF0C;&#x9080;&#x8BF7;&#x5979;&#x5230;&#x6211;&#x7684;&#x65B0;&#x5355;&#x4F4D;&#x7684;&#x65B0;&#x7A9D;&#xFF0C;&#x5979;&#x770B;&#x5230;&#x4E86;&#x90A3;&#x628A;&#x5409;&#x4ED6;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x8981;&#x6211;&#x5531;&#x6B4C;&#xFF0C;&#x6211;&#x5C31;&#x5531;&#x3002;&#x5531;&#x5440;&#xFF0C;&#x548C;&#x5927;&#x5B66;&#x5206;&#x522B;&#x65F6;&#x5019;&#x7684;&#x60C5;&#x666F;&#x81EA;&#x7136;&#x53C8;&#x4E0D;&#x76F8;&#x540C;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter6.html" class="navigation navigation-prev " aria-label="Previous page: 第六章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter8.html" class="navigation navigation-next " aria-label="Next page: 第八章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第七章","level":"1.8","depth":1,"next":{"title":"第八章","level":"1.9","depth":1,"path":"chapter8.md","ref":"chapter8.md","articles":[]},"previous":{"title":"第六章","level":"1.7","depth":1,"path":"chapter6.md","ref":"chapter6.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter7.md","mtime":"2017-02-27T04:03:50.403Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

