
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter5.html" />
    
    
    <link rel="prev" href="chapter3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第四章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x548C;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x6218;&#x4E89;-1">&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x548C;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x6218;&#x4E89; [1]</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x5230;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x968F;&#x4FBF;&#x53BB;&#x627E;&#x4E2A;&#x4EBA;&#x95EE;&#xFF1A;&#x4F60;&#x4EEC;&#x5355;&#x4F4D;&#x8BA1;&#x7B97;&#x673A;&#x6700;&#x725B;&#x7684;&#x662F;&#x8C01;&#xFF1F;&#x591A;&#x534A;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x7684;&#x7B54;&#x6848;&#x662F;&#xFF1A;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x4EBA;&#x3002;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x7EE7;&#x7EED;&#x95EE;&#xFF0C;&#x9664;&#x4E86;&#x4ED6;&#x4EEC;&#x662F;&#x8C01;&#xFF1F;&#x591A;&#x534A;&#x7684;&#x7B54;&#x6848;&#x662F;&#xFF1A;&#x8D22;&#x52A1;&#x90E8;&#x7684;&#x5427;&#x3002;&#x6655;&#x3002;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x4F60;&#x518D;&#x95EE;&#xFF0C;&#x9664;&#x4E86;&#x4ED6;&#x4EEC;&#x5462;&#xFF1F;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x7684;&#x7B54;&#x6848;&#x662F;&#xFF1A;&#x5E94;&#x8BE5;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x5427;&#xFF1F;<br>&#x3000;&#x3000;&#x4ECE;&#x8FD9;&#x91CC;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x5728;&#x5355;&#x4F4D;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5FC3;&#x4E2D;&#x8FDE;&#x8D22;&#x52A1;&#x90E8;&#x90A3;&#x5E2E;&#x83DC;&#x9E1F;&#x90FD;&#x4E0D;&#x5982;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7684;&#x4EBA;&#x5305;&#x62EC;&#x9886;&#x5BFC;&#x5FC3;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x90E8;&#x90A3;&#x5E2E;&#x4EBA;&#x662F;&#x5389;&#x5BB3;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6574;&#x5929;&#x4F5C;&#x7684;&#x4E3B;&#x9875;&#x90FD;&#x5728;&#x6211;&#x4EEC;&#x7F51;&#x7EDC;&#x4E0A;&#x968F;&#x5904;&#x53EF;&#x89C1;&#x3002;&#x5927;&#x5BB6;&#x6574;&#x5929;&#x90FD;&#x5728;&#x548C;&#x4ED6;&#x4EEC;&#x6253;&#x4EA4;&#x9053;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x89C9;&#x5F97;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;asp&#x641E;&#x7684;&#x9875;&#x9762;&#x771F;&#x662F;&#x6F02;&#x4EAE;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x7F51;&#x7EDC;&#x90E8;&#x90A3;&#x5E2E;&#x5BB6;&#x4F19;&#x771F;&#x7684;&#x5C31;&#x4EE5;&#x4E3A;&#x4ED6;&#x4EEC;&#x5F88;&#x725B;&#xFF0C;&#x5C3E;&#x5DF4;&#x5C31;&#x6709;&#x70B9;&#x7FD8;&#x4E86;&#xFF01;&#x7136;&#x540E;&#x662F;&#x8D22;&#x52A1;&#x90E8;&#x90A3;&#x5E2E;&#x5BB6;&#x4F19;&#xFF0C;&#x4ED6;&#x4EEC;&#x641E;&#x4E86;&#x4E2A;&#x5DE5;&#x8D44;&#x67E5;&#x8BE2;&#x7CFB;&#x7EDF;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x6BCF;&#x4E2A;&#x6708;&#x90FD;&#x8981;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x90A3;&#x4E2A;&#x4E1C;&#x897F;&#x3002;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x7684;&#x540D;&#x58F0;&#x4E5F;&#x5F88;&#x597D;&#x3002;<br>&#x3000;&#x3000;&#x552F;&#x72EC;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x90E8;&#xFF0C;&#x5F00;&#x53D1;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6700;&#x8D39;&#x8111;&#x7B4B;&#xFF0C;&#x4F46;&#x662F;&#x5F00;&#x53D1;&#x7684;&#x4E1C;&#x897F;&#x4E00;&#x822C;&#x672C;&#x5355;&#x4F4D;&#x90FD;&#x662F;&#x5C11;&#x6570;&#x4EBA;&#x4F7F;&#x7528;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x5230;&#x5E95;&#x6709;&#x4EC0;&#x4E48;&#x672C;&#x4E8B;&#x3002;&#x518D;&#x52A0;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x5BB6;&#x4F19;&#x4EEC;&#x4E2A;&#x4E2A;&#x90FD;&#x53BB;&#x5543;c&#xFF0B;&#xFF0B;&#xFF0C;&#x53BB;&#x5543;java&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x53BB;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E00;&#x822C;&#x7684;&#x4FEE;&#x6539;&#x6CE8;&#x518C;&#x8868;&#x5440;&#xFF0C;&#x7F51;&#x7EDC;&#x4F7F;&#x7528;&#x6280;&#x5DE7;&#x5440;&#xFF0C;&#x53CD;&#x800C;&#x5C31;&#x5FFD;&#x7565;&#x4E86;&#x3002;&#x4E0D;&#x662F;&#x8FD9;&#x4E9B;&#x54E5;&#x4EEC;&#x4E0D;&#x61C2;&#xFF0C;&#x800C;&#x662F;&#xFF0C;&#x5927;&#x5BB6;&#x89C9;&#x5F97;&#x592A;&#x7B80;&#x5355;&#xFF0C;&#x90FD;&#x8BB0;&#x4E0D;&#x4F4F;&#xFF0C;&#x9700;&#x8981;&#x518D;&#x5230;&#x7F51;&#x4E0A;&#x53BB;&#x67E5;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5C31;&#x8BB0;&#x4E0D;&#x4F4F;&#x3002;<br>&#x3000;&#x3000;&#x6BCF;&#x6B21;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x7684;&#x4EBA;&#x9047;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F00;&#x59CB;&#x8FD8;&#x662F;&#x627E;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x7684;&#x4EBA;&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x4E9B;&#x54E5;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x7B80;&#x5355;&#xFF0C;&#x5230;&#x7F51;&#x4E0A;&#x53BB;&#x627E;&#x4E2A;&#x4E1C;&#x4E1C;&#x4FEE;&#x6B63;&#x4E00;&#x4E0B;&#x5C31;ok&#x4E86;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x4E3A;&#x4E86;&#x627E;&#x90A3;&#x4E2A;&#x4E1C;&#x4E1C;&#xFF0C;&#x6700;&#x540E;&#x82B1;&#x4E86;1&#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x6700;&#x540E;&#x7EC8;&#x4E8E;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x4E0D;&#x5982;&#x7F51;&#x7EDC;&#x90E8;&#x548C;&#x8D22;&#x52A1;&#x90E8;&#x90A3;&#x5E2E;&#x5C0F;&#x5B50;&#x6765;&#x4E86;&#xFF0C;&#x4E0D;&#x5230;10&#x5206;&#x949F;&#x5C31;&#x641E;&#x5B9A;&#x3002;&#x4ED6;&#x4EEC;&#x6574;&#x5929;&#x5C31;&#x662F;&#x641E;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x90FD;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#xFF0C;&#x90FD;&#x8BB0;&#x5230;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x62B1;&#x6028;&#x4ED6;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x95EE;&#xFF0C;api&#x51FD;&#x6570;&#x5982;&#x4F55;&#x62E6;&#x622A;&#xFF0C;vxd&#x5982;&#x4F55;&#x5199;&#x7684;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x5012;&#x3002;&#x5475;&#x5475;&#x54C8;&#x3002;<br>&#x3000;&#x3000;&#x591A;&#x51E0;&#x6B21;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x90E8;&#x7684;&#x4EBA;&#x7684;&#x58F0;&#x8A89;&#x5728;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x5FC3;&#x4E2D;&#x5C31;&#x4F4E;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x4EE5;&#x540E;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x51E0;&#x4E4E;&#x5C31;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x548C;&#x8D22;&#x52A1;&#x90E8;&#x90A3;&#x5E2E;&#x5C0F;&#x5B50;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x5728;&#x610F;&#x3002;&#x672C;&#x6765;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x60F3;&#x5728;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E0A;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5F3A;&#x9879;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x641E;&#x641E;&#x7F51;&#x9875;&#xFF0C;&#x641E;&#x641E;&#x6CE8;&#x518C;&#x8868;&#xFF0C;&#x4E5F;&#x662F;&#x597D;&#x4E8B;&#x60C5;&#x3002;&#x6CA1;&#x4EC0;&#x4E48;&#x53EF;&#x8BF4;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7F51;&#x7EDC;&#x90E8;&#x91CC;&#x9762;&#x5C31;&#x662F;&#x6709;&#x51E0;&#x4E2A;&#x5C0F;&#x5B50;&#xFF0C;&#x603B;&#x662F;&#x548C;&#x6211;&#x4EEC;&#x53EB;&#x677F;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x5C0F;&#x978B;&#x7A7F;&#x3002;&#x8FD9;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x5C31;&#x6709;&#x610F;&#x89C1;&#x4E86;&#xFF0C;&#x8001;&#x864E;&#x4E0D;&#x53D1;&#x5A01;&#xFF0C;&#x4F60;&#x8FD8;&#x771F;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x662F;&#x75C5;&#x732B;&#xFF1F;&#x4F60;&#x4EEC;&#x771F;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x5982;&#x4F60;&#x4EEC;&#xFF1F;&#x54FC;&#xFF01;<br>&#x3000;&#x3000;&#x8F6F;&#x4EF6;&#x90E8;&#x5728;&#x6574;&#x4E2A;&#x5355;&#x4F4D;&#x7F51;&#x7EDC;&#x7684;&#x5360;&#x7528;&#x91CF;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x5927;&#x7684;&#x3002;&#x5927;&#x5BB6;&#x7ECF;&#x5E38;&#x90FD;&#x662F;&#x8FB9;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FB9;down&#x4E1C;&#x897F;&#x3002;&#x4E8E;&#x516C;&#x7684;&#x6709;&#xFF0C;&#x4E8E;&#x79C1;&#x7684;&#x4E5F;&#x6709;&#x3002;&#x800C;&#x4E14;down&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x5F88;&#x5927;&#x5927;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;visual studio 7CD&#x5440;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;MSDN 2cd&#x5440;&#xFF0C;&#x6BD4;&#x5982;delphi&#x5566;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x53CD;&#x6B63;&#x5168;&#x662F;&#x5927;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x90E8;&#x552F;&#x4E00;&#x7684;MM&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x5979;&#x4E3B;&#x8981;&#x662F;&#x4F5C;&#x6587;&#x6863;&#x7684;&#xFF0C;&#x5199;&#x7A0B;&#x5E8F;&#x76F8;&#x5BF9;&#x8981;&#x5DEE;&#x4E9B;&#x3002;&#x4F46;&#x662F;&#x5979;down&#x7684;&#x4E1C;&#x897F;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x6BD4;&#x6211;&#x4EEC;&#x5C11;&#x3002;&#x6BD4;&#x5982;&#x6D41;&#x661F;&#x82B1;&#x56ED;2&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x4EC0;&#x4E48;&#x84DD;&#x8272;&#x751F;&#x6B7B;&#x604B;&#x5440;&#xFF0C;&#x7B49;&#x7B49;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x90FD;&#x5728;&#x5FD9;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5934;&#x513F;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5C0F;&#x529E;&#x516C;&#x5BA4;&#x91CC;&#x9762;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x52A8;&#x9759;&#x3002;&#x4F30;&#x8BA1;&#x4E5F;&#x5728;&#x5FD9;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x987E;&#x81EA;&#x5DF1;&#x7684;&#x3002;&#x6211;&#x4E5F;&#x6B63;&#x5728;down RedHat 9.0&#xFF0C;3 CD&#x3002;&#x540C;&#x65F6;&#x4E00;&#x8FB9;&#x542C;&#x7740;&#x6811;&#x6728;&#x5E74;&#x534E;&#x7684;&#x90A3;&#x9996;&#x300A;&#x4E2D;&#x5B66;&#x65F6;&#x4EE3;&#x300B;&#xFF0C;&#x7EAF;&#x7EAF;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x771F;&#x4E0D;&#x9519;&#x3002;&#x6211;&#x5C31;&#x559C;&#x6B22;&#x8FD9;&#x79CD;&#x7EAF;&#x7EAF;&#x7684;&#x97F3;&#x4E50;&#x3002;&#x65C1;&#x8FB9;&#x54E5;&#x4EEC;&#x53C8;&#x5728;&#x7528;&#x91CD;&#x5E86;&#x8BDD;&#x5531;&#x90A3;&#x4E2A;&#x5468;&#x6770;&#x4F26;&#x7684;&#x4EC0;&#x4E48;&#x300A;&#x53CC;&#x622A;&#x68CD;&#x300B;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x4F1A;&#x8BA9;&#x6211;&#x6709;&#x8DF3;&#x6402;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6211;&#x5C31;&#x5927;&#x558A;&#xFF1A;&#x518D;&#x5531;&#xFF1F;&#x518D;&#x5531;&#xFF0C;&#x518D;&#x5531;&#x8001;&#x5B50;&#x7528;&#x7D2B;&#x5149;&#x70EB;&#x6B7B;&#x4F60;&#xFF01;<br>&#x3000;&#x3000;&#x563F;&#x563F;&#x54C8;&#x54C8;&#xFF01;&#x54E5;&#x4EEC;&#x5531;&#x5B8C;&#x6700;&#x540E;&#x51E0;&#x4E2A;&#x5B57;&#xFF0C;&#x7F29;&#x5230;&#x4ED6;&#x684C;&#x5B50;&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x5176;&#x4ED6;&#x54E5;&#x4EEC;&#x5C31;&#x7B11;&#x3002;&#x6211;&#x4EEC;&#x90E8;&#x7684;MM&#x5C31;&#x5BF9;&#x6211;&#x7FFB;&#x767D;&#x773C;&#x3002;<br>&#x3000;&#x3000;&#x7528;&#x7D2B;&#x5149;&#x70EB;&#x6B7B;&#x4F60;&#xFF0C;&#x8FD9;&#x53E5;&#x8BDD;&#x5728;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x662F;&#x6709;&#x5178;&#x6545;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x90E8;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x914D;&#x4E86;&#x4E2A;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5927;&#x5BB6;&#x5F00;&#x53D1;&#x7A0B;&#x5E8F;&#x5E26;&#x8D77;&#x6765;&#x65B9;&#x4FBF;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x8BBE;&#x5907;&#x90FD;&#x662F;&#x8BBE;&#x5907;&#x79D1;&#x7EDF;&#x4E00;&#x4E70;&#x7684;&#x3002;&#x90A3;&#x5E2E;&#x83DC;&#x9E1F;&#x4E0D;&#x77E5;&#x662F;&#x56E0;&#x4E3A;&#x7231;&#x56FD;&#xFF0C;&#x8FD8;&#x662F;&#x56E0;&#x4E3A;&#x4FBF;&#x5B9C;&#xFF0C;&#x5C31;&#x7EDF;&#x4E00;&#x4E70;&#x7684;&#x7D2B;&#x5149;&#x3002;&#x7D2B;&#x5149;&#x6700;&#x5927;&#x7684;&#x6BDB;&#x75C5;&#x5C31;&#x662F;&#x53D1;&#x70ED;&#x91CF;&#x5927;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x4EEC;&#x90E8;&#x90A3;&#x4E2A;MM&#x521A;&#x6765;&#x4E0D;&#x4E45;&#xFF0C;&#x53C8;&#x662F;&#x590F;&#x5929;&#xFF0C;&#x5F00;&#x4E86;&#x4E00;&#x4E0A;&#x5348;&#x7684;&#x673A;&#x5668;&#x90FD;&#x662F;&#x653E;&#x5230;&#x684C;&#x5B50;&#x4E0A;&#x7684;&#x3002;&#x5403;&#x996D;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x6CA1;&#x6709;&#x5173;&#xFF0C;&#x5403;&#x996D;&#x56DE;&#x6765;&#xFF0C;&#x5927;&#x5BB6;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x5439;&#x725B;&#x3002;MM&#x53EF;&#x80FD;&#x60F3;&#x4E00;&#x8FB9;&#x542C;&#x6211;&#x4EEC;&#x8BF4;&#x8BDD;&#xFF0C;&#x4E00;&#x8FB9;&#x6572;&#x4E9B;&#x6587;&#x6863;&#x5427;&#xFF0C;&#x53CD;&#x6B63;&#x5979;&#x5C31;&#x628A;&#x90A3;&#x4E2A;&#x7D2B;&#x5149;&#x62FF;&#x8FC7;&#x6765;&#xFF0C;&#x62FF;&#x8FC7;&#x6765;&#x76F4;&#x63A5;&#x5C31;&#x653E;&#x5979;&#x5927;&#x817F;&#x4E0A;&#x4E86;&#x3002;&#x53EA;&#x542C;&#xFF0C;&#x201C;&#x554A;&#x201D;&#x4E00;&#x58F0;&#x60E8;&#x53EB;&#xFF0C;MM&#x5C31;&#x8DF3;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x7D2B;&#x5149;&#x5C31;&#x6454;&#x5730;&#x4E0A;&#x4E86;&#x3002;&#x4F60;&#x60F3;&#x5440;&#xFF0C;&#x590F;&#x5929;&#xFF0C;&#x4EBA;&#x5BB6;MM&#x5C31;&#x7A7F;&#x4E86;&#x4E00;&#x4E2A;&#x4E1D;&#x889C;&#xFF0C;&#x4E00;&#x4E2A;&#x88D9;&#x5B50;&#xFF0C;&#x5F53;&#x65F6;&#x7B14;&#x8BB0;&#x672C;&#x5C31;&#x653E;&#x5979;&#x4E1D;&#x889C;&#x4E0A;&#x4E86;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x7D2B;&#x5149;&#x786E;&#x5B9E;&#x592A;&#x70EB;&#xFF0C;&#x8FD8;&#x662F;&#x6211;&#x4EEC;&#x90A3;&#x4F4D;MM&#x7279;&#x522B;&#x654F;&#x611F;&#x3002;&#x53CD;&#x6B63;&#x5F53;&#x65F6;&#x5979;&#x5C31;&#x8DF3;&#x8D77;&#x6765;&#x3002;&#x5413;&#x6211;&#x4EEC;&#x51E0;&#x4E2A;&#x54E5;&#x4EEC;&#x4E00;&#x8DF3;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x53EA;&#x542C;MM&#x4E00;&#x8FB9;&#x6478;&#x5979;&#x7684;&#x817F;&#xFF0C;&#x4E00;&#x8FB9;&#x8BF4;&#x70EB;&#x3002;&#x5927;&#x5BB6;&#x624D;&#x660E;&#x767D;&#x8FC7;&#x6765;&#x3002;&#x5F53;&#x65F6;&#xFF0C;&#x51E0;&#x4E2A;&#x54E5;&#x4EEC;&#x7B11;&#x7684;&#x4E0D;&#x884C;&#x3002;&#x5E2E;MM&#x6361;&#x8D77;&#x7D2B;&#x5149;&#xFF0C;&#x8FD8;&#x597D;&#xFF0C;&#x8FD8;&#x6CA1;&#x7387;&#x574F;&#x3002;&#x4ECE;&#x6B64;&#xFF0C;&#x7D2B;&#x5149;&#x5728;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x51FA;&#x540D;&#x4E86;&#x3002;&#x7528;&#x7D2B;&#x5149;&#x70EB;&#x6B7B;&#x4F60;&#xFF0C;&#x4E5F;&#x6210;&#x4E86;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6700;&#x6709;&#x521B;&#x610F;&#x7684;&#x5A01;&#x80C1;&#x4EBA;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6BCF;&#x6B21;&#x7528;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x7B11;&#x3002;</p>
<p>&#x201C;&#x54A6;&#xFF0C;&#x7F51;&#x7EDC;&#x53C8;&#x4E0D;&#x901A;&#x4E86;&#xFF01;&#x201D;&#x6211;&#x4EEC;&#x90A3;&#x4F4D;MM&#x558A;&#x9053;&#x3002;&#x6211;&#x4EEC;&#x90A3;&#x4F4D;MM&#x53EB;&#x674E;&#x5A9B;&#x5A9B;&#xFF0C;&#x957F;&#x5F97;&#x86EE;&#x6F02;&#x4EAE;&#x7684;&#x3002;&#x5176;&#x4ED6;&#x54E5;&#x4EEC;&#x90FD;&#x5BF9;&#x5979;&#x5782;&#x6D8E;&#x4E09;&#x5C3A;&#x5B50;&#x3002;&#x4E0D;&#x8FC7;&#x597D;&#x50CF;&#x6211;&#x4EEC;&#x7684;&#x674E;MM&#x90FD;&#x662F;&#x767D;&#x773C;&#x4F3A;&#x5019;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x771F;&#x7684;&#x5440;&#xFF0C;&#x4ED6;&#x5988;&#x7684;&#x7F51;&#x7EDC;&#x90E8;&#xFF01;&#x201D;&#x987F;&#x65F6;&#x62B1;&#x6028;&#x58F0;&#x5F00;&#x59CB;&#x6B64;&#x8D77;&#x5F7C;&#x4F0F;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x770B;&#xFF0C;&#x771F;&#x662F;&#x7684;&#xFF0C;flashget&#x7684;&#x7A97;&#x53E3;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x7EFF;&#x8272;&#x901F;&#x5EA6;&#x7EBF;&#x4E86;&#x3002;&#x5934;&#x513F;&#xFF0C;&#x4E5F;&#x4ECE;&#x529E;&#x516C;&#x5BA4;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x95EE;&#xFF1A;&#x201C;&#x7F51;&#x7EDC;&#x662F;&#x4E0D;&#x662F;&#x4E0D;&#x901A;&#x4E86;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x770B;&#x5230;&#x5927;&#x5BB6;&#x7684;&#x62B1;&#x6028;&#xFF0C;&#x5934;&#x513F;&#x9A6C;&#x4E0A;&#x56DE;&#x53BB;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;&#x4ED6;&#x6B63;&#x5728;&#x62E8;&#x7535;&#x8BDD;&#x3002;&#x597D;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x4ED6;&#x51FA;&#x6765;&#x4E86;&#xFF1A;&#x201C;&#x7F51;&#x7EDC;&#x90E8;&#x8BF4;&#x8FDE;&#x63A5;&#x6211;&#x4EEC;&#x79D1;&#x5BA4;&#x7684;&#x4EA4;&#x6362;&#x673A;&#x6709;&#x6545;&#x969C;&#xFF0C;&#x90FD;&#x602A;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x91CF;&#x592A;&#x5927;&#x4E86;&#x3002;&#x4ED6;&#x4EEC;&#x4F1A;&#x5C3D;&#x5FEB;&#x4FEE;&#x597D;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x8FD9;&#x5DF2;&#x7ECF;&#x662F;&#x8FD9;&#x5468;&#x7B2C;4&#x6B21;&#x4E86;&#xFF0C;&#x57FA;&#x672C;&#x6BCF;&#x5929;&#x90FD;&#x4F1A;&#x6765;&#x8FD9;&#x4E48;&#x4E00;&#x4E0B;&#x5B50;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x6068;&#x7684;&#x7259;&#x75D2;&#x75D2;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x9760;&#xFF0C;&#x4E0D;&#x4F1A;&#x4EA4;&#x6362;&#x673A;&#x5929;&#x5929;&#x90FD;&#x5728;&#x51FA;&#x6545;&#x969C;&#x5427;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x771F;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x61C2;&#x5440;&#xFF0C;&#x54EA;&#x91CC;&#x6709;&#x6570;&#x636E;&#x91CF;&#x5927;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#x5C31;&#x4F1A;&#x51FA;&#x6545;&#x969C;&#x7684;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x662F;&#x5440;&#xFF0C;&#x6700;&#x591A;&#x5C31;&#x662F;&#x901F;&#x5EA6;&#x6162;&#x561B;&#xFF1F;&#x54EA;&#x91CC;&#x4F1A;&#x65AD;&#x6389;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x5F00;&#x59CB;&#x4E03;&#x5634;&#x516B;&#x820C;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x77E5;&#x9053;&#x5927;&#x5BB6;&#x8BF4;&#x7684;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4EA4;&#x6362;&#x673A;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x8FD9;&#x4E48;&#x5BB9;&#x6613;&#x51FA;&#x95EE;&#x9898;&#x3002;&#x5373;&#x4F7F;&#x51FA;&#x6765;&#x95EE;&#x9898;&#xFF0C;&#x6362;&#x4E86;&#x4E4B;&#x540E;&#x4E5F;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x5BB9;&#x6613;&#x5C31;&#x53C8;&#x51FA;&#x95EE;&#x9898;&#x5427;&#x3002;&#x6211;&#x7528;&#x6211;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x548C;&#x7F51;&#x5173;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x53D1;&#x73B0;&#x8FDE;&#x63A5;&#x5EFA;&#x7ACB;&#x6210;&#x529F;&#x3002;&#x4F46;&#x662F;&#x9A6C;&#x4E0A;&#x5C31;&#x88AB;&#x65AD;&#x6389;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x5F88;&#x5FEB;&#x3002;&#x6362;&#x4F5C;&#x5176;&#x5B83;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x662F;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x548C;&#x7F51;&#x7EDC;&#x4E0D;&#x901A;&#x6548;&#x679C;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x6211;&#x7ACB;&#x523B;&#x660E;&#x767D;&#x4E86;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x6709;&#x4EBA;&#x5728;&#x641E;&#x9B3C;&#x3002;&#x660E;&#x663E;&#x662F;&#x5728;&#x6211;&#x4EEC;&#x90E8;&#x95E8;&#x7684;&#x7F51;&#x5173;&#x4E0A;&#x52A8;&#x4E86;&#x624B;&#x811A;&#x3002;&#x8FD8;&#x8BF4;&#x662F;&#x4EA4;&#x6362;&#x673A;&#x51FA;&#x6545;&#x969C;&#x3002;&#x771F;&#x662F;&#x6B3A;&#x8D1F;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x73A9;&#x8FC7;&#x7F51;&#x7EDC;&#x5417;&#xFF1F;&#x6211;&#x5206;&#x6790;&#x4E86;&#x4E00;&#x4E0B;&#x539F;&#x56E0;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x662F;&#x5728;&#x8FDE;&#x63A5;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x90A3;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x53E3;&#x5B50;&#x4E0A;&#x4F5C;&#x4E86;&#x8FC7;&#x6EE4;&#x6216;&#x8005;&#x89C4;&#x5219;&#x9650;&#x5B9A;&#x3002;&#x660E;&#x663E;&#x7684;&#x4EBA;&#x4E3A;&#x6545;&#x969C;&#x3002;<br>&#x3000;&#x3000;&#x5230;&#x4E86;&#x8BE5;&#x6559;&#x8BAD;&#x4ED6;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#x4E86;&#xFF0C;&#x5426;&#x5219;&#x4ED6;&#x4EEC;&#x8001;&#x8FD9;&#x4E48;&#x641E;&#xFF0C;&#x641E;&#x7684;&#x4E0A;&#x73ED;&#x90FD;&#x5FC3;&#x60C5;&#x4E0D;&#x597D;&#x3002;&#x6211;&#x6700;&#x70E6;&#x7684;&#x5C31;&#x662F;&#x4E0B;&#x4E1C;&#x897F;&#x4E0B;&#x5230;&#x4E00;&#x534A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7F51;&#x7EDC;&#x5C31;&#x65AD;&#x6389;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#xFF0C;&#x5BF9;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x65E9;&#x5C31;&#x641E;&#x7684;&#x5F88;&#x719F;&#x6089;&#x4E86;&#xFF0C;&#x6240;&#x6709;&#x6211;&#x6709;100&#xFF05;&#x7684;&#x628A;&#x63E1;&#x3002;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7528;&#x7684;&#x662F;&#x534E;&#x4E3A;&#x7684;&#x8DEF;&#x7531;&#x5668;&#xFF0C;R262X&#x7CFB;&#x5217;&#x7684;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x7F51;&#x7EDC;&#x90E8;&#x90A3;&#x4E9B;&#x4EBA;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x65E9;&#x5728;&#x51E0;&#x4E2A;&#x6708;&#x524D;&#x6211;&#x5C31;&#x5DF2;&#x7ECF;&#x628A;&#x534E;&#x4E3A;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53CD;&#x7F16;&#x8BD1;&#x5206;&#x6790;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x6BD4;&#x8D77;linux&#x6765;&#x8BF4;&#x8981;&#x7B80;&#x5355;&#x5F97;&#x591A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x521A;&#x4E70;&#x56DE;&#x6765;&#x8FD9;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BBE;&#x5907;&#x79D1;&#x7684;&#x4E00;&#x4E2A;&#x54E5;&#x4EEC;&#x8BA9;&#x6211;&#x53BB;&#x5E2E;&#x4ED6;&#x4EEC;&#x9A8C;&#x6536;&#xFF0C;&#x6211;&#x501F;&#x673A;&#x4F1A;&#x501F;&#x4E86;&#x4E00;&#x53F0;&#x5230;&#x5BB6;&#x91CC;&#x9762;&#xFF0C;&#x5F53;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x5C31;&#x628A;&#x5B83;&#x641E;&#x5230;&#x4E00;&#x4E2A;&#x54E5;&#x4EEC;&#x90A3;&#x91CC;&#xFF0C;&#x90A3;&#x4F4D;&#x54E5;&#x4EEC;&#x662F;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4E00;&#x4E2A;&#x8457;&#x540D;&#x5927;&#x5B66;&#x7535;&#x5B50;&#x5DE5;&#x7A0B;&#x7CFB;&#x7684;&#x52A9;&#x6559;&#x3002;&#x628A;&#x8DEF;&#x7531;&#x5668;&#x641E;&#x5230;&#x4ED6;&#x4EEC;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x4F7F;&#x7528;&#x90A3;&#x4E2A;&#x903B;&#x8F91;&#x5206;&#x6790;&#x4EEA;&#x5668;&#xFF0C;&#x518D;&#x501F;&#x52A9;rom&#x8BFB;&#x5199;&#x5668;&#xFF0C;&#x57FA;&#x672C;&#x628A;&#x5B83;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E9B;&#x4E3B;&#x8981;&#x4E1C;&#x897F;&#x641E;&#x5230;&#x6211;&#x7684;&#x78C1;&#x76D8;&#x4E0A;&#x4E86;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x662F;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x5173;&#x952E;&#x5730;&#x65B9;&#x7684;&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x641E;&#x56DE;&#x5BB6;&#x540E;&#xFF0C;&#x6211;&#x6CA1;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8BFB;&#x4E0A;&#x4E00;&#x6BB5;&#x3002;&#x5F88;&#x5FEB;&#x6211;&#x5C31;&#x6709;&#x4E86;&#x60CA;&#x4EBA;&#x7684;&#x53D1;&#x73B0;&#x3002;&#x539F;&#x6765;&#x534E;&#x4E3A;&#x8DEF;&#x7531;&#x5668;&#x5B58;&#x5728;&#x7740;&#x7279;&#x6743;&#x53E3;&#x4EE4;&#x7684;&#x4E07;&#x80FD;&#x53E3;&#x4EE4;&#xFF01;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8FDB;&#x5165;&#x7279;&#x6743;&#x65B9;&#x5F0F;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x8F93;&#x5165;&#x6B63;&#x786E;&#x7684;&#x53E3;&#x4EE4;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x65E0;&#x6CD5;&#x8FDB;&#x5165;&#x3002;&#x8C61;&#x8BA1;&#x7B97;&#x673A;&#x7684;bios&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x80FD;&#x4E3A;&#x4E86;&#x4ED6;&#x4EEC;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x7EF4;&#x4FEE;&#x65B9;&#x4FBF;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C45;&#x7136;&#x7559;&#x4E86;&#x4E00;&#x4E2A;&#x4E07;&#x80FD;&#x53E3;&#x4EE4;&#x3002;&#x6211;&#x624D;&#x5F7B;&#x5E95;&#x660E;&#x767D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x7684;&#x4F7F;&#x7528;&#x624B;&#x518C;&#x4E0A;&#x8BF4;&#xFF1A;&#x4E07;&#x4E00;&#x4F60;&#x5C06;&#x53E3;&#x4EE4;&#x9057;&#x5FD8;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x534E;&#x4E3A;&#x7ECF;&#x9500;&#x5546;&#x3002;&#x770B;&#x6765;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x662F;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x53E3;&#x4EE4;&#x7684;&#x3002;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x4E07;&#x80FD;&#x53E3;&#x4EE4;&#x90FD;&#x4E0D;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x5426;&#x5219;&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x65E6;&#x6CC4;&#x6F0F;&#xFF0C;&#x90A3;&#x534E;&#x4E3A;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x5C31;&#x522B;&#x60F3;&#x5356;&#x4E86;&#x3002;&#x5373;&#x4F7F;&#x6709;&#x4E9B;&#x4E07;&#x80FD;&#x53E3;&#x4EE4;&#x6CC4;&#x6F0F;&#x51FA;&#x53BB;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x6653;&#x5F97;&#x90A3;&#x53F0;&#x8DEF;&#x7531;&#x5668;&#x5728;&#x4E2D;&#x56FD;&#x7684;&#x54EA;&#x4E2A;&#x89D2;&#x843D;&#x5DE5;&#x4F5C;&#x5462;&#xFF1F;<br>&#x3000;&#x3000;&#x8FD9;&#x4E00;&#x60CA;&#x4EBA;&#x53D1;&#x73B0;&#xFF0C;&#x7740;&#x5B9E;&#x8BA9;&#x6211;&#x5174;&#x594B;&#x4E86;&#x597D;&#x4E45;&#x3002;&#x8FD9;&#x6B21;&#x6211;&#x7684;&#x8FD0;&#x6C14;&#x597D;&#x50CF;&#x4E0D;&#x574F;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x7834;&#x8BD1;&#x4E86;&#x4E07;&#x80FD;&#x53E3;&#x4EE4;&#x7684;&#x90A3;&#x53F0;&#x8DEF;&#x7531;&#x5668;&#x6070;&#x597D;&#x88AB;&#x5B89;&#x88C5;&#x6210;&#x6574;&#x4E2A;&#x5355;&#x4F4D;&#x7684;&#x603B;&#x51FA;&#x53E3;&#x8DEF;&#x7531;&#x5668;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x4F60;&#x60F3;&#x60F3;&#xFF0C;&#x6211;&#x4EE5;&#x524D;&#x8BF4;&#x8FC7;&#x6211;&#x6709;&#x4E2A;c&#x7C7B;&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x968F;&#x4FBF;&#x6362;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x53F0;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x529F;&#x52B3;&#x3002;<br>&#x3000;&#x3000;&#x73B0;&#x5728;&#x6211;&#x53EA;&#x9700;&#x8981;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x5982;&#x6B64;&#x8FD9;&#x822C;&#x8FD9;&#x822C;&#xFF0C;&#x6211;&#x770B;&#x4F60;&#x4EEC;&#x7F51;&#x7EDC;&#x90E8;&#x8FD9;&#x5E2E;&#x5BB6;&#x4F19;&#x8FD8;&#x7ED9;&#x4E0D;&#x7ED9;&#x6211;&#x4EEC;&#x5C0F;&#x978B;&#x7A7F;&#xFF01;&#xFF1F;<br>&#x3000;&#x3000;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x8138;&#x4E0A;&#x6EA2;&#x51FA;&#x4E86;&#x62A5;&#x590D;&#x7684;&#x51B7;&#x7B11;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x6211;&#x6709;100%&#x7684;&#x628A;&#x63E1;&#xFF0C;&#x4F46;&#x662F;&#x60F3;&#x83B7;&#x5F97;&#x8FDE;&#x63A5;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x63A7;&#x5236;&#x6743;&#x529B;&#x8FD8;&#x662F;&#x8981;&#x8D39;&#x70B9;&#x4E8B;&#x7684;&#x3002;&#x800C;&#x4E14;&#x5FC5;&#x987B;&#x505A;&#x5F97;&#x795E;&#x4E0D;&#x77E5;&#x9B3C;&#x4E0D;&#x89C9;&#x7684;&#x3002;&#x6BD5;&#x7ADF;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x4EBA;&#xFF0C;&#x4EBA;&#x6C11;&#x5185;&#x90E8;&#x77DB;&#x76FE;&#xFF0C;&#x5927;&#x5BB6;&#x5F00;&#x5F00;&#x73A9;&#x7B11;&#x4E5F;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x516C;&#x5F00;&#x4E86;&#x5C31;&#x4E0D;&#x597D;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x7F51;&#x7EDC;&#x90E8;&#x90A3;&#x5E2E;&#x54E5;&#x4EEC;&#x548C;&#x6211;&#x7684;&#x5173;&#x7CFB;&#x4E5F;&#x4E0D;&#x9519;&#x3002;&#x5E73;&#x65F6;&#x5E38;&#x5728;&#x4E00;&#x8D77;&#x63A2;&#x8BA8;&#x4E00;&#x4E9B;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x89C1;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x7ECF;&#x5E38;&#x95EE;&#x4ED6;&#x4EEC;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x90A3;&#x4E2A;&#x5934;&#x513F;&#xFF0C;&#x59D3;&#x80E1;&#xFF0C;&#x957F;&#x5F97;&#x548C;&#x300A;&#x6E21;&#x6C5F;&#x4FA6;&#x5BDF;&#x8BB0;&#x300B;&#x91CC;&#x9762;&#x90A3;&#x4E2A;&#x72E1;&#x733E;&#x7684;&#x53C2;&#x8C0B;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x7626;&#x7626;&#x7684;&#xFF0C;&#x6234;&#x4E2A;&#x773C;&#x955C;&#x3002;&#x548C;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x7ECF;&#x5E38;&#x5728;&#x4E2D;&#x5C42;&#x5E72;&#x90E8;&#x4F1A;&#x4E0A;&#x5BF9;&#x7740;&#x5E72;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x662F;&#x535A;&#x58EB;&#xFF0C;&#x90A3;&#x4E2A;&#x80E1;&#x961F;&#x957F;&#xFF08;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x90E8;&#x7684;&#x4EBA;&#x90FD;&#x8FD9;&#x4E48;&#x53EB;&#x4ED6;&#xFF09;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x662F;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5B66;&#x5316;&#x5B66;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E1A;&#x4F59;&#x7231;&#x597D;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x73A9;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x4E5F;&#x5C31;&#x6210;&#x4E86;&#x5176;&#x5B83;&#x90E8;&#x95E8;&#x5FC3;&#x4E2D;&#x7684;&#x9AD8;&#x624B;&#x3002;&#x7531;&#x4E8E;&#x5F53;&#x65F6;&#x7528;flash&#x4F5C;&#x4E86;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7684;&#x5BA3;&#x4F20;&#x6750;&#x6599;&#xFF0C;&#x6DF1;&#x5F97;&#x4E0A;&#x5C42;&#x4EBA;&#x58EB;&#x7684;&#x6B22;&#x5FC3;&#x3002;&#x5F53;&#x65F6;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x8F6F;&#x4EF6;&#x90E8;&#xFF0C;&#x5355;&#x4F4D;&#x5EFA;&#x8BBE;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4EBA;&#x9009;&#xFF0C;&#x4E8E;&#x662F;&#x8FD9;&#x4F4D;&#x201C;&#x9AD8;&#x624B;&#x201D;&#x5C31;&#x5750;&#x4E0A;&#x4E86;&#x7F51;&#x7EDC;&#x90E8;&#x4E3B;&#x4EFB;&#x7684;&#x5B9D;&#x5EA7;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E9B;&#x6211;&#x4E5F;&#x662F;&#x542C;&#x5176;&#x4ED6;&#x5143;&#x8001;&#x7EA7;&#x4EBA;&#x7269;&#x8BF4;&#x7684;&#x3002;&#x6211;&#x4E5F;&#x662F;&#x540E;&#x6765;&#x624D;&#x6765;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x662F;&#x540E;&#x6765;&#x624D;&#x6765;&#x7684;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x80FD;&#x8F6E;&#x5F97;&#x4E0A;&#x4ED6;&#x3002;&#x6BCF;&#x6B21;&#x5F53;&#x80E1;&#x961F;&#x957F;&#x5728;&#x4F1A;&#x4E0A;&#x5C55;&#x793A;&#x4ED6;&#x4EEC;&#x641E;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x53EF;&#x4E00;&#x4E16;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x603B;&#x662F;&#x4F1A;&#x7528;&#x82E5;&#x5E72;&#x65E0;&#x6CD5;&#x8FA9;&#x9A73;&#x7684;&#x9053;&#x7406;&#x628A;&#x4ED6;&#x4EEC;&#x7684;&#x4E1C;&#x897F;&#x9A73;&#x5F97;&#x4F53;&#x65E0;&#x5B8C;&#x80A4;&#x3002;&#x6BCF;&#x6B21;&#x80E1;&#x961F;&#x957F;&#x90FD;&#x4E0B;&#x4E0D;&#x6765;&#x53F0;&#x3002;&#x4F60;&#x60F3;&#xFF0C;&#x4E2D;&#x56FD;&#x5B98;&#x573A;&#x7684;&#x6597;&#x4E89;&#x5F88;&#x5FAE;&#x5999;&#xFF0C;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x5FC3;&#x91CC;&#x6709;&#x6570;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4ED6;&#x6068;&#x4E0A;&#x6211;&#x4EEC;&#x5934;&#x513F;&#xFF0C;&#x5E76;&#x4E14;&#x8FDE;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x90E8;&#x7684;&#x4EBA;&#x90FD;&#x4E00;&#x8D77;&#x6068;&#x4E0A;&#xFF0C;&#x8FD9;&#x662F;&#x518D;&#x597D;&#x7406;&#x89E3;&#x4E0D;&#x8FC7;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x4EE5;&#x4ED6;&#x7684;&#x7406;&#x8BBA;&#x6C34;&#x5E73;&#xFF0C;&#x60F3;&#x548C;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x641E;&#x6587;&#x6597;&#x663E;&#x7136;&#x662F;&#x6CA1;&#x620F;&#x4E86;&#x3002;&#x80E1;&#x961F;&#x957F;&#x662F;&#x548C;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x5EFA;&#x8BBE;&#x4E00;&#x8D77;&#x6210;&#x957F;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x5176;&#x5B83;&#x65B9;&#x9762;&#x4ED6;&#x4E0D;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x5728;&#x7F51;&#x7EDC;&#x65B9;&#x9762;&#x914D;&#x7F6E;&#x7684;&#x719F;&#x7EC3;&#x7A0B;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x5439;&#x7684;&#x3002;&#x5728;&#x8DEF;&#x7531;&#x5668;&#x6216;&#x8005;&#x9632;&#x706B;&#x5899;&#x65B9;&#x9762;&#x641E;&#x70B9;&#x5C0F;&#x624B;&#x811A;&#x3002;&#x8FD8;&#x4E0D;&#x662F;&#x5C0F;&#x83DC;&#x4E00;&#x789F;&#xFF1F;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x5176;&#x4ED6;&#x4EBA;&#x4EE3;&#x52B3;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x95EE;&#x8FC7;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x54E5;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BF4;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x5BC6;&#x7801;&#x53EA;&#x6709;&#x4ED6;&#x4EEC;&#x5934;&#x513F;&#x624D;&#x6709;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x90FD;&#x662F;&#x4ED6;&#x4EEC;&#x5934;&#x513F;&#x914D;&#x7F6E;&#x7684;&#x3002;&#x770B;&#x6765;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x80AF;&#x5B9A;&#x548C;&#x6211;&#x4EEC;&#x73A9;&#x9634;&#x7684;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x5934;&#x513F;&#xFF0C;&#x6211;&#x60F3;&#x80AF;&#x5B9A;&#x77E5;&#x9053;&#x3002;&#x535A;&#x58EB;&#x7684;&#x601D;&#x60F3;&#x6C34;&#x5E73;&#x7EDD;&#x5BF9;&#x5C31;&#x662F;&#x6BD4;&#x4F60;&#x4E00;&#x822C;&#x4EBA;&#x9AD8;&#xFF0C;&#x4E0D;&#x670D;&#x4E0D;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x7684;&#x4E3B;&#x653B;&#x65B9;&#x5411;&#x662F;&#x7F51;&#x7EDC;&#x52A0;&#x5BC6;&#x3002;&#x5BF9;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x7684;&#x7814;&#x7A76;&#x4E0D;&#x670D;&#x4E0D;&#x884C;&#x3002;&#x6211;&#x8BF7;&#x6559;&#x8FC7;&#x4ED6;&#x5F88;&#x591A;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x771F;&#x662F;&#x5389;&#x5BB3;&#x5440;&#xFF0C;&#x4E00;&#x9488;&#x89C1;&#x8840;&#xFF0C;&#x8BA9;&#x6211;&#x660E;&#x767D;&#x4E86;&#x4E0D;&#x5C11;&#x3002;&#x6BD4;&#x6709;&#x4E9B;&#x72D7;&#x5C41;&#x4E66;&#x4E0A;&#x8BF4;&#x7684;&#x597D;&#x5F97;&#x591A;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6709;&#x4E9B;&#x4E66;&#x7684;&#x4F5C;&#x8005;&#x6211;&#x6000;&#x7591;&#x4ED6;&#x81EA;&#x5DF1;&#x90FD;&#x6CA1;&#x6709;&#x641E;&#x61C2;&#xFF0C;&#x5C31;&#x6284;&#x4E0A;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x5C31;&#x662F;&#x4E0D;&#x8BF4;&#x3002;&#x5C31;&#x662F;&#x4E0D;&#x505C;&#x5730;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x7F51;&#x7EDC;&#x90E8;&#x50AC;&#xFF0C;&#x6216;&#x8005;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x5934;&#x513F;&#x7684;&#x5934;&#x513F;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6211;&#x7684;&#x673A;&#x5668;&#x65E0;&#x6CD5;&#x4E0A;&#x7F51;&#xFF0C;&#x62DB;&#x6570;&#x518D;&#x591A;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x7528;&#x5904;&#x3002;&#x5230;&#x9694;&#x58C1;&#x8D22;&#x52A1;&#x5904;&#x53BB;&#x5427;&#xFF0C;&#x5BB9;&#x6613;&#x66B4;&#x9732;&#x3002;&#x90A3;&#x5E2E;&#x5BB6;&#x4F19;&#x867D;&#x7136;&#x5BF9;&#x7F16;&#x7A0B;&#x4E0D;&#x61C2;&#xFF0C;&#x4F46;&#x662F;&#x5E94;&#x8BE5;&#x770B;&#x5F97;&#x51FA;&#x6765;&#x4F60;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x505A;&#x9ED1;&#x5BA2;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x7528;&#x8D77;&#x6765;&#x987A;&#x624B;&#x3002;<br>&#x3000;&#x3000;&#x7BA1;&#x4ED6;&#x7684;&#xFF0C;&#x5148;&#x60F3;&#x529E;&#x6CD5;&#x4E0A;&#x7F51;&#x518D;&#x8BF4;&#x3002;&#x8D22;&#x52A1;&#x90E8;&#x548C;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x90E8;&#x8FDE;&#x63A5;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4EA4;&#x6362;&#x673A;&#x3002;&#x8FD9;&#x4E2A;&#x4EA4;&#x6362;&#x673A;&#x518D;&#x8FDE;&#x63A5;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x3002;&#x4ED6;&#x4EEC;&#x7F51;&#x7EDC;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#x3002;&#x8BF4;&#x660E;&#x51E1;&#x662F;&#x8F6F;&#x4EF6;&#x90E8;&#x7684;ip&#x80AF;&#x5B9A;&#x90FD;&#x88AB;&#x8FC7;&#x6EE4;&#x6389;&#x4E86;&#x3002;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x673A;&#x5668;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EA4;&#x6362;&#x673A;&#x76F4;&#x63A5;&#x8FDE;&#x63A5;&#x5230;&#x603B;&#x51FA;&#x53E3;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x80E1;&#x961F;&#x957F;&#x5BF9;&#x5168;&#x5355;&#x4F4D;&#x7684;&#x673A;&#x5668;&#x90FD;&#x4F5C;&#x4E86;ip&#x548C;&#x7F51;&#x5361;&#x7ED1;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;ip&#x6CA1;&#x529E;&#x6CD5;&#x6539;&#x7684;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x6539;&#x4E2A;&#x8D22;&#x52A1;&#x90E8;&#x7684;ip&#x5C31;&#x53EF;&#x4EE5;&#x4E0A;&#x7F51;&#x4E86;&#x3002;<br>&#x3000;&#x3000;ping&#x4E86;ping&#x8D22;&#x52A1;&#x90E8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x4E0D;&#x51FA;&#x6240;&#x6599;&#xFF0C;&#x679C;&#x7136;&#x662F;&#x901A;&#x7684;&#x3002;&#x663E;&#x7136;&#x4E0D;&#x662F;&#x4EA4;&#x6362;&#x673A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8981;&#x4E0A;&#x7F51;&#xFF0C;&#x53EA;&#x597D;&#x5728;&#x8D22;&#x52A1;&#x90E8;&#x4E2D;&#x627E;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x5E2E;&#x6211;&#x4E00;&#x4E0B;&#x4E86;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x90A3;&#x53F0;&#x8D22;&#x52A1;&#x90E8;&#x7684;&#x4FE1;&#x606F;&#x53D1;&#x5E03;server&#x4E86;&#x3002;&#x901F;&#x5EA6;&#x5757;&#xFF0C;&#x91CF;&#x53C8;&#x8DB3;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x4E0D;&#x7528;&#x7834;&#x5BC6;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4ED6;&#x4EEC;&#x5B89;&#x88C5;&#x8865;&#x4E01;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x5B89;&#x4E86;&#x540E;&#x95E8;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x505A;&#xFF0C;&#x5C31;&#x7559;&#x4E2A;&#x540E;&#x95E8;&#x3002;&#x4ECE;&#x6CA1;&#x6709;&#x7528;&#x8FC7;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6CA1;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x5FC5;&#x987B;&#x8981;&#x7528;&#x4E00;&#x4E0B;&#x4E86;&#x3002;<br>&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x4F60;&#x4EEC;&#x8FD9;&#x4E2A;&#x8D22;&#x52A1;&#x5904;&#x4E5F;&#x592A;&#x83DC;&#x4E86;&#x5427;&#xFF0C;&#x4F60;&#x4EEC;&#x7684;&#x91D1;&#x878D;&#x5B89;&#x5168;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x5440;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x4ED6;&#x4EEC;&#x83DC;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;server&#x91CC;&#x9762;&#x6CA1;&#x6709;&#x6211;&#x4EEC;&#x90E8;&#x95E8;&#x7684;&#x8D22;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5728;&#x53E6;&#x5916;&#x4E00;&#x53F0;&#x5355;&#x72EC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x63A5;&#x5165;&#x7F51;&#x7EDC;&#x7684;&#xFF0C;&#x4ECE;&#x8F6F;&#x4EF6;&#x5230;&#x786C;&#x4EF6;&#x90FD;&#x662F;&#x4E0A;&#x7EA7;&#x90E8;&#x95E8;&#x7EDF;&#x4E00;&#x914D;&#x53D1;&#x7684;&#x3002;&#x8FD9;&#x53F0;server&#x5C31;&#x662F;&#x53D1;&#x5E03;&#x4FE1;&#x606F;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x8BF4;&#x5C31;&#x662F;&#x641E;&#x5DE5;&#x8D44;&#x67E5;&#x8BE2;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x6708;&#x7684;&#x5DE5;&#x8D44;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4F7F;&#x7528;access&#x6570;&#x636E;&#x5E93;copy&#x4E0A;&#x53BB;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x4EF7;&#x503C;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x653B;&#x5165;&#x4E86;&#xFF0C;&#x5BF9;&#x8D22;&#x52A1;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#x3002;<br>&#x975E;&#x5E38;&#x8F7B;&#x677E;&#x7684;&#x8FDB;&#x5165;&#x90A3;&#x53F0;server&#x3002;&#x5148;&#x770B;&#x770B;&#x5B89;&#x88C5;&#x8DEF;&#x7531;&#x548C;&#x8FDC;&#x7A0B;&#x8BBF;&#x95EE;&#x6CA1;&#x6709;&#xFF1F;&#x4E00;&#x770B;&#xFF0C;&#x6CA1;&#x6709;&#xFF01;&#x770B;&#x6765;&#x8981;&#x5B89;&#x88C5;&#x4E00;&#x4E2A;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x4E86;&#x3002;&#x4F20;&#x4E86;&#x4E2A;proxy&#xFF0B;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5C0F;&#x800C;&#x529F;&#x80FD;&#x4E5F;&#x5F3A;&#x3002;&#x4E00;&#x5207;&#x987A;&#x5229;&#xFF0C;&#x5F88;&#x5FEB;&#x6211;&#x7684;&#x673A;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x4E0A;&#x7F51;&#x4E86;&#x3002;&#x7531;&#x4E8E;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x5185;&#x90E8;&#x7F51;&#xFF0C;100M&#x7684;&#x89C4;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x901F;&#x5EA6;&#x548C;&#x76F4;&#x63A5;&#x4E0A;&#x7F51;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5FC5;&#x987B;&#x83B7;&#x5F97;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x53E3;&#x4EE4;&#x3002;&#x7136;&#x540E;&#x5C31;&#x4E00;&#x5207;ok&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x672C;&#x6765;&#x60F3;&#x76F4;&#x63A5;&#x653B;&#x51FB;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x80E1;&#x961F;&#x957F;&#x7684;&#x7684;ip&#x5927;&#x5BB6;&#x90FD;&#x6653;&#x5F97;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6211;&#x626B;&#x4E86;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4ED6;&#x7684;2000&#x4E13;&#x4E1A;&#x7248;&#x672C;&#x8BE5;&#x52A0;&#x7684;&#x8865;&#x4E01;&#x90FD;&#x52A0;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x5F00;server&#x3002;&#x6240;&#x4EE5;&#x641E;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x9EBB;&#x70E6;&#x3002;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x6211;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x901F;&#x6218;&#x901F;&#x51B3;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x4ED6;&#x80AF;&#x5B9A;&#x5B89;&#x4E86;&#x9632;&#x706B;&#x5899;&#x7684;&#x3002;&#x8BF4;&#x4E0D;&#x5B9A;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x8D22;&#x52A1;&#x5904;&#x7684;server&#x5728;&#x626B;&#x63CF;&#x4ED6;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x5FEB;&#x5FEB;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x5728;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#x548C;&#x9632;&#x62A4;&#x7684;&#x6C34;&#x5E73;&#x7EDD;&#x5BF9;&#x5728;&#x7F51;&#x4E0A;&#x7B97;&#x201C;&#x9AD8;&#x624B;&#x201D;&#x7EA7;&#x522B;&#x7684;&#x3002;&#x4E0D;&#x53EF;&#x8F7B;&#x654C;&#x3002;<br>&#x3000;&#x3000;&#x9996;&#x5148;&#x5728;&#x8D22;&#x52A1;&#x5904;server&#x4E0A;&#x5B89;&#x88C5;&#x4E86;&#x4E2A;&#x8F6F;&#x4EF6;&#x8DEF;&#x7531;&#x5668;&#x3002;&#x7136;&#x540E;&#x8FDB;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x603B;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x5728;&#x8DEF;&#x7531;&#x8868;&#x4E2D;&#x52A0;&#x4E86;&#x4E00;&#x6761;&#x89C4;&#x5219;&#xFF0C;&#x628A;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x6570;&#x636E;&#x5168;&#x90E8;&#x8F6C;&#x53D1;&#x5230;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x8F6F;&#x4EF6;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x518D;&#x8F6C;&#x5411;&#x90A3;&#x4E2A;&#x51FA;&#x53E3;&#x8DEF;&#x7531;&#x5668;&#x3002;&#x63A5;&#x7740;&#x5728;&#x8D22;&#x52A1;&#x5904;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x5B89;&#x88C5;&#x4E86;&#x6211;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x5305;&#x8FC7;&#x6EE4;&#x8F6F;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x5BF9;&#x5916;&#x7684;&#x6570;&#x636E;&#x5305;&#x90FD;&#x4F1A;&#x88AB;&#x6211;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x4ED6;&#x767B;&#x9646;&#x8DEF;&#x7531;&#x5668;&#x4E00;&#x822C;&#x7528;&#x7684;&#x5C31;&#x662F;telnet&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x4E0D;&#x52A0;&#x5BC6;&#x7684;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x7684;&#x5BC6;&#x7801;&#x8FD8;&#x80FD;&#x8DD1;&#x7684;&#x6389;&#xFF1F;<br>&#x3000;&#x3000;&#x4E3A;&#x4E86;&#x8282;&#x7EA6;&#x65F6;&#x95F4;&#xFF0C;&#x5FC5;&#x987B;&#x8BA9;&#x80E1;&#x961F;&#x957F;&#x5FEB;&#x70B9;&#x9001;&#x5BC6;&#x7801;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x62E8;&#x4E86;&#x80E1;&#x961F;&#x957F;&#x7684;&#x7535;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5582;&#xFF0C;&#x80E1;&#x4E3B;&#x4EFB;&#x5417;&#xFF1F;&#x6211;&#x8F6F;&#x4EF6;&#x90E8;&#x3002;&#x521A;&#x624D;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4E86;3&#x5206;&#x949F;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x53C8;&#x4E0D;&#x901A;&#x4E86;&#xFF0C;&#x9EBB;&#x70E6;&#x4F60;&#x4EEC;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#x597D;&#x5417;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x653E;&#x4E0B;&#x7535;&#x8BDD;&#xFF0C;&#x6211;&#x5C31;&#x5F00;&#x52A8;&#x4E86;&#x6211;&#x7684;&#x5305;&#x8FC7;&#x6EE4;&#x8F6F;&#x4EF6;&#x3002;&#x679C;&#x7136;&#xFF0C;&#x5F88;&#x5FEB;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x7684;ip&#x6570;&#x636E;&#x5305;&#x5C31;&#x5F00;&#x59CB;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#x7684;&#x8FC7;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x5DEE;&#x70B9;&#x7B11;&#x51FA;&#x6765;&#x3002;&#x4F60;&#x60F3;&#xFF0C;&#x660E;&#x660E;&#x662F;&#x4ED6;&#x521A;&#x624D;&#x8FC7;&#x6EE4;&#x6389;&#x6211;&#x4EEC;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x504F;&#x504F;&#x8BF4;&#x6211;&#x4EEC;&#x901A;&#x4E86;3&#x5206;&#x949F;&#xFF0C;&#x8FD9;&#x6839;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x4ED6;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8BBE;&#x7F6E;&#x8FD8;&#x4E0D;&#x6E05;&#x695A;&#x5417;&#xFF1F;&#x6240;&#x4EE5;&#x80AF;&#x5B9A;&#x4F1A;&#x91CD;&#x65B0;&#x767B;&#x9646;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x68C0;&#x67E5;&#x8BBE;&#x7F6E;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x80AF;&#x5B9A;&#x8BBE;&#x7F6E;&#x7EDD;&#x5BF9;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x6709;&#x6240;&#x5BDF;&#x89C9;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x679C;&#x7136;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x4ED6;&#x7684;&#x6570;&#x636E;&#x5305;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#x3002;&#x6211;&#x7ACB;&#x523B;&#x4EE5;&#x6700;&#x5FEB;&#x7684;&#x901F;&#x5EA6;down&#x4E0B;&#x8BB0;&#x5F55;&#x6587;&#x4EF6;&#x3002;&#x5E76;&#x6062;&#x590D;&#x4E86;&#x51FA;&#x53E3;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x5220;&#x9664;&#x6389;&#x8D22;&#x52A1;&#x5904;server&#x4E0A;&#x6211;&#x5B89;&#x88C5;&#x7684;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x3002;&#x7136;&#x540E;&#x65AD;&#x6389;&#x8FDE;&#x63A5;&#x3002;&#x5F00;&#x59CB;&#x5728;&#x6211;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x5206;&#x6790;&#x6211;&#x62E6;&#x622A;&#x4E0B;&#x6765;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x81EA;&#x5DF1;&#x5BF9;telnet&#x7684;&#x6570;&#x636E;&#x5305;&#x505A;&#x8FC7;&#x8BD5;&#x9A8C;&#x5206;&#x6790;&#x3002;&#x6240;&#x4EE5;&#x5BC6;&#x7801;&#x7684;&#x4F4D;&#x7F6E;&#x5728;&#x6742;&#x4E71;&#x7684;&#x6570;&#x636E;&#x5305;&#x4E2D;&#x5F88;&#x5FEB;&#x5C31;&#x88AB;&#x5206;&#x6790;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x9760;&#xFF01;&#x5BC6;&#x7801;&#x5C45;&#x7136;&#x662F;~i*hate&amp;doctor%zhang&#x3002;&#x54C8;&#x54C8;&#xFF0C;doctor zhang&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x5566;&#x3002;&#x770B;&#x6765;&#x8FD9;&#x5BB6;&#x4F19;&#x679C;&#x7136;&#x662F;&#x6068;&#x4E0A;&#x4E86;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x4E86;&#xFF0C;&#x8FDE;&#x5BC6;&#x7801;&#x90FD;&#x4E0D;&#x5FD8;&#x8BB0;&#x63D0;&#x9192;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x7684;&#x5BC6;&#x7801;&#x5982;&#x679C;&#x7834;&#x8BD1;&#x8D77;&#x6765;&#x662F;&#x6709;&#x70B9;&#x96BE;&#x5EA6;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x597D;&#x4E86;&#xFF0C;&#x7ACB;&#x523B;&#x8FDB;&#x5165;&#x90A3;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x6253;&#x5F00;&#x9632;&#x706B;&#x5899;&#x7684;&#x8BBE;&#x7F6E;&#x89C4;&#x5219;&#x4E00;&#x770B;&#x3002;&#x679C;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x6DF7;&#x86CB;&#x628A;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x90E8;&#x7684;&#x5730;&#x5740;&#x7684;&#x6570;&#x636E;&#x5305;&#x5168;&#x90E8;drop&#x6389;&#x4E86;&#x3002;&#x6211;&#x5220;&#x9664;&#x6389;&#x540E;&#xFF0C;&#x7ACB;&#x523B;&#x9000;&#x51FA;&#xFF0C;&#x7F51;&#x7EDC;&#x7ACB;&#x523B;&#x5C31;&#x901A;&#x4E86;&#x3002;&#x968F;&#x7740;&#x674E;MM&#x4E00;&#x58F0;&#x6B22;&#x547C;&#xFF1A;&#x201C;&#x901A;&#x4E86;&#xFF0C;&#x7F51;&#x7EDC;&#x901A;&#x4E86;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;flashget&#x90FD;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x7EFF;&#x8272;&#x7EBF;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x6B22;&#x547C;&#x4E86;&#x51E0;&#x58F0;&#xFF0C;&#x53C8;&#x5F00;&#x59CB;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5728;&#x60F3;&#xFF0C;&#x8981;&#x4E0D;&#x8981;&#x628A;&#x7279;&#x6743;&#x53E3;&#x4EE4;&#x6539;&#x4E86;&#xFF0C;&#x8BA9;&#x80E1;&#x961F;&#x957F;&#x53BB;&#x627E;&#x7ECF;&#x9500;&#x5546;&#x3002;&#x540E;&#x6765;&#x60F3;&#x60F3;&#xFF0C;&#x4E0D;&#x597D;&#x3002;&#x73A9;&#x7B11;&#x5F00;&#x7684;&#x5927;&#x4E86;&#x70B9;&#x3002;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FC7;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x8FC7;&#x6765;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x548C;&#x4ED6;&#x6253;&#x7740;&#x54C8;&#x54C8;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x8BF4;&#x4EE5;&#x540E;&#x4E0D;&#x4F1A;&#x65AD;&#x4E86;&#x5427;&#xFF1F;&#x80E1;&#x961F;&#x957F;&#x4E0D;&#x81EA;&#x7136;&#x7684;&#x7B11;&#x7740;&#x3002;&#x773C;&#x775B;&#x5374;&#x4E0D;&#x505C;&#x5730;&#x6328;&#x4E2A;&#x770B;&#x6211;&#x4EEC;&#x7684;&#x5C4F;&#x5E55;&#x3002;&#x770B;&#x6765;&#x8FD9;&#x4E2A;&#x5BB6;&#x4F19;&#x80AF;&#x5B9A;&#x53D1;&#x73B0;&#x6709;&#x4EBA;&#x6539;&#x4E86;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x770B;&#x6765;&#x662F;&#x6765;&#x4FA6;&#x5BDF;&#x6765;&#x4E86;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x6697;&#x6697;&#x597D;&#x7B11;&#x3002;&#x4F46;&#x662F;&#x8868;&#x9762;&#x4E0D;&#x52A8;&#x58F0;&#x8272;&#xFF0C;&#x5728;&#x7F16;&#x6211;&#x7684;java&#x7A0B;&#x5E8F;&#x3002;<br>&#x3000;&#x3000;&#x80E1;&#x961F;&#x957F;&#x8F6C;&#x4E86;&#x4E00;&#x5708;&#x540E;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x6536;&#x83B7;&#x3002;&#x51FA;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4F30;&#x8BA1;&#x4EE5;&#x4ED6;&#x7684;&#x77E5;&#x8BC6;&#x6DF1;&#x5EA6;&#xFF0C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x80FD;&#x60F3;&#x5F97;&#x901A;&#x4EBA;&#x5BB6;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x5165;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x3002;&#x81F3;&#x4E8E;&#x7834;&#x8BD1;&#x4E07;&#x80FD;&#x53E3;&#x4EE4;&#xFF0C;&#x4ED6;&#x4E5F;&#x662F;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x7684;&#x3002;&#x6211;&#x60F3;&#x4ED6;&#x552F;&#x4E00;&#x7684;&#x89E3;&#x91CA;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x4ED6;&#x7684;&#x53E3;&#x4EE4;&#x88AB;&#x522B;&#x4EBA;&#x731C;&#x51FA;&#x6765;&#x3002;&#x679C;&#x7136;&#xFF0C;&#x4ED6;&#x8D70;&#x540E;&#xFF0C;&#x6211;&#x91CD;&#x65B0;&#x8BD5;&#x56FE;&#x8FDB;&#x5165;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x4ED6;&#x7684;&#x53E3;&#x4EE4;&#x5DF2;&#x7ECF;&#x6539;&#x53D8;&#x4E86;&#x3002;&#x80E1;&#x961F;&#x957F;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#x3002;&#x4E00;&#x822C;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x7D20;&#x8D28;&#x7EDD;&#x5BF9;&#x662F;&#x6709;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x201C;shit&#xFF01;&#x201D;&#x6211;&#x5FC3;&#x91CC;&#x60F3;&#xFF0C;&#x4EE5;&#x540E;&#x4ED6;&#x53C8;&#x91CD;&#x65B0;&#x6539;&#x8BBE;&#x7F6E;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x5F97;&#x60F3;&#x529E;&#x6CD5;&#x83B7;&#x5F97;&#x4ED6;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x53E3;&#x4EE4;&#xFF0C;&#x624D;&#x884C;&#x3002;<br>&#x3000;&#x3000;&#x600E;&#x4E48;&#x4E00;&#x52B3;&#x6C38;&#x9038;&#x5730;&#x83B7;&#x5F97;&#x4ED6;&#x7684;&#x53E3;&#x4EE4;&#x5462;&#xFF0C;&#x6211;&#x6B63;&#x60F3;&#x7740;&#x3002;&#x542C;&#x89C1;&#x5934;&#x513F;&#x53EB;&#x6211;&#xFF1A;&#x201C;&#x5C0F;&#x738B;&#xFF0C;&#x8FDB;&#x6765;&#x4E00;&#x4E0B;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x5FC3;&#x91CC;&#x4E00;&#x60CA;&#xFF0C;&#x96BE;&#x9053;&#x80E1;&#x961F;&#x957F;&#x77E5;&#x9053;&#x662F;&#x6211;&#x5E72;&#x7684;&#xFF0C;&#x544A;&#x53D1;&#x6211;&#x4E86;&#xFF1F;<br>&#x3000;&#x3000;&#x6211;&#x5FD0;&#x5FD1;&#x4E0D;&#x5B89;&#x5730;&#x8FDB;&#x5165;&#x5934;&#x513F;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter3.html" class="navigation navigation-prev " aria-label="Previous page: 第三章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter5.html" class="navigation navigation-next " aria-label="Next page: 第五章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四章","level":"1.5","depth":1,"next":{"title":"第五章","level":"1.6","depth":1,"path":"chapter5.md","ref":"chapter5.md","articles":[]},"previous":{"title":"第三章","level":"1.4","depth":1,"path":"chapter3.md","ref":"chapter3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter4.md","mtime":"2017-02-27T04:02:53.882Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

