
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第八章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter9.html" />
    
    
    <link rel="prev" href="chapter7.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第八章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6F14;&#x620F;1">&#x6F14;&#x620F;[1]</h2>
<p>&#x611F;&#x8C22;&#x5927;&#x5BB6;&#x7684;&#x559C;&#x6B22;&#x770B;&#x6211;&#x5199;&#x7684;&#x5C0F;&#x8BF4;&#xFF0C;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x8BF4;&#xFF0C;&#x4F60;&#x8FD9;&#x662F;&#x9ED1;&#x5BA2;&#x6587;&#x7AE0;&#xFF0C;&#x600E;&#x4E48;&#x5982;&#x6B64;&#x7684;&#x751F;&#x6D3B;&#x5316;&#xFF0C;&#x9ED1;&#x5BA2;&#x7684;&#x5F62;&#x8C61;&#x8361;&#x7136;&#x65E0;&#x5B58;&#xFF0C;&#x4F60;&#x770B;&#x7535;&#x5F71;&#xFF0C;&#x4F60;&#x770B;&#x5176;&#x4ED6;&#x5C0F;&#x8BF4;&#xFF0C;&#x9ED1;&#x5BA2;&#x591A;&#x725B;&#xFF1F;&#x4F60;&#x8BF4;&#x7684;&#x90A3;&#x4E2A;&#x9ED1;&#x5BA2;&#x5C0F;&#x738B;&#x600E;&#x4E48;&#x548C;&#x6211;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;&#x600E;&#x4E48;&#x548C;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7BA1;&#x673A;&#x623F;&#x7684;&#x90A3;&#x4E2A;&#x4E2A;&#x5BB6;&#x4F19;&#x5DEE;&#x4E0D;&#x591A;&#xFF1F;&#x600E;&#x4E48;&#x82B1;&#x8FD9;&#x4E48;&#x591A;&#x65F6;&#x95F4;&#x53BB;&#x8BF4;&#x4E3B;&#x4EBA;&#x516C;&#x7684;&#x7684;&#x521D;&#x604B;&#xFF1F;<br>&#x3000;&#x3000;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x6211;&#x8FD9;&#x7BC7;&#x5C0F;&#x8BF4;&#x7684;&#x4E3B;&#x65E8;&#x3002;&#x770B;&#x8FC7;&#x592A;&#x591A;&#x7684;&#x9ED1;&#x5BA2;&#x6587;&#x7AE0;&#xFF0C;&#x548C;&#x9ED1;&#x5BA2;&#x7535;&#x5F71;&#xFF0C;&#x592A;&#x5047;&#x3002;&#x73B0;&#x5728;&#x5927;&#x5BB6;&#x5FC3;&#x76EE;&#x4E2D;&#x7684;&#x9ED1;&#x5BA2;&#x5DF2;&#x7ECF;&#x201C;&#x82F1;&#x96C4;&#x201D;&#x5316;&#x4E86;&#x3002;&#x6211;&#x5199;&#x8FD9;&#x7BC7;&#x5C0F;&#x8BF4;&#x4E3B;&#x8981;&#x5C31;&#x662F;&#x60F3;&#x7ED9;&#x5927;&#x5BB6;&#x8868;&#x73B0;&#x4E00;&#x4E2A;&#x771F;&#x5B9E;&#x7684;&#x9ED1;&#x5BA2;&#x7684;&#x4E16;&#x754C;&#x3002;&#x9ED1;&#x5BA2;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x9ED1;&#x5BA2;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x548C;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x6BD4;&#x8F83;&#x9AD8;&#x8D85;&#x7684;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x4E16;&#x754C;&#x4E0A;&#x5F88;&#x591A;&#x3002;&#x4F46;&#x662F;&#x5927;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x7CBE;&#x529B;&#x548C;&#x6280;&#x672F;&#x82B1;&#x5728;&#x653B;&#x51FB;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x6BD4;&#x5982;&#x8FD9;&#x7BC7;&#x5C0F;&#x8BF4;&#x7684;&#x4E3B;&#x4EBA;&#x516C;&#xFF0C;&#x5C31;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x548C;&#x7CBE;&#x529B;&#x82B1;&#x5728;&#x4E86;&#x653B;&#x51FB;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x5C0F;&#x738B;&#x53D8;&#x6210;&#x4E86;&#x9ED1;&#x5BA2;&#xFF0C;&#x6587;&#x7AE0;&#x4E2D;&#x5C0F;&#x738B;&#x7684;&#x5934;&#x513F;&#xFF0C;&#x5F20;&#x535A;&#x58EB;&#x5C31;&#x53EA;&#x662F;&#x666E;&#x901A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x8005;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x8BBA;&#x7406;&#x8BBA;&#x6DF1;&#x5EA6;&#xFF0C;&#x8BBA;&#x6280;&#x672F;&#x6C34;&#x5E73;&#xFF0C;&#x6211;&#x60F3;&#x5F20;&#x535A;&#x58EB;&#x80AF;&#x5B9A;&#x6BD4;&#x5C0F;&#x738B;&#x5F3A;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C0F;&#x738B;&#x4E5F;&#x662F;&#x670D;&#x6C14;&#x7684;&#x3002;<br>&#x3000;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;&#xFF0C;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#x751F;&#x6D3B;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x9ED1;&#x5BA2;&#x800C;&#x6539;&#x53D8;&#x4EC0;&#x4E48;&#xFF1F;&#x4ED6;&#x4EEC;&#x4E00;&#x6837;&#x8981;&#x7ED3;&#x5A5A;&#x751F;&#x5B50;&#xFF0C;&#x8981;&#x4E70;&#x623F;&#xFF0C;&#x8981;&#x517B;&#x5BB6;&#x3002;&#x4ED6;&#x867D;&#x7136;&#x6709;&#x7740;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x7684;&#x72C2;&#x70ED;&#x7231;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x6574;&#x5929;&#x5C31;&#x53EA;&#x662F;&#x77E5;&#x9053;crack&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x6709;&#x8840;&#x6709;&#x8089;&#x7684;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x5E73;&#x51E1;&#x7684;&#x3002;&#x8FD9;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x3002;<br>&#x3000;&#x3000;&#x672C;&#x6545;&#x4E8B;&#x7684;&#x6240;&#x6709;&#x60C5;&#x8282;&#x548C;&#x4EBA;&#x7269;&#x5747;&#x662F;&#x672C;&#x4EBA;&#x7684;&#x4EB2;&#x8EAB;&#x7ECF;&#x5386;&#x6216;&#x8005;&#x670B;&#x53CB;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x751F;&#x6D3B;&#x4E2D;&#x89C1;&#x8FC7;&#x7684;&#x771F;&#x5B9E;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5168;&#x90E8;&#x90FD;&#x662F;&#x6709;&#x751F;&#x6D3B;&#x539F;&#x578B;&#x7684;&#x3002;&#x5305;&#x62EC;&#x9A6C;&#x4E0A;&#x5199;&#x7684;&#x8FD9;&#x6BB5;&#x6F14;&#x4E60;&#xFF0C;&#x4E5F;&#x662F;&#x786E;&#x6709;&#x5176;&#x4E8B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7EC6;&#x8282;&#x52A0;&#x5DE5;&#x4E5F;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x5426;&#x5219;&#x5C31;&#x4E0D;&#x662F;&#x5C0F;&#x8BF4;&#x4E86;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8BDD;&#x9898;&#x62C9;&#x56DE;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x8BF4;&#x5C0F;&#x738B;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x6BCF;&#x5929;&#x4E0A;&#x73ED;&#xFF0C;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x6253;&#x5F00;&#x6211;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#xFF0C;&#x628A;&#x80E1;&#x961F;&#x957F;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x8D85;&#x7EA7;&#x7EC8;&#x7AEF;&#x7684;&#x4F7F;&#x7528;&#x7684;&#x6309;&#x952E;&#x4FE1;&#x606F;&#x4F20;&#x56DE;&#x6765;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x7CBE;&#x7684;&#x50CF;&#x7334;&#x513F;&#x4F3C;&#x7684;&#xFF0C;&#x5BC6;&#x7801;&#x5B9A;&#x671F;&#x66F4;&#x6362;&#x3002;&#x8981;&#x4E0D;&#x662F;&#x5B89;&#x4E86;&#x4E2A;&#x540E;&#x95E8;&#xFF0C;&#x8FD8;&#x771F;&#x7684;&#x6CA1;&#x529E;&#x6CD5;&#x3002;&#x80E1;&#x961F;&#x957F;&#x5BF9;&#x6211;&#x4EEC;&#x90E8;&#x7F51;&#x7EDC;&#x7684;&#x201C;&#x8FEB;&#x5BB3;&#x201D;&#x4ECE;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#x505C;&#x6B62;&#x8FC7;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x4EE5;&#x5931;&#x8D25;&#x800C;&#x544A;&#x7EC8;&#x3002;&#x653B;&#x514B;&#x4E86;&#x5269;&#x4E0B;&#x7684;&#x4E24;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x6211;&#x83B7;&#x5F97;&#x4E86;&#x6211;&#x4EEC;&#x5206;&#x90E8;&#x7F51;&#x7EDC;&#x7684;&#x5168;&#x90E8;&#x63A7;&#x5236;&#x3002;&#x6BCF;&#x6B21;&#xFF0C;&#x4ED6;&#x6539;&#x4E86;&#x8BBE;&#x7F6E;&#xFF0C;&#x6211;&#x5C31;&#x975E;&#x5E38;&#x5FEB;&#x7684;&#x6539;&#x8FC7;&#x6765;&#xFF0C;&#x5F00;&#x59CB;&#x80E1;&#x961F;&#x957F;&#x8FD8;&#x4EE5;&#x4E3A;&#x8DEF;&#x7531;&#x5668;&#x51FA;&#x6545;&#x969C;&#x4E86;&#x3002;&#x6211;&#x770B;&#x5230;&#x534E;&#x4E3A;&#x670D;&#x52A1;&#x5546;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x8FC7;&#x51E0;&#x6B21;&#x3002;&#x60F3;&#x5FC5;&#x662F;&#x80E1;&#x961F;&#x957F;&#x6253;&#x7684;&#x7535;&#x8BDD;&#x3002;&#x5F53;&#x7136;&#x8DEF;&#x7531;&#x5668;&#x80AF;&#x5B9A;&#x6CA1;&#x6709;&#x574F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4ED6;&#x4EEC;&#x6BCF;&#x6B21;&#x6765;&#x6BCF;&#x6B21;&#x90FD;&#x5F88;&#x5FEB;&#x5C31;&#x56DE;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x80E1;&#x961F;&#x957F;&#x4E00;&#x76F4;&#x6000;&#x7591;&#x6211;&#x4EEC;&#x7684;&#x5934;&#x513F;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x5C31;&#x662F;&#x641E;&#x7F51;&#x7EDC;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x65B9;&#x9762;&#x7684;&#x3002;&#x4ED6;&#x6000;&#x7591;&#x6211;&#x4EEC;&#x5934;&#x513F;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x79CD;&#x4ED6;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x7684;&#x79D8;&#x5BC6;&#x6280;&#x672F;&#x3002;&#x4ED6;&#x6CA1;&#x6709;&#x6000;&#x7591;&#x8FC7;&#x6211;&#xFF0C;&#x5C3D;&#x7BA1;&#x4ED6;&#x4E5F;&#x77E5;&#x9053;&#x6211;&#x7ED9;&#x516C;&#x5B89;&#x5C40;&#x89E3;&#x5BC6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x4ED6;&#x8BA4;&#x4E3A;&#x6211;&#x4E00;&#x4E2A;&#x5C0F;&#x5E74;&#x9752;&#x4E0D;&#x53EF;&#x80FD;&#x8FDE;&#x4ED6;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x90FD;&#x8FDB;&#x5165;&#x7684;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x662F;&#x540E;&#x6765;&#x6211;&#x542C;&#x5934;&#x513F;&#x8BF4;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x80E1;&#x961F;&#x957F;&#x5C45;&#x7136;&#x6000;&#x7591;&#x6211;&#x5BF9;&#x8DEF;&#x7531;&#x5668;&#x52A8;&#x4E86;&#x624B;&#x811A;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x660E;&#x8BF4;&#xFF0C;&#x4F46;&#x662F;&#x7684;&#x5C31;&#x90A3;&#x4E2A;&#x610F;&#x601D;&#x3002;&#x201D;&#x5934;&#x513F;&#x5F53;&#x65F6;&#x4F3C;&#x7B11;&#x975E;&#x7B11;&#x7684;&#x770B;&#x7740;&#x6211;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#x201D;&#x6211;&#x5C31;&#x50BB;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6709;&#x4EBA;&#x5BF9;&#x8DEF;&#x7531;&#x5668;&#x52A8;&#x624B;&#x811A;&#xFF0C;&#x8FD9;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x662F;&#x6211;&#x201D;&#x3002;&#x5934;&#x513F;&#x770B;&#x7740;&#x6211;&#x3002;<br>&#x3000;&#x3000;&#x4ECE;&#x4ED6;&#x7684;&#x76EE;&#x5149;&#x4E2D;&#x6211;&#x77E5;&#x9053;&#x4ED6;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x662F;&#x6211;&#x52A8;&#x7684;&#x624B;&#x811A;&#x3002;&#x5934;&#x513F;&#x53EF;&#x662F;&#x5185;&#x884C;&#x5440;&#xFF0C;&#x4E0D;&#x670D;&#x4E0D;&#x884C;&#x3002;&#x5982;&#x679C;&#x6211;&#x641E;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4E9B;&#x5C0F;&#x806A;&#x660E;&#x7684;&#x5316;&#xFF0C;&#x5934;&#x513F;&#x7814;&#x7A76;&#x7684;&#x4E1C;&#x897F;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x524D;&#x6CBF;&#x79D1;&#x5B66;&#x5440;&#x3002;&#x5934;&#x513F;&#x7684;&#x5F88;&#x591A;&#x8BBA;&#x6587;&#x53D1;&#x8868;&#x5728;&#x56FD;&#x9645;&#x6743;&#x5A01;&#x520A;&#x7269;&#x4E0A;&#xFF0C;&#x4E0D;&#x6015;&#x5927;&#x5BB6;&#x7B11;&#x8BDD;&#xFF0C;&#x6211;&#x597D;&#x591A;&#x90FD;&#x770B;&#x4E0D;&#x61C2;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5C31;&#x50BB;&#x7B11;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x5FC3;&#x7167;&#x4E0D;&#x5BA3;&#x3002;&#x770B;&#x7684;&#x51FA;&#x6765;&#xFF0C;&#x5934;&#x513F;&#x5176;&#x5B9E;&#x7792;&#x9AD8;&#x5174;&#x7684;&#x3002;</p>
<p>&#x6211;&#x6BCF;&#x5929;&#x9664;&#x4E86;&#x5199;&#x5199;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x5206;&#x7ED9;&#x6211;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x6CA1;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5C31;&#x4F1A;&#x627E;&#x4E9B;&#x7A0B;&#x5E8F;&#x8DDF;&#x8E2A;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9ED1;&#x5BA2;&#x3002;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x4E0B;&#x4E2A;&#x9ED1;&#x5BA2;&#x8F6F;&#x4EF6;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#x7F51;&#x4E0A;&#x63D0;&#x4F9B;&#x7684;&#x53EF;&#x4EE5;&#x7528;&#x7684;&#x9ED1;&#x5BA2;&#x8F6F;&#x4EF6;&#x90FD;&#x662F;&#x8FC7;&#x65F6;&#x7684;&#x548C;&#x8DEF;&#x4EBA;&#x7686;&#x77E5;&#x7684;&#xFF0C;&#x5BF9;&#x4ED8;&#x771F;&#x6B63;&#x7684;&#x7F51;&#x7BA1;&#xFF0C;&#x4F60;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4F5C;&#x7528;&#x3002;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x800C;&#x4E14;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x79D8;&#x4E0D;&#x53EF;&#x5BA3;&#x7684;&#x3002;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x4F1A;&#x628A;&#x6211;&#x7684;&#x9ED1;&#x5BA2;&#x8F6F;&#x4EF6;&#x53D1;&#x5E03;&#x5230;&#x7F51;&#x4E0A;&#xFF0C;&#x66F4;&#x4E0D;&#x4F1A;&#x628A;&#x6211;&#x81EA;&#x5DF1;&#x53D1;&#x73B0;&#x7684;&#x6F0F;&#x6D1E;&#x7ED9;&#x4EFB;&#x4F55;&#x4EBA;&#x8BF4;&#x3002;&#x9ED1;&#x5BA2;&#x5C31;&#x9760;&#x8FD9;&#x4E9B;&#x522B;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x6280;&#x672F;&#x5F97;&#x624B;&#xFF0C;&#x544A;&#x8BC9;&#x4E86;&#x522B;&#x4EBA;&#xFF0C;&#x8FD8;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x73B0;&#x5728;&#x6211;&#x6B63;&#x5728;&#x8DDF;&#x8E2A;&#x7684;&#x662F;&#x73B0;&#x5728;windows&#x4E0B;&#x975E;&#x5E38;&#x6D41;&#x884C;&#x7684;&#x4E00;&#x4E2A;ftp server&#x8F6F;&#x4EF6;&#x3002;&#x540D;&#x5B57;&#x53EB;server&#xFF0D;U&#x3002;&#x6211;&#x73B0;&#x5728;&#x8DDF;&#x8E2A;&#x7684;&#x662F;&#x4E2A;4.1&#x7248;&#x672C;&#xFF0C;&#x8DDF;&#x8E2A;&#x4E86;&#x597D;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x7684;&#x3002;&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x601D;&#x60F3;&#x975E;&#x5E38;&#x7684;&#x503C;&#x5F97;&#x79F0;&#x9053;&#x3002;&#x9996;&#x5148;&#x4ED6;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x5E10;&#x53F7;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5173;&#x8054;&#x3002;&#x907F;&#x514D;&#x4E86;&#x5E10;&#x53F7;&#x8BBE;&#x7F6E;&#x4E0D;&#x5F53;&#x7684;&#x5B89;&#x5168;&#x9690;&#x60A3;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4ED6;&#x91C7;&#x7528;&#x4E86;&#x4E25;&#x683C;&#x7684;&#x6743;&#x9650;&#x5236;&#x5EA6;&#xFF0C;&#x6743;&#x9650;&#x591A;&#x800C;&#x4E14;&#x7EC6;&#x3002;&#x8FD8;&#x6709;&#x4ED6;&#x7684;ip&#x63A7;&#x5236;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x901F;&#x5EA6;&#x548C;&#x7A7A;&#x95F4;&#x7684;&#x9650;&#x5236;&#x529F;&#x80FD;&#x3002;&#x771F;&#x7684;&#x975E;&#x5E38;&#x597D;&#x7528;&#x548C;&#x5B89;&#x5168;&#x3002;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x534E;&#x800C;&#x4E0D;&#x5B9E;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E0D;&#x8FC7;&#x4ED6;&#x7684;&#x6548;&#x7387;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x5F31;&#x3002;<br>&#x3000;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x662F;&#x6536;&#x8D39;&#x7684;&#x3002;&#x8981;&#x6CE8;&#x518C;&#x7801;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x8FD9;&#x4E2A;&#x6211;&#x65E9;&#x5C31;&#x5C06;&#x4ED6;&#x5E9F;&#x9664;&#x4E86;&#x3002;&#x4ED6;&#x7684;&#x6CE8;&#x518C;&#x7801;&#x91C7;&#x7528;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x505A;&#x7684;&#x53D8;&#x6362;&#x3002;&#x6211;&#x81F3;&#x4ECA;&#x6CA1;&#x6709;&#x7834;&#x89E3;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4ED6;&#x7684;&#x52A8;&#x6001;&#x53CD;&#x8DDF;&#x8E2A;&#x548C;&#x53CD;&#x4FEE;&#x6539;&#x975E;&#x5E38;&#x8584;&#x5F31;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x76F4;&#x63A5;&#x5C31;&#x628A;&#x6CE8;&#x518C;&#x7801;&#x8FD9;&#x6BB5;&#x7A0B;&#x5E8F;&#x7ED9;&#x4ED6;&#x8DF3;&#x8FC7;&#x4E86;&#x3002;&#x5C45;&#x7136;&#x4E5F;&#x6CA1;&#x6709;&#x5F02;&#x6837;&#xFF0C;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#x3002;<br>&#x3000;&#x6211;&#x73B0;&#x5728;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x60F3;&#x628A;&#x4ED6;&#x7684;&#x901A;&#x8BAF;&#x90E8;&#x5206;&#x597D;&#x597D;&#x7684;&#x8DDF;&#x8E2A;&#x8DDF;&#x8E2A;&#x3002;&#x6216;&#x8BB8;&#x80FD;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x6F0F;&#x6D1E;&#x3002;&#x6839;&#x636E;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6CA1;&#x6709;&#x7A0B;&#x5E8F;&#x662F;&#x5B8C;&#x5584;&#x7684;&#x3002;&#x6F0F;&#x6D1E;&#x7684;&#x5B58;&#x5728;&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#xFF0C;&#x5C31;&#x770B;&#x4F60;&#x6709;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x627E;&#x51FA;&#x6765;&#x3002;<br>&#x3000;&#x8DDF;&#x8E2A;&#x7A0B;&#x5E8F;&#x662F;&#x975E;&#x5E38;&#x8270;&#x82E6;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x53EF;&#x80FD;&#x6BCF;&#x5757;&#x4EE3;&#x7801;&#x90FD;&#x770B;&#x7684;&#x3002;&#x5426;&#x5219;&#x4F60;&#x7EDD;&#x5BF9;&#x4F1A;&#x88AB;&#x7D2F;&#x6B7B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x53EF;&#x6025;&#x8E81;&#x8FD9;&#x662F;&#x9996;&#x8981;&#x7684;&#x3002;&#x6211;&#x975E;&#x5E38;&#x80FD;&#x9759;&#x7684;&#x4E0B;&#x5FC3;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6162;&#x6162;&#x7684;&#x8BFB;&#x7740;&#xFF0C;&#x5173;&#x952E;&#x4EE3;&#x7801;&#x6211;&#x5C31;&#x5728;&#x672C;&#x5B50;&#x4E0A;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x4EBA;&#x7684;&#x8BB0;&#x5FC6;&#x529B;&#x6709;&#x9650;&#x3002;&#x5FC5;&#x987B;&#x8BB0;&#x4E0B;&#x6765;&#x3002;&#x4F7F;&#x7528;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x5199;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x662F;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E2A;&#x4E71;&#x4F60;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x3002;&#x4E0D;&#x8FC7;&#x6BCF;&#x79CD;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x6C47;&#x7F16;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x662F;&#x5404;&#x6709;&#x7279;&#x8272;&#x7684;&#x3002;&#x6839;&#x636E;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E2A;serve-U,&#x4E00;&#x770B;&#x5C31;&#x662F;&#x7528;borland&#x7684;&#x4E1C;&#x897F;&#x5199;&#x7684;&#xFF0C;&#x4E0D;&#x662F;delphi&#x5C31;&#x662F;c++ builder&#x3002;<br>&#x3000;&#x3000;&#x6B63;&#x5728;&#x8DDF;&#x7740;&#xFF0C;&#x624B;&#x673A;&#x54CD;&#x4E86;&#x3002;&#x4E00;&#x770B;&#xFF0C;&#x662F;&#x6797;&#x8B66;&#x5B98;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x5979;&#x7ED9;&#x6211;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#x4E86;&#xFF1F;<br>&#x3000;&#x3000;&#x63A5;&#x4E86;&#x7535;&#x8BDD;&#xFF0C;&#x679C;&#x7136;&#x662F;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5582;&#xFF0C;&#x90A3;&#x4E2A;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#x4E86;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x591A;&#x4E45;&#x4E86;&#xFF1F;&#x201D;<br>&#x3000;&#x3000; &#x201D;&#x5475;&#x5475;&#xFF0C;&#x5176;&#x5B9E;2&#x5929;&#x591A;&#x65F6;&#x95F4;&#x5C31;&#x51FA;&#x6765;&#x3002;&#x5979;&#x7684;&#x5BC6;&#x7801;&#x5C31;8&#x4F4D;&#x3002;&#x201C;<br>&#x3000;&#x3000; &#x770B;&#x6765;&#x90A3;&#x4E2A;&#x5BB6;&#x4F19;&#x786E;&#x5B9E;&#x6BD4;&#x8F83;&#x91CD;&#x89C6;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5E73;&#x65F6;&#x7684;&#x5BC6;&#x7801;&#x4E0D;&#x8D85;&#x8FC7;6&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x7684;&#x5BC6;&#x7801;&#x5C45;&#x7136;8&#x4F4D;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x4F60;&#x8FD0;&#x6C14;&#x771F;&#x4E0D;&#x9519;&#xFF0C;&#x5E94;&#x8BE5;&#x53BB;&#x4E70;&#x4F53;&#x80B2;&#x5F69;&#x7968;&#x201C;&#x6211;&#x5FC3;&#x60C5;&#x4E5F;&#x597D;&#xFF0C;&#x5F00;&#x5F00;&#x73A9;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x5475;&#x5475;&#xFF0C;&#x5FD9;&#x7740;&#x6574;&#x7406;&#x90A3;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x679C;&#x7136;&#x548C;&#x6211;&#x4EEC;&#x60F3;&#x7684;&#x4E00;&#x6837;&#x3002;&#x73B0;&#x5728;&#x5B8C;&#x4E8B;&#x4E86;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x8BF7;&#x4F60;&#x5403;&#x996D;&#x5427;&#xFF0C;&#x771F;&#x662F;&#x592A;&#x611F;&#x8C22;&#x4F60;&#x4E86;&#x201C;<br>&#x3000;&#x3000;&#x201D;&#x6253;&#x6B7B;&#x6211;&#x4E5F;&#x4E0D;&#x4F1A;&#x5012;&#x4F60;&#x4EEC;&#x90A3;&#x91CC;&#x53BB;&#x5403;&#x996D;&#x4E86;&#x3002;&#x201C;&#x6211;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x5927;&#x7B11;&#x8D77;&#x6765;&#xFF0C;&#x7B11;&#x7684;&#x6211;&#x7684;&#x7535;&#x8BDD;&#x4E71;&#x98A4;&#x3002;&#x6211;&#x8D76;&#x7D27;&#x628A;&#x7535;&#x8BDD;&#x79BB;&#x5F00;&#x8033;&#x6735;&#x4E00;&#x4E9B;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x653E;&#x5FC3;&#x62C9;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x8BF7;&#x4F60;&#x5012;&#x5916;&#x9762;&#x5403;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x8FD8;&#x6709;&#x70B9;&#x4E8B;&#x60C5;&#x7ED9;&#x4F60;&#x8BF4;&#x3002;&#x201D;&#x5979;&#x987F;&#x4E86;&#x987F;&#xFF0C;<br>&#x3000;&#x3000;&#x201C;5&#x70B9;&#x4E0B;&#x73ED;&#xFF0C;&#x6211;&#x6765;&#x63A5;&#x4F60;&#x5982;&#x4F55;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x522B;&#x522B;&#x201D;&#x6211;&#x8D76;&#x7D27;&#x8BF4;&#xFF0C;&#x201C;&#x522B;&#x5F00;&#x4F60;&#x90A3;&#x4E2A;&#x7834;&#x8B66;&#x8F66;&#x6765;&#xFF0C;&#x90A3;&#x4E2A;&#x95E8;&#x536B;&#x73B0;&#x5728;&#x770B;&#x6211;&#x773C;&#x5149;&#x90FD;&#x4E0D;&#x5BF9;&#x4E86;&#x201D;<br>&#x3000;&#x3000;&#x53C8;&#x662F;&#x4E00;&#x9635;&#x7B11;&#x58F0;&#x3002;&#x201C;ok&#xFF0C;ok&#xFF0C;&#x6211;&#x4E0D;&#x5F00;&#x8B66;&#x8F66;&#x6765;&#x5C31;&#x662F;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8BF4;&#x597D;&#x4E86;&#xFF0C;&#x4E0D;&#x89C1;&#x4E0D;&#x6563;&#x201D;&#x8FD8;&#x6CA1;&#x5BB9;&#x6211;&#x63A8;&#x8F9E;&#xFF0C;&#x5979;&#x5C31;&#x628A;&#x7535;&#x8BDD;&#x6302;&#x4E86;&#x3002;<br>&#x653E;&#x4E0B;&#x7535;&#x8BDD;&#xFF0C;&#x7EE7;&#x7EED;&#x8DDF;&#x8E2A;&#x3002;&#x4E0D;&#x4E45;&#x6211;&#x5C31;&#x53D1;&#x73B0;server&#xFF0D;U&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x6F0F;&#x6D1E;&#x3002;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x4F1A;&#x505C;&#x6B62;&#x670D;&#x52A1;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#x3002;&#x73B0;&#x5728;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#x592A;&#x591A;&#x4E86;&#x3002;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;c&#x7528;&#x7684;&#x592A;&#x5E7F;&#x6CDB;&#x4E86;&#x3002;&#x7528;c&#x7684;&#x4EBA;&#x81EA;&#x5DF1;&#x4E0D;&#x7CBE;&#x901A;&#x7684;&#x4EBA;&#x4E5F;&#x592A;&#x591A;&#x4E86;&#x3002;&#x6211;&#x53EA;&#x8981;&#x7ED9;&#x4ED6;&#x53D1;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x683C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;server u&#x5C31;&#x4F1A;&#x6EA2;&#x51FA;&#xFF0C;&#x5C31;&#x4F1A;&#x505C;&#x6B62;&#x670D;&#x52A1;&#x3002;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x6211;&#x8FDB;&#x4E00;&#x6B65;&#x5206;&#x6790;&#x4E0B;&#x53BB;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x80FD;&#x6267;&#x884C;&#x7279;&#x6B8A;&#x7684;&#x6EA2;&#x51FA;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BA9;&#x4ED6;&#x6267;&#x884C;&#x6211;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5012;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x5979;&#x5E2E;&#x6211;&#x6267;&#x884C;&#x6211;&#x7684;&#x6307;&#x4EE4;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5728;&#x672C;&#x5B50;&#x4E0A;&#x8BB0;&#x4E0B;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x683C;&#x5F0F;&#xFF0C;&#x548C;&#x5730;&#x5740;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x597D;&#x597D;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x6EA2;&#x51FA;&#x80FD;&#x5426;&#x4E0D;&#x8BA9;&#x4ED6;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x7ED9;&#x6211;&#x505A;&#x70B9;&#x4E8B;&#x60C5;&#x3002;<br>&#x3000;&#x3000;&#x6B63;&#x5728;&#x60F3;&#x7740;&#x5462;&#xFF0C;&#x5934;&#x513F;&#x53EB;&#x6211;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FDB;&#x5230;&#x5934;&#x513F;&#x529E;&#x516C;&#x5BA4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x603B;&#x90E8;&#x53C8;&#x627E;&#x4F60;&#x5462;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x662F;&#x540D;&#x4EBA;&#x4E86;&#x201D;&#x5934;&#x513F;&#x770B;&#x7740;&#x6211;&#x76F4;&#x4E50;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x54CE;&#x5440;&#xFF0C;&#x53C8;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x5440;,&#x4E0D;&#x53BB;&#x4E0D;&#x884C;&#x5440;&#x201D;&#x6211;&#x5927;&#x4F5C;&#x65E0;&#x8F9C;&#x72B6;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x7684;server-u&#x6B63;&#x5728;&#x7D27;&#x8981;&#x5173;&#x5934;&#x5462;&#xFF01;<br>&#x3000;&#x3000;&#x201C;&#x4E0D;&#x884C;&#xFF0C;&#x4E0D;&#x884C;&#xFF0C;&#x90E8;&#x957F;&#x8FD9;&#x6B21;&#x4E13;&#x95E8;&#x70B9;&#x540D;&#x4E86;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x4E0D;&#x8981;&#xFF0C;&#x5C31;&#x8981;&#x4F60;&#x201D;&#x5934;&#x513F;&#x5F88;&#x9AD8;&#x5174;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x624B;&#x4E0B;&#x80FD;&#x8FD9;&#x4E48;&#x53D7;&#x90E8;&#x957F;&#x7684;&#x8D4F;&#x8BC6;&#xFF0C;&#x4ED6;&#x8138;&#x4E0A;&#x4E5F;&#x6709;&#x5149;&#x3002;<br>&#x3000;&#x3000; &#x201C;&#x54CE;&#xFF0C;&#x70E6;&#xFF0C;&#x90E8;&#x957F;&#x662F;&#x4E0D;&#x662F;&#x6574;&#x5929;&#x6CA1;&#x4E8B;&#x60C5;&#x5750;&#x5440;&#xFF0C;&#x5929;&#x5929;&#x548C;&#x516C;&#x5B89;&#x5C40;&#x6253;&#x4EA4;&#x9053;&#x5012;&#x662F;&#x633A;&#x79EF;&#x6781;&#x7684;&#x201D;&#xFF0C;&#x53CD;&#x6B63;&#x90E8;&#x957F;&#x542C;&#x4E0D;&#x89C1;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x8BF4;&#x4E86;&#x4E5F;&#x4E0D;&#x6015;&#x3002;<br>&#x3000;&#x3000; &#x201C;&#x752D;&#x5E9F;&#x8BDD;&#xFF0C;&#x53EB;&#x4F60;&#x53BB;&#x4F60;&#x5C31;&#x53BB;&#x201D;&#x3002;&#x5934;&#x513F;&#x7B11;&#x7740;&#x8BF4;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x53F9;&#x4E86;&#x53E3;&#x6C14;&#xFF0C;&#x6536;&#x62FE;&#x597D;&#x684C;&#x4E0A;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x3002;&#x8DDF;&#x54E5;&#x4EEC;&#x548C;&#x5A9B;&#x5A9B;&#x8BF4;&#x58F0;&#x3002;&#x201D;&#x54E5;&#x4EEC;&#x8FD9;&#x6B21;&#x53C8;&#x5012;&#x603B;&#x90E8;&#x53BB;&#x4EAB;&#x798F;&#x4E86;&#x201C;&#xFF0C;&#x5728;&#x5927;&#x5BB6;&#x563B;&#x563B;&#x54C8;&#x54C8;&#x4E2D;&#xFF0C;&#x79BB;&#x5F00;&#x4E86;&#x529E;&#x516C;&#x5BA4;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x90A3;&#x4E2A;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x9996;&#x5148;&#x770B;&#x5230;&#x4E86;&#x90E8;&#x957F;&#xFF0C;&#x7279;&#x522B;&#x7559;&#x610F;&#x662F;&#x4E0D;&#x662F;&#x53C8;&#x662F;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x76F4;&#x63A5;&#x5C31;&#x770B;&#x90E8;&#x957F;&#x7684;&#x65C1;&#x8FB9;&#x3002;<br>&#x3000;&#x3000; &#x9760;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x662F;&#x8B66;&#x5BDF;&#xFF0C;&#x8FD9;&#x6B21;&#x662F;&#x4E24;&#x4E2A;&#x519B;&#x4EBA;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x8FD8;&#x6765;&#x4E0D;&#x53CA;&#x601D;&#x8003;&#xFF0C;&#x90E8;&#x957F;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x6211;&#xFF0C;&#x8FD9;&#x6B21;&#x6CA1;&#x6709;&#x80E1;&#x961F;&#x957F;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x7684;&#x4EBA;&#x3002;&#x5C31;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;<br>&#x3000;&#x3000; &#x201D;&#x5C0F;&#x738B;&#xFF0C;&#x6765;&#x6765;&#xFF0C;&#x8FDB;&#x6765;&#xFF0C;&#x5750;&#x5750;&#x201C;&#x90E8;&#x957F;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x6211;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x6001;&#x5EA6;&#x975E;&#x5E38;&#x7684;&#x597D;&#x3002;&#x5176;&#x5B9E;&#x7BA1;&#x8D8A;&#x5927;&#x7684;&#x4EBA;&#x4E00;&#x822C;&#x5BF9;&#x4E0B;&#x5C5E;&#x7684;&#x6001;&#x5EA6;&#x5C31;&#x8D8A;&#x597D;&#x3002;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;&#x53CD;&#x6B63;&#x90E8;&#x957F;&#x5728;&#x6211;&#x5FC3;&#x91CC;&#x5176;&#x5B9E;&#x86EE;&#x548C;&#x853C;&#x7684;&#x3002;<br>&#x3000;&#x3000; &#x201D;&#x8FD9;&#x4E24;&#x4F4D;&#x662F;&#x67D0;&#x67D0;&#x519B;&#x533A;&#x7684;&#x540C;&#x5FD7;&#xFF0C;&#x8FD9;&#x6B21;&#x6765;&#x6709;&#x70B9;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x4F60;&#x53C2;&#x52A0;&#x201C;&#x3002;&#x90E8;&#x957F;&#x5F00;&#x59CB;&#x4ECB;&#x7ECD;&#x3002;&#x201D;&#x8FD9;&#x4F4D;&#x4F7F;&#x6211;&#x4EEC;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x7684;&#x5C0F;&#x738B;&#xFF0C;&#x4E0A;&#x6B21;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x5BC6;&#x7801;&#x5C31;&#x662F;&#x4ED6;&#x5E2E;&#x5FD9;&#x89E3;&#x9664;&#x7684;&#x3002;&#x201C;<br>&#x3000;&#x3000; &#x4E8E;&#x662F;&#x5C31;&#x63E1;&#x624B;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5BB6;&#x4E09;&#x8F88;&#x4EBA;&#x90FD;&#x6CA1;&#x53C8;&#x4E00;&#x4E2A;&#x5F53;&#x5175;&#x548C;&#x5F53;&#x8B66;&#x5BDF;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E9B;&#x7A7F;&#x5236;&#x670D;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x4E86;&#x89E3;&#xFF0C;&#x548C;&#x4ED6;&#x4EEC;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x7684;&#x611F;&#x89C9;&#x3002;<br>&#x3000;&#x3000;&#x3000;&#x6211;&#x6CE8;&#x610F;&#x5012;&#x8FD9;&#x4E24;&#x4F4D;&#x4EBA;&#x9AD8;&#x9A6C;&#x5927;&#x7684;&#x519B;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x5C11;&#x6821;&#x519B;&#x8854;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2D;&#x5C09;&#x519B;&#x8854;&#x3002;&#x7A7F;&#x7684;&#x8863;&#x670D;&#x7B14;&#x633A;&#x7B14;&#x633A;&#x7684;&#x3002;&#x975E;&#x5E38;&#x5A01;&#x6B66;&#x3002;&#x63E1;&#x624B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x660E;&#x663E;&#x611F;&#x89C9;&#x4ED6;&#x4EEC;&#x7684;&#x6709;&#x529B;&#x3002;&#x519B;&#x4EBA;&#x5C31;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x90A3;&#x4E2A;&#x5C11;&#x6821;&#x770B;&#x7740;&#x6211;&#x8BF4;&#x8BDD;&#x4E86;&#xFF1A;&#x201D;&#x6211;&#x4EEC;&#x8FD9;&#x6B21;&#x519B;&#x533A;&#x8981;&#x641E;&#x8054;&#x5408;&#x6F14;&#x4E60;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x641E;&#x8FD9;&#x79CD;&#x6F14;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x529B;&#x91CF;&#x4E0D;&#x591F;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x4E34;&#x65F6;&#x5F81;&#x7528;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x4EBA;&#x5458;&#xFF0C;&#x534F;&#x52A9;&#x6211;&#x4EEC;&#x6F14;&#x4E60;&#x3002;&#x5728;&#x5F81;&#x7528;&#x671F;&#x95F4;&#xFF0C;&#x4F60;&#x7684;&#x6240;&#x6709;&#x539F;&#x5355;&#x4F4D;&#x7684;&#x5F85;&#x9047;&#x4E0D;&#x4FBF;&#xFF0C;&#x540C;&#x65F6;&#x3002;&#x6211;&#x4EEC;&#x519B;&#x961F;&#x4E5F;&#x4F1A;&#x7ED9;&#x4E00;&#x4E9B;&#x8865;&#x52A9;&#xFF0C;&#x8FD9;&#x4E9B;&#x8865;&#x52A9;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4F60;&#x53C2;&#x52A0;&#x3002;&#x4F60;&#x540C;&#x610F;&#x5417;&#xFF1F;&#x201C;<br>&#x3000;&#x3000;&#x519B;&#x4EBA;&#x8BF4;&#x8BDD;&#x5C31;&#x662F;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x4E00;&#x4E0B;&#x5C31;&#x542C;&#x660E;&#x767D;&#x4E86;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x8BF4;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x90E8;&#x957F;&#x8BF4;&#x8BDD;&#x4E86;&#xFF1A;&#x201D;&#x5C0F;&#x738B;&#x5440;&#xFF0C;&#x4F60;&#x4F7F;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x5E2E;&#x90E8;&#x961F;&#x5750;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x653E;&#x5FC3;&#xFF0C;&#x4F60;&#x5728;&#x5355;&#x4F4D;&#x7684;&#x5F85;&#x9047;&#x4E0D;&#x4F1A;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#x3002;&#x201C;<br>&#x3000;&#x3000;&#x6655;&#xFF0C;&#x90E8;&#x957F;&#x90FD;&#x8FD9;&#x4E48;&#x8BF4;&#x4E86;&#xFF0C;&#x6211;&#x4E0D;&#x53BB;&#x8FD8;&#x4E0D;&#x884C;&#x4E86;&#x5440;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x660E;&#x6446;&#x4E86;&#x8981;&#x6211;&#x53BB;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x6211;&#x8BF4;NO&#x7684;&#x8BDD;&#xFF0C;&#x4F30;&#x8BA1;&#x4EE5;&#x540E;&#x522B;&#x60F3;&#x5728;&#x5355;&#x4F4D;&#x4E0A;&#x6DF7;&#x4E86;&#x5F97;&#x7F6A;&#x4E86;&#x90E8;&#x957F;&#x662F;&#x95F9;&#x7740;&#x73A9;&#x513F;&#x7684;&#xFF1F;<br>&#x3000;&#x3000;&#x201D;&#x65F6;&#x95F4;&#x591A;&#x4E45;&#xFF1F;&#x201D;&#x6211;&#x95EE;<br>&#x3000;&#x3000;&#x201D;15&#x5929;&#x5DE6;&#x53F3;&#xFF0C;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x4E00;&#x4E2A;&#x6708;&#x201C;&#x5C11;&#x6821;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x8981;&#x53BB;&#x5F53;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x5175;&#x5440;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x611F;&#x5230;&#x597D;&#x7B11;&#xFF0C;&#x5988;&#x7684;&#xFF0C;&#x600E;&#x4E48;&#x4EC0;&#x4E48;&#x7834;&#x4E8B;&#x60C5;&#x90FD;&#x7ED9;&#x6211;&#x9047;&#x5230;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x662F;&#x505A;&#x68A6;&#x6211;&#x90FD;&#x4E0D;&#x4F1A;&#x68A6;&#x5230;&#x8FD9;&#x4E0A;&#x9762;&#x6765;&#xFF01;<br>&#x3000;&#x3000;&#x5927;&#x5B66;&#x519B;&#x8BAD;&#x7684;&#x65F6;&#x5019;&#x5012;&#x8FC7;&#x519B;&#x961F;&#xFF0C;&#x6211;&#x60F3;&#x8FD9;&#x6B21;&#x641E;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#xFF0C;&#x5E94;&#x8BE5;&#x6CA1;&#x6709;&#x519B;&#x8BAD;&#x90A3;&#x4E48;&#x82E6;&#x5427;&#x3002;&#x518D;&#x8BF4;&#xFF0C;&#x53BB;&#x770B;&#x770B;&#x519B;&#x961F;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x4E5F;&#x4E0D;&#x9519;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x70B9;&#x5934;&#x540C;&#x610F;&#x4E86;&#xFF0C;&#x90E8;&#x957F;&#x548C;&#x5C11;&#x6821;&#x90FD;&#x5F88;&#x9AD8;&#x5174;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x4E0B;&#x5468;&#x661F;&#x671F;&#x4E00;&#x6211;&#x4EEC;&#x6765;&#x63A5;&#x4F60;&#x201C;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x9080;&#x8BF7;&#x6211;&#x5403;&#x996D;&#x3002;&#x6211;&#x8BF4;&#x6211;&#x8FD8;&#x6709;&#x7EA6;&#x4F1A;&#x62D2;&#x7EDD;&#x4E86;&#x3002;&#x90E8;&#x957F;&#x54C8;&#x54C8;&#x7B11;&#x4E86;&#x3002;&#x6CA1;&#x5F3A;&#x8FEB;&#x6211;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x76F4;&#x7EB3;&#x95F7;&#x6211;&#x4EEC;&#x90E8;&#x957F;&#x600E;&#x4E48;&#x4ECA;&#x5929;&#x8B66;&#x5BDF;&#xFF0C;&#x660E;&#x5929;&#x519B;&#x961F;&#x7684;&#x5440;&#x3002;&#x600E;&#x4E48;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x5F88;&#x5C11;&#x627E;&#x4E0A;&#x4EEC;&#x6765;&#xFF1F;<br>&#x3000;&#x3000;&#x540E;&#x6765;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x90E8;&#x957F;&#x662F;&#x519B;&#x961F;&#x8F6C;&#x4E1A;&#x7684;&#x5E72;&#x90E8;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x5708;&#x5B50;&#xFF0C;&#x90E8;&#x957F;&#x6700;&#x719F;&#x6089;&#x7684;&#x5F53;&#x7136;&#x662F;&#x8B66;&#x5BDF;&#x548C;&#x519B;&#x961F;&#x4E86;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x4E0B;&#x73ED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624B;&#x673A;&#x77ED;&#x4FE1;&#x6765;&#x4E86;&#xFF0C;&#x662F;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x3002;&#x5979;&#x5728;&#x6211;&#x4EEC;&#x5927;&#x95E8;&#x53E3;&#x7B49;&#x6211;&#x3002;<br>&#x3000;&#x3000;&#x5230;&#x5927;&#x95E8;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FDC;&#x8FDC;&#x7684;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5973;&#x5B69;&#x5B50;&#x7ED9;&#x6211;&#x6325;&#x624B;&#x3002;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x627E;&#x90A3;&#x4E2A;&#x7A7F;&#x8B66;&#x670D;&#x7684;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x3002;&#x867D;&#x7136;&#x5979;&#x7B54;&#x5E94;&#x4E86;&#x6211;&#x4E0D;&#x7A7F;&#x8B66;&#x670D;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5979;&#x5728;&#x6211;&#x5FC3;&#x4E2D;&#x5C31;&#x662F;&#x7A7F;&#x8B66;&#x670D;&#x7684;&#x6A21;&#x6837;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x6F5C;&#x610F;&#x8BC6;&#x627E;&#x7684;&#x8FD8;&#x662F;&#x90A3;&#x4E2A;&#x7A7F;&#x8B66;&#x670D;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x4E2A;&#x5973;&#x5B69;&#x5B50;&#x62DB;&#x4E86;&#x534A;&#x5929;&#x624B;&#xFF0C;&#x6211;&#x624D;&#x6CE8;&#x610F;&#x5230;&#x5979;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x5979;&#x4ECA;&#x5929;&#x7A7F;&#x4E00;&#x6761;&#x7D2B;&#x8272;&#x4F11;&#x95F2;&#x88E4;&#x5B50;&#xFF0C;&#x7A7F;&#x7684;&#x662F;&#x7684;&#x65F6;&#x9AE6;&#x7684;&#x8FD0;&#x52A8;&#x978B;&#x5B50;&#x3002;&#x4E0A;&#x8FB9;&#x4E00;&#x4EF6;&#x65F6;&#x9AE6;&#x7684;&#x4F11;&#x95F2;&#x8863;&#x670D;&#x3002;&#x57AE;&#x4E2A;&#x5305;&#x5305;&#xFF0C;&#x5305;&#x5305;&#x4E0A;&#x9762;&#x5C45;&#x7136;&#x6709;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x5C0F;&#x5C0F;&#x7684;&#x4F01;&#x9E45;&#xFF0C;&#x50CF;&#x662F;QQ&#x53C8;&#x50CF;&#x662F;Linux&#x7684;&#x6807;&#x5FD7;&#x7684;&#x90A3;&#x79CD;&#x3002;<br>&#x3000;&#x3000;&#x5B8C;&#x5168;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9752;&#x6625;&#x5E74;&#x5C11;&#x7684;&#x5C0F;&#x5973;&#x751F;&#x561B;&#xFF0C;&#x54EA;&#x91CC;&#x8FD8;&#x6709;&#x4E1D;&#x6BEB;&#x7684;&#x8B66;&#x5B98;&#x6A21;&#x6837;&#x4E86;&#xFF1F;<br>&#x3000;&#x3000;&#x201C;&#x54C7;&#xFF0C;&#x4ECA;&#x5929;&#x4F60;&#x5927;&#x53D8;&#x6837;&#x4E86;&#xFF0C;&#x5DEE;&#x70B9;&#x6CA1;&#x8BA4;&#x51FA;&#x6765;&#x201D;&#x6211;&#x8D70;&#x8FC7;&#x53BB;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#x3002;&#x8B66;&#x5BDF;&#x4E5F;&#x662F;&#x666E;&#x901A;&#x4EBA;&#x201D;&#x5979;&#x6709;&#x70B9;&#x4E0D;&#x8981;&#x610F;&#x601D;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x60F3;&#x597D;&#x6CA1;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x8BF7;&#x5BA2;&#xFF0C;&#x4F60;&#x5E2E;&#x4E86;&#x6211;&#x4EEC;&#x5927;&#x5FD9;&#x4E86;&#x201D;&#x5979;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x968F;&#x4FBF;&#x62C9;&#xFF0C;&#x4F60;&#x5B9A;&#x5427;&#xFF0C;&#x65E0;&#x6240;&#x8C13;&#x4E86;&#x201D; &#x771F;&#x7684;&#x5979;&#x8BF7;&#x5BA2;&#x4E86;&#xFF0C;&#x6211;&#x53CD;&#x800C;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x8D77;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x201C;ok&#xFF0C;&#x90A3;&#x5C31;&#x8D70;&#x5427;&#x201D;&#x3002;</p>
<p>&#x8BA1;&#x7A0B;&#x8F66;&#x5F00;&#x5230;&#x4E86;&#x4E00;&#x5BB6;&#x97E9;&#x56FD;&#x9910;&#x9986;&#x3002;&#x540D;&#x5B57;&#x53EB;&#x97E9;&#x5473;&#x8F69;&#xFF0C;&#x5730;&#x65B9;&#x4E0D;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x4EBA;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x5E03;&#x7F6E;&#x4E5F;&#x5F88;&#x96C5;&#x81F4;&#x3002;<br>&#x3000;&#x5979;&#x70B9;&#x4E86;&#x4E2A;&#x70E4;&#x725B;&#x8089;&#xFF0C;&#x8FD8;&#x6709;&#x4E2A;&#x6253;&#x9171;&#x6C64;&#xFF0C;&#x8FD8;&#x6709;&#x4E71;&#x8D77;&#x516B;&#x906D;&#x7684;&#x597D;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x53C8;&#x53EB;&#x6211;&#x70B9;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x4EE5;&#x524D;&#x6CA1;&#x5403;&#x8FC7;&#x97E9;&#x56FD;&#x83DC;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x53EB;&#x5979;&#x70B9;&#xFF0C;&#x5979;&#x6CA1;&#x6709;&#x63A8;&#x8F9E;&#xFF0C;&#x53C8;&#x52A0;&#x4E86;&#x51E0;&#x4E2A;&#x83DC;&#x3002;<br>&#x3000;&#x97E9;&#x56FD;&#x83DC;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4E0D;&#x5408;&#x6211;&#x7684;&#x53E3;&#x5473;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E0D;&#x662F;&#x91CD;&#x70B9;&#x3002;<br>&#x3000;&#x91CD;&#x70B9;&#x662F;&#xFF0C;&#x5979;&#x4E0D;&#x505C;&#x7684;&#x7B11;&#x6211;&#x3002;&#x6211;&#x6BD4;&#x8F83;&#x7B28;&#xFF0C;&#x7528;&#x4E2D;&#x56FD;&#x90A3;&#x4E00;&#x5957;&#x6765;&#x5BF9;&#x5F85;&#x97E9;&#x56FD;&#x83DC;&#xFF0C;&#x6BD4;&#x5982;&#x5979;&#x70B9;&#x7684;&#x90A3;&#x4E2A;&#x4EC0;&#x4E48;&#x6C64;&#xFF0C;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x50CF;&#x548C;&#x5C1A;&#x5316;&#x7F18;&#x7684;&#x6728;&#x5934;&#x7897;&#x7897;&#x91CC;&#x9762;&#xFF0C;&#x6211;&#x4E00;&#x53E3;&#x5C31;&#x559D;&#x6389;&#x4E86;&#x3002;&#x5B8C;&#x4E8B;&#x8FD8;&#x8BF4;&#x5473;&#x9053;&#x4E0D;&#x884C;&#x3002;<br>&#x3000;&#x6211;&#x6CA1;&#x6709;&#x7ED9;&#x4ED6;&#x8BF4;&#x6F14;&#x4E60;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x5C11;&#x6821;&#x8BF4;&#x4E0D;&#x8981;&#x7ED9;&#x522B;&#x4EBA;&#x8BF4;&#x3002;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x73B0;&#x5728;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x8FD8;&#x7B97;&#x662F;&#x522B;&#x4EBA;&#x7684;&#x8303;&#x7574;&#x3002;<br>&#x3000;&#x201C;&#x6211;&#x53D1;&#x89C9;&#x4F60;&#x5BF9;&#x89E3;&#x5BC6;&#x52A0;&#x5BC6;&#x597D;&#x50CF;&#x6BD4;&#x8F83;&#x6709;&#x7814;&#x7A76;&#x5440;&#x201D;&#x5979;&#x8BF4;&#x3002;<br>&#x3000;&#x201C;&#x54EA;&#x91CC;&#xFF0C;&#x54EA;&#x91CC;&#x201D;<br>&#x3000;&#x201C;&#x4EE5;&#x540E;&#x8FD8;&#x9700;&#x8981;&#x591A;&#x591A;&#x6307;&#x6559;&#x5440;&#x201D;<br>&#x3000;&#x201C;&#x4F60;&#x4EEC;&#x516C;&#x5B89;&#x5C40;&#x80FD;&#x4EBA;&#x4E5F;&#x4E0D;&#x5C11;&#x201D;<br>&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4ED6;&#x4EEC;&#x867D;&#x7136;&#x6587;&#x51ED;&#x90FD;&#x4E0D;&#x4F4E;&#xFF0C;&#x800C;&#x4E14;&#x540D;&#x724C;&#x5927;&#x5B66;&#x7684;&#x4E5F;&#x4E0D;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x65B9;&#x9762;&#x8FD8;&#x771F;&#x4E0D;&#x5982;&#x4F60;&#x3002;&quot;<br>&#x3000;&#x3000;&#x6211;&#x60F3;&#x5979;&#x8BF4;&#x7684;&#x662F;&#x5B9E;&#x8BDD;&#x3002;&#x9ED1;&#x5BA2;&#x7684;&#x77E5;&#x8BC6;&#x867D;&#x7136;&#x7528;&#x7684;&#x90FD;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x65B9;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x8BA1;&#x7B97;&#x673A;&#x5B66;&#x7684;&#x597D;&#x7684;&#x4EBA;&#x90FD;&#x80FD;&#x505A;&#x9ED1;&#x5BA2;&#x7684;&#x3002;&#x6211;&#x4EE5;&#x524D;&#x7684;&#x540C;&#x5B66;&#xFF0C;&#x6210;&#x7EE9;&#x6BD4;&#x6211;&#x597D;&#x7684;&#x591A;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x5728;&#x5206;&#x6790;&#x7A0B;&#x5E8F;&#xFF0C;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#x6BD4;&#x6211;&#x5DEE;&#x591A;&#x4E86;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x5929;&#x751F;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6BD4;&#x8F83;&#x654F;&#x611F;&#x3002;&#x6211;&#x5C31;&#x662F;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x5929;&#x751F;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x60F3;&#x6211;&#x8FD9;&#x6837;&#x5927;&#x5B66;&#x529F;&#x8BFE;&#x95E8;&#x95E8;&#x90FD;&#x4F18;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x4E14;&#x559C;&#x6B22;&#x9ED1;&#x5BA2;&#x6280;&#x672F;&#x7684;&#x4EBA;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8BA4;&#x8BC6;&#x7684;&#x4E00;&#x4E2A;&#x56FD;&#x5185;&#x975E;&#x5E38;&#x6709;&#x540D;&#x7684;&#x9ED1;&#x5BA2;&#x8F6F;&#x4EF6;&#x7684;&#x7F16;&#x5199;&#x4EBA;&#xFF0C;&#x4ED6;&#x5728;&#x5927;&#x5B66;&#x91CC;&#x9762;&#x5F88;&#x591A;&#x57FA;&#x7840;&#x8BFE;&#x7A0B;&#x90FD;&#x8865;&#x8003;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x201D;&#x4F60;&#x662F;&#x54EA;&#x91CC;&#x6BD5;&#x4E1A;&#x7684;&#x5440;&#x201C;&#x6211;&#x95EE;&#x3002;<br>&#x3000;&#x3000;&#x5979;&#x72B9;&#x8C6B;&#x4E00;&#x4E0B;&#xFF0C;&#x8BF4;&#x51FA;&#x4E00;&#x4E2A;&#x5927;&#x5B66;&#x7684;&#x540D;&#x5B57;&#x3002;&#x4E56;&#x4E56;&#xFF0C;&#x4E5F;&#x662F;&#x56FD;&#x5185;&#x4E00;&#x6D41;&#x7684;&#x540D;&#x724C;&#x7684;&#x5927;&#x5B66;&#x5440;&#x3002;<br>&#x3000;&#x201C;&#x6574;&#x5929;&#x6211;&#x4EEC;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x6280;&#x672F;&#x542B;&#x91CF;&#x90FD;&#x4E0D;&#x9AD8;&#xFF0C;&#x50CF;&#x53BB;&#x68C0;&#x67E5;&#x68C0;&#x67E5;&#x7F51;&#x5427;&#x7684;&#x60C5;&#x51B5;&#x5440;&#x3002;&#x8D1F;&#x8D23;&#x672C;&#x7CFB;&#x7EDF;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7EF4;&#x62A4;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x4E8B;&#x60C5;&#x4E0D;&#x591A;&#x3002;&#x50CF;&#x8FD9;&#x6B21;&#x8FD9;&#x4E48;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6211;&#x53C8;&#x4E0D;&#x884C;&#x3002;&#x201D;&#x5979;&#x8138;&#x4E0A;&#x6709;&#x70B9;&#x9EEF;&#x7136;&#x3002;<br>&#x3000;&#x201C;&#x6211;&#x7684;&#x68A6;&#x60F3;&#x662F;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x5973;&#x9ED1;&#x5BA2;&#x201D;&#x5979;&#x7A81;&#x7136;&#x8BF4;&#x3002;<br>&#x3000;&#x6211;&#x534A;&#x5929;&#x6CA1;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#xFF0C;&#x6211;&#x771F;&#x4E0D;&#x60F3;&#x4FE1;&#x5979;&#x8BF4;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x6765;&#x3002;&#x4E0D;&#x662F;&#x8FD9;&#x53E5;&#x8BDD;&#x4E0D;&#x5BF9;&#xFF0C;&#x800C;&#x662F;&#x5979;&#x5728;&#x6211;&#x5FC3;&#x4E2D;&#x7684;&#x5370;&#x8C61;&#x662F;&#x6BD4;&#x8F83;&#x4E25;&#x8083;&#x7684;&#x3002;<br>&#x3000;&#x201D;&#x5475;&#x5475;&#x201C; &#x6211;&#x7B11;&#x8D77;&#x6765;&#x3002;<br>&#x3000;&#x201D;&#x4F60;&#x7B11;&#x4EC0;&#x4E48;&#x201C;&#xFF0C;&#x5979;&#x597D;&#x50CF;&#x53CD;&#x5E94;&#x8FC7;&#x6765;&#xFF0C;&#x81EA;&#x5DF1;&#x8BF4;&#x7684;&#x592A;&#x591A;&#x3002;&#x63A5;&#x7740;&#x81EA;&#x5DF1;&#x4E5F;&#x7B11;&#x8D77;&#x6765;&#x3002;<br>&#x3000;&#x201D;&#x6211;&#x5728;&#x5199;&#x4E00;&#x4E2A;windows&#x7684;&#x6F0F;&#x6D1E;&#x63A2;&#x6D4B;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x53D1;&#x5230;&#x4F60;&#x4FE1;&#x7BB1;&#x4E2D;&#x4E86;&#x3002;&#x201C;&#x4F60;&#x5230;&#x65F6;&#x5019;&#x770B;&#x770B;&#xFF0C;&#x591A;&#x63D0;&#x63D0;&#x610F;&#x89C1;&#x3002;&#x201D;</p>
<p>&#x5F53;&#x5929;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x5728;&#x4FE1;&#x7BB1;&#x4E2D;&#x770B;&#x5230;&#x4E86;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x7684;windows2000&#x6F0F;&#x6D1E;&#x63A2;&#x6D4B;&#x7A0B;&#x5E8F;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#x7528;&#x7684;&#x90FD;&#x662F;&#x7F51;&#x4E0A;&#x5927;&#x5BB6;&#x77E5;&#x9053;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E0D;&#x8FC7;&#x5BF9;windows&#x7684;&#x4E00;&#x822C;&#x9632;&#x62A4;&#x548C;&#x68C0;&#x6D4B;&#x8FD8;&#x662F;&#x662F;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;vc++&#x5199;&#x7684;&#xFF0C;&#x754C;&#x9762;&#x7B80;&#x5355;&#x5B9E;&#x7528;&#x3002;&#x4E0D;&#x9519;&#x3002;&#x4E0D;&#x8FC7;&#x5BF9;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#xFF0C;&#x7528;&#x5904;&#x4E0D;&#x5927;&#x3002;&#x5C0F;&#x6797;&#x73B0;&#x5728;&#x662F;&#x5C5E;&#x4E8E;&#x7F51;&#x4E0A;&#x6D41;&#x884C;&#x7684;&#x9ED1;&#x5BA2;&#x7C7B;&#x578B;&#x3002;&#x662F;&#x5229;&#x7528;&#x6F0F;&#x6D1E;&#x578B;&#x7684;&#x3002;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x5206;&#x6790;&#x7A0B;&#x5E8F;&#x7684;&#x80FD;&#x529B;&#x4E00;&#x822C;&#x4E0D;&#x662F;&#x5F88;&#x5F3A;&#x3002;&#x3000;<br>&#x3000;&#x3000;&#x4E00;&#x4E2A;&#x5973;&#x5B69;&#x5B50;&#x80FD;&#x6709;&#x8FD9;&#x4E2A;&#x6C34;&#x5E73;&#xFF0C;&#x8BF4;&#x5B9E;&#x5728;&#x7684;&#xFF0C;&#x8FD8;&#x771F;&#x7684;&#x8BA9;&#x6211;&#x610F;&#x5916;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#xFF0C;&#x6211;&#x8FD8;&#x5728;&#x7761;&#x61D2;&#x89C9;&#x7684;&#x65F6;&#x5019;&#x3002;&#x5C0F;&#x654F;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x53EB;&#x6211;&#x201C;&#x61D2;&#x732A;&#xFF0C;&#x5F00;&#x95E8;&#x201D;&#x3002;&#x6628;&#x5929;&#x665A;&#x4E0A;&#x5206;&#x6790;&#x90A3;&#x4E2A;server-u&#x5206;&#x6790;&#x7684;&#x592A;&#x665A;&#xFF0C;&#x8BA9;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x6EA2;&#x51FA;&#xFF0C;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;&#x4F46;&#x662F;&#x8BA9;&#x5979;&#x6EA2;&#x51FA;&#x540E;&#x6267;&#x884C;&#x6211;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x662F;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x641E;&#x4E86;&#x5230;4&#x70B9;&#x949F;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x8FDB;&#x5C55;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x770B;9&#x70B9;&#x591A;&#x4E86;&#x3002;&#x8D76;&#x7D27;&#x5F00;&#x95E8;&#x3002;&#x5C0F;&#x654F;&#x592A;&#x4E86;&#x89E3;&#x6211;&#x4E86;&#xFF0C;&#x7ED9;&#x6211;&#x5E26;&#x65E9;&#x9910;&#x4E86;&#x3002;&#x4E00;&#x5305;&#x5C0F;&#x7B3C;&#x5305;&#x5B50;&#xFF0C;&#x4E00;&#x5305;&#x9505;&#x8D34;&#x997A;&#x5B50;&#xFF0C;&#x5168;&#x662F;&#x6211;&#x559C;&#x6B22;&#x5403;&#x7684;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x5F88;&#x5FEB;&#x5C31;&#x5E72;&#x6389;&#x4E86;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6211;&#x5FC3;&#x6EE1;&#x610F;&#x8DB3;&#x7684;&#x5750;&#x5728;&#x6C99;&#x53D1;&#x4E0A;&#xFF0C;&#x5C0F;&#x654F;&#x770B;&#x7740;&#x6211;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5C0F;&#x654F;&#xFF0C;&#x6211;&#x7ED9;&#x4F60;&#x8BF4;&#x4EF6;&#x4E8B;&#x60C5;&#x201D;&#x6211;&#x61D2;&#x61D2;&#x7684;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4EC0;&#x4E48;&#x201D;&#x5C0F;&#x654F;&#x4ECA;&#x5929;&#x4E0D;&#x7231;&#x7B11;&#xFF0C;&#x597D;&#x50CF;&#x6709;&#x4EC0;&#x4E48;&#x5FC3;&#x4E8B;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x4E0B;&#x5468;&#x5F00;&#x59CB;&#x8981;&#x5230;&#x90E8;&#x961F;&#x4E0A;&#x53BB;&#x5F53;&#x51E0;&#x5468;&#x7684;&#x5175;&#x3002;&#x5475;&#x5475;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x554A;&#xFF1F;&#x201D;&#x5979;&#x6CA1;&#x660E;&#x767D;&#x8FC7;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8BE6;&#x7EC6;&#x7ED9;&#x4ED6;&#x89E3;&#x91CA;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x51E0;&#x5468;&#x4E0D;&#x80FD;&#x89C1;&#x9762;&#x4E86;&#x3002;&#x201D;&#x5979;&#x6709;&#x4E9B;&#x5931;&#x843D;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x51E0;&#x5468;&#x5C31;&#x56DE;&#x6765;&#x4E86;&#x201D;</p>
<p>&quot;&#x4ECA;&#x5929;&#x6211;&#x5988;&#x5988;&#x95EE;&#x6211;&#x6709;&#x6CA1;&#x6709;&#x7537;&#x670B;&#x53CB;&#xFF1F;&#x4F60;&#x8BF4;&#x6211;&#x600E;&#x4E48;&#x8BF4;&#x201C;&#xFF0C;&#x5979;&#x7A81;&#x7136;&#x95EE;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x6211;&#x4E0D;&#x662F;&#x4F60;&#x7537;&#x670B;&#x53CB;&#x5417;&#xFF1F;&#x201C;&#x6211;&#x7B11;&#x7740;&#x770B;&#x4ED6;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x53EF;&#x662F;&#xFF0C;&#x4F60;&#x4ECE;&#x6765;&#x5C31;&#x6CA1;&#x8868;&#x793A;&#x8FC7;&#x201C;<br>&#x3000;&#x3000;&#x201D;&#x597D;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5C31;&#x8868;&#x793A;&#xFF0C;&#x5C0F;&#x654F;&#xFF0C;&#x989D;&#x7231;&#x4F60;&#x201C;&#x6211;&#x6545;&#x610F;&#x88C5;&#x51FA;&#x300A;&#x6709;&#x8BDD;&#x597D;&#x597D;&#x8BF4;&#x300B;&#x91CC;&#x9762;&#x7684;&#x8BED;&#x6C14;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x654F;&#x5FCD;&#x4FCA;&#x4E0D;&#x4F4F;&#xFF0C;&#x7B11;&#x9053;&#xFF1A;&#x201C;&#x6CA1;&#x6B63;&#x7ECF;&#xFF0C;&#x6211;&#x7ED9;&#x4F60;&#x8BF4;&#x771F;&#x7684;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6C89;&#x9ED8;&#x4E86;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x4E00;&#x65E0;&#x6240;&#x6709;&#xFF0C;&#x9664;&#x4E86;&#x611F;&#x60C5;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x65E0;&#x6CD5;&#x4F5C;&#x51FA;&#x4EFB;&#x4F55;&#x627F;&#x8BFA;&#x3002;&#x5728;&#x7E41;&#x534E;&#x7684;&#x5927;&#x90FD;&#x5E02;&#xFF0C;&#x4F60;&#x4E0D;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5C0F;&#x654F;&#x201D;&#x6211;&#x770B;&#x7740;&#x5979;&#x7684;&#x773C;&#x775B;&#xFF0C;&#x8BA4;&#x771F;&#x7684;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x771F;&#x7684;&#x559C;&#x6B22;&#x4F60;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x914D;&#x4E0D;&#x4E0A;&#x4F60;&#x3002;&#x4F60;&#x770B;&#x6211;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x65E0;&#x6CD5;&#x7ED9;&#x4F60;&#x8BA9;&#x522B;&#x4EBA;&#x7FA1;&#x6155;&#x7684;&#x751F;&#x6D3B;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4F1A;&#x52AA;&#x529B;&#x7684;&#x3002;&#x6211;&#x4E3A;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x5C06;&#x6765;&#xFF0C;&#x6211;&#x4F1A;&#x52AA;&#x529B;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000; &#x5C0F;&#x654F;&#x5230;&#x5728;&#x6211;&#x7684;&#x6000;&#x91CC;&#xFF0C;&#x5728;&#x6211;&#x8033;&#x8FB9;&#x8BF4;&#xFF1A;&#x201C;&#x53EA;&#x8981;&#x4F60;&#x6709;&#x8FD9;&#x53E5;&#x8BDD;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x6211;&#x4E0D;&#x9700;&#x8981;&#x8BA9;&#x4EBA;&#x7FA1;&#x6155;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x548C;&#x4F60;&#x5728;&#x4E00;&#x8D77;&#x5FEB;&#x4E50;&#x5C31;&#x597D;&#x3002;&#x201D;<br>&#x3000;&#x3000; &#x5979;&#x7684;&#x5934;&#x53D1;&#x629A;&#x6478;&#x7740;&#x6211;&#x7684;&#x8138;&#x988A;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x6B64;&#x7684;&#x5FC3;&#x6EE1;&#x610F;&#x8DB3;&#x3002;</p>
<p>&#x6211;&#x62FF;&#x8D77;&#x5409;&#x4ED6;&#xFF0C;&#x5C0F;&#x654F;&#x9760;&#x7740;&#x6211;&#xFF0C;&#x6211;&#x5531;&#x8D77;&#x6765;&#x90A3;&#x9996;&#x6C34;&#x6728;&#x5E74;&#x534E;&#x7684;&#x300A;&#x4E00;&#x751F;&#x6709;&#x4F60;&#x300B;&#xFF0C;&#x6211;&#x7528;&#x5FC3;&#x5531;&#xFF0C;&#x5C0F;&#x654F;&#x9676;&#x9189;&#x7684;&#x9760;&#x7740;&#x6211;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6211;&#x62E5;&#x6709;&#x4E86;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x68A6;&#x89C1;&#x4F60;&#x79BB;&#x5F00;&#xFF0C;&#x6211;&#x4ECE;&#x54ED;&#x6CE3;&#x4E2D;&#x9192;&#x6765;&#xFF0C;&#x770B;&#x591C;&#x98CE;&#x5439;&#x8FC7;&#x7A97;&#x53F0;&#xFF0C;&#x4F60;&#x80FD;&#x5426;&#x611F;&#x53D7;&#x6211;&#x7684;&#x7231;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5468;&#x672B;&#x548C;&#x5C0F;&#x654F;&#x4E00;&#x8D77;&#x5EA6;&#x8FC7;&#xFF0C;&#x7A0B;&#x5E8F;&#xFF0C;&#x6F0F;&#x6D1E;&#x8FD9;&#x4E9B;&#x6211;&#x6682;&#x65F6;&#x7684;&#x5FD8;&#x5374;&#x4E86;&#x3002;</p>
<p>&#x661F;&#x671F;&#x4E00;&#x624D;&#x5230;&#x5355;&#x4F4D;&#xFF0C;&#x5C31;&#x88AB;&#x544A;&#x77E5;&#x5230;&#x5927;&#x95E8;&#x53E3;&#x53BB;&#x3002;&#x5934;&#x513F;&#x4E5F;&#x65E9;&#x63A5;&#x5230;&#x4E86;&#x603B;&#x90E8;&#x7684;&#x901A;&#x77E5;&#xFF0C;&#x653E;&#x6211;&#x5047;&#x3002;&#x5934;&#x513F;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x8FD9;&#x662F;&#x4FDD;&#x5BC6;&#x7684;&#x3002;&#x6211;&#x4E5F;&#x77E5;&#x9053;&#x548C;&#x5E73;&#x5E74;&#x4EE3;&#xFF0C;&#x641E;&#x4E2A;&#x6F14;&#x4E60;&#xFF0C;&#x5176;&#x5B9E;&#x8BF4;&#x8BF4;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x5927;&#x4E0D;&#x4E86;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x90E8;&#x957F;&#x6253;&#x4E86;&#x62DB;&#x547C;&#xFF0C;&#x4E0D;&#x53EF;&#x62DB;&#x6447;&#xFF0C;&#x4E5F;&#x4E0D;&#x6562;&#x4E0D;&#x542C;&#x3002;&#x5FC3;&#x60F3;&#xFF0C;&#x56DE;&#x6765;&#x518D;&#x7ED9;&#x5934;&#x513F;&#x89E3;&#x91CA;&#x5427;&#x3002;&#x8FDE;&#x7ED9;&#x529E;&#x516C;&#x5BA4;&#x7684;&#x54E5;&#x4EEC;&#x62DB;&#x547C;&#x90FD;&#x6CA1;&#x6253;&#xFF0C;&#x5C31;&#x51FA;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000; &#x5927;&#x95E8;&#x53E3;&#x4E00;&#x8F86;&#x519B;&#x8F66;&#x724C;&#x7167;&#x7684;&#x8D8A;&#x91CE;&#x5409;&#x666E;&#xFF0C;&#x8FD8;&#x6709;&#x90A3;&#x5929;&#x90A3;&#x4E2A;&#x4E2D;&#x5C09;&#x3002;</p>
<p>&#x70ED;&#x60C5;&#x7684;&#x62DB;&#x547C;&#x6211;&#x4E0A;&#x8F66;&#xFF0C;&#x8F66;&#x5B50;&#x5C31;&#x5F80;&#x519B;&#x533A;&#x5F00;&#x53BB;&#x3002;<br>&#x3000;&#x3000; &#x8FDB;&#x5165;&#x519B;&#x533A;&#x7684;&#x5927;&#x95E8;&#xFF0C;&#x5916;&#x9762;&#x770B;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x7684;&#x5F02;&#x6837;&#x3002;&#x4F46;&#x662F;&#x8FDB;&#x5165;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x611F;&#x89C9;&#x975E;&#x5E38;&#x7684;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x7EFF;&#x8272;&#x7684;&#x519B;&#x7528;&#x5361;&#x8F66;&#x5230;&#x5904;&#x90FD;&#x662F;&#xFF0C;&#x7E41;&#x5FD9;&#x7684;&#x58EB;&#x5175;&#x5217;&#x961F;&#x8DD1;&#x6765;&#x8DD1;&#x53BB;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x519B;&#x8F66;&#x5728;&#x88C5;&#x8FD0;&#x7269;&#x8D44;&#x3002;<br>&#x867D;&#x7136;&#x6211;&#x5BF9;&#x519B;&#x961F;&#x4E0D;&#x4E86;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x50BB;&#x5B50;&#x4E5F;&#x80FD;&#x611F;&#x89C9;&#x5230;&#x7D27;&#x5F20;&#x7E41;&#x5FD9;&#x7684;&#x6C14;&#x6C1B;&#x3002;&#x771F;&#x662F;&#x4E00;&#x7247;&#x6218;&#x4E89;&#x7684;&#x611F;&#x89C9;&#x5440;&#x3002;<br>&#x3000;&#x3000; &quot;&#x4ED6;&#x4EEC;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#x5440;&#x201C;&#x6211;&#x6307;&#x7740;&#x8DEF;&#x8FB9;&#x7684;&#x4E00;&#x8F86;&#x5361;&#x8F66;&#xFF0C;&#x4E0A;&#x9762;&#x5168;&#x90E8;&#x90FD;&#x662F;&#x5168;&#x526F;&#x6B66;&#x88C5;&#x7684;&#x58EB;&#x5175;&#xFF0C;&#x95EE;&#x5F00;&#x8F66;&#x7684;&#x4E2D;&#x5C09;&#x3002;<br>&#x3000;&#x3000; &#x201D;&#x6F14;&#x4E60;&#x9A6C;&#x4E0A;&#x8981;&#x5F00;&#x59CB;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x51C6;&#x5907;&#x8981;&#x5F00;&#x62D4;&#x4E86;&#x201C; &#x4E2D;&#x5C09;&#x8F7B;&#x63CF;&#x6DE1;&#x5199;&#x7684;&#x8BF4;&#x3002;</p>
<p>&#x5230;&#x4E86;&#x90E8;&#x961F;&#x7684;&#x62DB;&#x5F85;&#x6240;&#xFF0C;&#x6709;&#x4E13;&#x95E8;&#x7684;&#x4EBA;&#x63A5;&#x5F85;&#x6211;&#x4EEC;&#x3002;&#x7136;&#x540E;&#x7ED9;&#x6211;&#x4EEC;&#x53D1;&#x4E86;&#x505A;&#x8BAD;&#x7684;&#x519B;&#x670D;&#x3002;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x7528;&#x54C1;&#x3002;&#x6211;&#x4E5F;&#x662F;&#x519B;&#x8BAD;&#x8FC7;&#x7684;&#x4EBA;&#xFF0C;&#x4E00;&#x770B;&#x5C31;&#x662F;&#x628A;&#x6211;&#x4EEC;&#x5F53;&#x519B;&#x4EBA;&#x5BF9;&#x5F85;&#x4E86;&#x3002;<br>&#x3000;&#x3000; &#x5230;&#x5916;&#x5355;&#x4F4D;&#x5F81;&#x7528;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x53EA;&#x6211;&#x4E00;&#x4E2A;&#x3002;&#x53CD;&#x6B63;&#x5F53;&#x65F6;&#x548C;&#x6211;&#x540C;&#x623F;&#x95F4;&#x7684;&#x662F;&#x4E00;&#x4E2A;30&#x5C81;&#x4E0A;&#x4E0B;&#x7684;&#x4EBA;&#xFF0C;&#x80D6;&#x80D6;&#x7684;&#xFF0C;&#x77EE;&#x77EE;&#x7684;&#xFF0C;&#x6234;&#x4E2A;&#x773C;&#x955C;&#xFF0C;&#x8BDD;&#x4E0D;&#x591A;&#x3002;&#x5BF9;&#x4EBA;&#x975E;&#x5E38;&#x548C;&#x853C;&#x3002;&#x540D;&#x5B57;&#x53EB;&#x5F20;&#x6811;&#x6797;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x4EB2;&#x70ED;&#x7684;&#x53EB;&#x4ED6;&#x8001;&#x5F20;&#x3002;<br>&#x3000;&#x3000; &#x8001;&#x5F20;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x75C5;&#x6BD2;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#xFF0C;&#x4E13;&#x95E8;&#x641E;&#x75C5;&#x6BD2;&#x5206;&#x6790;&#x7684;&#x3002;<br>&#x3000;&#x3000; &#x9694;&#x58C1;&#x623F;&#x95F4;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x4E00;&#x4E2A;&#x5E74;&#x9752;&#x5C0F;&#x4F19;&#x5B50;&#xFF0C;&#x542C;&#x8BF4;&#x8FD8;&#x662F;&#x56FD;&#x5185;&#x67D0;&#x8457;&#x540D;&#x9ED1;&#x5BA2;&#x7EC4;&#x7EC7;&#x67D0;&#x67D0;&#x8054;&#x76DF;&#x7684;&#x9AA8;&#x5E72;&#x5206;&#x5B50;&#xFF0C;&#x4ED6;&#x662F;&#x6765;&#x81EA;&#x4E00;&#x6240;&#x8457;&#x540D;&#x9AD8;&#x6821;&#x7684;&#x6559;&#x5E08;&#x3002;&#x6211;&#x4EEC;&#x53EB;&#x4ED6;&#x5C0F;&#x4F59;&#x3002;<br>&#x3000;&#x3000; &#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E5F;&#x662F;&#x5E74;&#x9752;&#x4EBA;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6BD4;&#x8F83;&#x51FA;&#x540D;&#x7684;&#x7F51;&#x7AD9;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x3002;&#x6211;&#x4EEC;&#x53EB;&#x4ED6;&#x5C0F;&#x8D75;&#x3002;<br>&#x3000;&#x3000; &#x5C31;&#x6211;&#x4EEC;&#x56DB;&#x4E2A;&#x4EBA;&#xFF0C;&#x5168;&#x662F;&#x7537;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x90FD;&#x662F;&#x5E74;&#x9752;&#x4EBA;&#xFF0C;&#x8001;&#x5F20;&#x5176;&#x5B9E;&#x4E5F;&#x7B97;&#x5E74;&#x9752;&#x4EBA;&#x3002;&#x9ED1;&#x5BA2;&#x597D;&#x50CF;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x5E74;&#x9752;&#x4EBA;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x3002;&#x5230;&#x5E95;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x53CD;&#x6B63;&#x4E8B;&#x5B9E;&#x5C31;&#x662F;&#x5982;&#x6B64;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x548C;&#x8001;&#x5F20;&#x5728;&#x623F;&#x95F4;&#x91CC;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6CA1;&#x6709;&#x8C08;&#x8BBA;&#x6280;&#x672F;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x8BF4;&#xFF0C;&#x4ED6;&#x597D;&#x50CF;&#x4E5F;&#x4E0D;&#x559C;&#x6B22;&#x8BF4;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4ED6;&#x771F;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5C11;&#x8BDD;&#x7684;&#x4EBA;&#x3002;<br>&#x3000;&#x3000; &#x9694;&#x58C1;&#x623F;&#x95F4;&#x90A3;&#x4E24;&#x4E2A;&#x4EBA;&#x8BDD;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x6BD5;&#x7ADF;&#x5E74;&#x9752;&#x4EBA;&#x561B;&#xFF0C;&#x548C;&#x4ED6;&#x4EEC;&#x5728;&#x4E00;&#x8D77;&#x603B;&#x662F;&#x542C;&#x5230;&#x5C0F;&#x4F59;&#x548C;&#x5C0F;&#x8D75;&#x5728;&#x8BF4;&#x4E00;&#x4E9B;&#x9ED1;&#x5BA2;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6BD4;&#x5982;&#x4E2D;&#x7F8E;&#x9ED1;&#x5BA2;&#x5927;&#x6218;&#x5440;&#xFF0C;&#x6BD4;&#x5982;&#x4E2D;&#x65E5;&#x9ED1;&#x5BA2;&#x5927;&#x6218;&#x5440;&#x3002;&#x7B80;&#x76F4;&#x5982;&#x6570;&#x5BB6;&#x73CD;&#x5440;&#x3002;&#x4E00;&#x822C;&#x6211;&#x90FD;&#x4E0D;&#x8BF4;&#x8BDD;&#xFF0C;&#x5076;&#x5C14;&#x5F00;&#x4E24;&#x53E5;&#x73A9;&#x7B11;&#x3002;&#x6211;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x548C;&#x8001;&#x5F20;&#x5728;&#x4E00;&#x8D77;&#x3002;<br>&#x3000;&#x3000; &#x4E0B;&#x5348;&#x7684;&#x65F6;&#x5019;&#x5F00;&#x4E86;&#x4F1A;&#xFF0C;&#x6211;&#x4EEC;&#x5230;&#x4E86;&#x519B;&#x533A;&#x7684;&#x673A;&#x623F;&#x3002;&#x6211;&#x4EEC;&#x5F7B;&#x5E95;&#x660E;&#x767D;&#x4E86;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;<br>&#x3000;&#x3000;&#x3000;&#x539F;&#x6765;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x519B;&#x533A;&#x8BF7;&#x6765;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x662F;&#x6F14;&#x4E60;&#x7684;&#x4E00;&#x65B9;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x7528;&#x84DD;&#x519B;&#x548C;&#x7EA2;&#x519B;&#x6765;&#x4EE3;&#x66FF;&#x6F14;&#x4E60;&#x53CC;&#x65B9;&#x5427;&#x3002;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x84DD;&#x519B;&#x8BF7;&#x6765;&#x7684;&#x3002;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x67AA;&#x624B;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x5BF9;&#x4ED8;&#x4ED6;&#x4EEC;&#x4E07;&#x4E00;&#x65E0;&#x6CD5;&#x5BF9;&#x4ED8;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x7136;&#x4ED6;&#x4EEC;&#x6709;&#x4E13;&#x95E8;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x5206;&#x961F;&#x3002;&#x540E;&#x6765;&#x6211;&#x4ECE;&#x519B;&#x961F;&#x7684;&#x4EBA;&#x53E3;&#x4E2D;&#x624D;&#x660E;&#x767D;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x5728;&#x519B;&#x961F;&#x4E2D;&#x662F;&#x5F88;&#x5E73;&#x5E38;&#x7684;&#x3002;&#x6F14;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90E8;&#x961F;&#x4E8E;&#x90E8;&#x961F;&#x4E4B;&#x95F4;&#x771F;&#x662F;&#x4E3A;&#x4E86;&#x80DC;&#x5229;&#x662F;&#x7EDE;&#x5C3D;&#x8111;&#x6C41;&#x5440;&#x3002;&#x53CC;&#x65B9;&#x90FD;&#x4F1A;&#x52A8;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8BF7;&#x6C42;&#x5730;&#x65B9;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5E76;&#x4E14;&#x53D6;&#x5F97;&#x5148;&#x673A;&#x3002;&#x4EE5;&#x524D;&#x6F14;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x51FA;&#x73B0;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;&#x7279;&#x79CD;&#x5206;&#x961F;&#xFF0C;&#x501F;&#x7528;&#x7684;&#x5730;&#x65B9;&#x7684;&#x8F66;&#xFF0C;&#x8EB2;&#x5728;&#x5730;&#x65B9;&#x7684;&#x4E00;&#x4E2A;&#x5DE5;&#x5730;&#x4E0A;&#xFF0C;&#x5728;&#x5730;&#x65B9;&#x7684;&#x4EBA;&#x7684;&#x63A9;&#x62A4;&#x4E0B;&#x9762;&#x6F5C;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x6307;&#x6325;&#x90E8;&#xFF0C;&#x628A;&#x4EBA;&#x5BB6;&#x7684;&#x6307;&#x6325;&#x90E8;&#x7AEF;&#x4E86;&#x7684;&#x4E8B;&#x60C5;&#x5440;&#xFF0C;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#x3002;&#x5BFC;&#x6F14;&#x90E8;&#x8FD8;&#x662F;&#x8BA4;&#x4E3A;&#x4F60;&#x80DC;&#x5229;&#x4E86;&#x3002;&#x6218;&#x4E89;&#x5C31;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5B98;&#x4F60;&#x7528;&#x4EC0;&#x4E48;&#x624B;&#x6BB5;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x8FDD;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x80DC;&#x5229;&#x5C31;&#x662F;&#x539F;&#x5219;&#x3002;&#x5728;&#x90E8;&#x961F;&#x5E72;&#x8FC7;&#x7684;&#x4EBA;&#x80AF;&#x5B9A;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x662F;&#x771F;&#x7684;&#xFF0C;&#x90E8;&#x961F;&#x6F14;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x548C;&#x5730;&#x65B9;&#x8054;&#x5408;&#x7684;&#x4E8B;&#x60C5;&#x975E;&#x5E38;&#x666E;&#x904D;&#x7684;&#x3002;&#x6CA1;&#x4EC0;&#x4E48;&#x7A00;&#x5947;&#x3002;&#x6BD5;&#x7ADF;&#x662F;&#x548C;&#x5E73;&#x65F6;&#x671F;&#x7684;&#x6F14;&#x4E60;&#xFF0C;&#x51B5;&#x4E14;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x9884;&#x5907;&#x5F79;&#x519B;&#x4EBA;&#xFF0C;&#x771F;&#x7684;&#x6253;&#x8D77;&#x4ED7;&#x6765;&#xFF0C;&#x5230;&#x90E8;&#x961F;&#x5E2E;&#x5FD9;&#xFF0C;&#x4E5F;&#x662F;&#x5408;&#x60C5;&#x5408;&#x7406;&#x7684;&#x3002;<br>&#x3000;&#x3000; &#x4E0D;&#x96BE;&#x731C;&#x51FA;&#xFF0C;&#x5176;&#x5B9E;&#x7EA2;&#x519B;&#x4E5F;&#x8BF7;&#x4E86;&#x4E0D;&#x5C11;&#x5730;&#x65B9;&#x4E0A;&#x7684;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6B21;&#x662F;&#x4ED6;&#x4EEC;&#x9996;&#x6B21;&#x6F14;&#x4E60;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x5FC3;&#x4E2D;&#x90FD;&#x6CA1;&#x5E95;&#x3002;&#x8BF4;&#x8BDD;&#x5B9E;&#x8BDD;&#xFF0C;&#x53CC;&#x65B9;&#x7684;&#x6307;&#x6325;&#x5B98;&#x4E5F;&#x786E;&#x5B9E;&#x4E0D;&#x592A;&#x61C2;&#x3002;&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x542C;&#x4ED6;&#x4EEC;&#x7684;&#x6587;&#x804C;&#x5E72;&#x90E8;&#x600E;&#x4E48;&#x8BF4;&#x5C31;&#x600E;&#x4E48;&#x505A;&#x3002;<br>&#x3000;&#x3000; &#x6211;&#x4EEC;&#x5230;&#x4E86;&#x84DD;&#x519B;&#x7684;&#x673A;&#x623F;&#xFF0C;&#x9886;&#x5BFC;&#x6211;&#x4EEC;&#x7684;&#x961F;&#x957F;&#x59D3;&#x5218;&#x3002;&#x542C;&#x8BF4;&#x662F;&#x56FD;&#x9632;&#x79D1;&#x6280;&#x5927;&#x5B66;&#x7684;&#x6BD5;&#x4E1A;&#x751F;&#xFF0C;40&#x591A;&#x5C81;&#x7684;&#x6A21;&#x6837;&#x3002;&#x662F;&#x4E0A;&#x6821;&#x519B;&#x8854;&#x3002;&#x54C7;&#xFF0C;&#x519B;&#x8854;&#x7792;&#x9AD8;&#x7684;&#x3002;&#x4ED6;&#x624B;&#x4E0B;&#x5C31;&#x5168;&#x662F;30&#x5C81;&#x4EE5;&#x4E0B;&#x7684;&#x5E74;&#x9752;&#x4EBA;&#x3002;&#x5176;&#x5B9E;&#x5C31;5&#x4E2A;&#x4EBA;&#x3002;&#x5927;&#x90E8;&#x5206;&#x7684;&#x4EBA;&#x662F;&#x5C11;&#x5C09;&#x6216;&#x8005;&#x4E2D;&#x5C09;&#x519B;&#x8854;&#x3002;&#x8FD8;&#x6709;&#x4E24;&#x4E2A;&#x4EBA;&#x662F;&#x6587;&#x804C;&#x80A9;&#x7AE0;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5168;&#x56FD;&#x641E;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x7684;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x5E74;&#x9752;&#x4EBA;&#xFF0C;&#x6211;&#x770B;&#x519B;&#x961F;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;<br>&#x3000;&#x3000; &#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x673A;&#x623F;&#x5F88;&#x666E;&#x901A;&#xFF0C;&#x90FD;&#x662F;&#x6E05;&#x4E00;&#x8272;&#x7684;&#x6E05;&#x534E;&#x540C;&#x65B9;&#x7684;&#x673A;&#x5668;&#x3002;&#x540E;&#x6765;&#x770B;&#x914D;&#x7F6E;&#x662F;PIII800m&#x7684;cpu&#xFF0C;&#x770B;&#x6765;&#x4E70;&#x4E86;&#x6709;&#x4E9B;&#x5E74;&#x5934;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x51E0;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6BD4;&#x8F83;&#x4E13;&#x4E1A;&#xFF0C;&#x914D;&#x7F6E;&#x4E5F;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x770B;&#x4E86;&#x770B;&#xFF0C;&#x5916;&#x58F3;&#x50CF;&#x662F;HP&#x7684;hp ProLiant DL&#xFF0C;&#x4E3A;&#x4ED6;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x73BB;&#x7483;&#x683C;&#x5F00;&#x7684;&#x5355;&#x72EC;&#x623F;&#x95F4;&#x91CC;&#x9762;&#xFF0C;&#x800C;&#x4E14;&#x653E;&#x5728;&#x673A;&#x67DC;&#x91CC;&#x9762;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x50CF;&#x4E2A;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x91CC;&#x9762;&#x5F88;&#x591A;&#x6269;&#x5C55;&#x7EBF;&#x3002;&#x6211;&#x4E5F;&#x65E0;&#x6CD5;&#x4ED4;&#x7EC6;&#x770B;&#x3002;&#x8FD9;&#x4E2A;&#x5E94;&#x8BE5;&#x662F;&#x4EE5;&#x524D;&#x4E70;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x53F0;&#x662F;&#x7684;DEll PowerEdge 6600&#xFF0C;&#x4E56;&#x4E56;&#xFF0C;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x80AF;&#x5B9A;&#x65B0;&#x4E70;&#x7684;&#x3002;&#x662F;&#x5854;&#x5F0F;&#x7684;&#x3002;&#x653E;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x50CF;&#x5757;&#x77F3;&#x5934;&#xFF0C;&#x9762;&#x677F;&#x4E0A;&#x5168;&#x662F;&#x5B54;&#xFF0C;dell&#x7684;&#x6807;&#x5FD7;&#x5F88;&#x73B0;&#x773C;&#xFF0C;&#x5DE6;&#x4E0B;&#x89D2;&#x8FD8;&#x6709;&#x4E2A;intel inside&#x7684;&#x6807;&#x5FD7;&#x3002;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x548C;IBM&#x7684; xseries 440&#x6709;&#x4E00;&#x62FC;&#x3002;&#x3000;&#x3000;&#x5176;&#x4ED6;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x4E86;&#x3002;&#x53CD;&#x6B63;&#x6211;&#x89C9;&#x5F97;&#x8FD8;&#x4E0D;&#x5982;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x914D;&#x7F6E;&#x597D;&#x3002;&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6211;&#x4EEC;&#x519B;&#x961F;&#x4E5F;&#x5728;&#x5EFA;&#x8BBE;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;&#x90A3;&#x53F0;dell&#x7684;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x4E0D;&#x9519;&#x3002;&#x5218;&#x961F;&#x957F;&#x7528;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x5C45;&#x7136;&#x4E5F;&#x662F;&#x7D2B;&#x5149;&#x3002;&#x5475;&#x5475;&#x3002;&#x548C;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x4E00;&#x6837;&#x3002;<br>&#x3000;&#x3000; &#x5927;&#x5BB6;&#x4E92;&#x76F8;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x5C31;&#x5F00;&#x59CB;&#x8FF0;&#x8BF4;&#x4EFB;&#x52A1;&#x3002;<br>&#x3000;&#x3000; &#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x5206;&#x4E3A;&#x5BC6;&#x7801;&#x7834;&#x89E3;&#xFF0C;&#x7F51;&#x7EDC;&#x6E17;&#x900F;&#xFF0C;&#x7F51;&#x7EDC;&#x653B;&#x51FB;&#x3002;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x5C31;&#x662F;&#x7EA2;&#x519B;&#x548C;&#x84DD;&#x519B;&#x7684;&#x7F51;&#x7EDC;&#x548C;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x662F;&#x8FDE;&#x540C;&#x7684;&#x3002;&#x5927;&#x5BB6;&#x7684;&#x4F5C;&#x6218;&#x8BA1;&#x5212;&#x548C;&#x60C5;&#x62A5;&#x90FD;&#x5FC5;&#x987B;&#x653E;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x9632;&#x62A4;&#x624B;&#x6BB5;&#x81EA;&#x5DF1;&#x60F3;&#x529E;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x65AD;&#x7F51;&#x7EBF;&#xFF0C;&#x5FC5;&#x987B;&#x80FD;&#x4FDD;&#x8BC1;&#x53CB;&#x519B;&#x80FD;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x6B63;&#x5E38;&#x901A;&#x8BAF;&#x3002;&#x7136;&#x540E;&#x53CC;&#x65B9;&#x4FE1;&#x606F;&#x5206;&#x961F;&#x5C31;&#x5F00;&#x59CB;&#x5BF9;&#x6297;&#x3002;&#x4F60;&#x8BA9;&#x5BF9;&#x65B9;&#x7F51;&#x7EDC;&#x762B;&#x75EA;&#xFF0C;&#x8FD8;&#x662F;&#x7A83;&#x53D6;&#x5BF9;&#x65B9;&#x8D44;&#x6599;&#x4E5F;&#x597D;&#x3002;&#x968F;&#x4FBF;&#x4F60;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x7684;&#x5BF9;&#x6297;&#xFF0C;&#x6BD4;&#x5982;&#x7535;&#x5B50;&#x5BF9;&#x6297;&#xFF0C;&#x90A3;&#x4E9B;&#x4E0D;&#x7BA1;&#x6211;&#x4EEC;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x7BA1;&#x7F51;&#x7EDC;&#x5C31;&#x5BF9;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6700;&#x540E;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x8BF4;&#x4E86;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3002;&#x8BF4;&#x660E;&#x5929;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x542C;&#x4ECE;&#x6307;&#x6325;&#xFF0C;&#x6CE8;&#x610F;&#x5B89;&#x5168;&#x3002;&#x663E;&#x7136;&#x662F;&#x9488;&#x5BF9;&#x6211;&#x4EEC;&#x8FD9;&#x51E0;&#x4E2A;&#x201C;&#x6C11;&#x5175;&#x201D;&#x8BF4;&#x7684;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x5F53;&#x65F6;&#x6211;&#x4EEC;&#x5C31;&#x61F5;&#x4E86;&#x3002;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD8;&#x6709;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x662F;&#x6F14;&#x4E60;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x770B;&#x6211;&#x4EEC;&#x6CA1;&#x660E;&#x767D;&#xFF0C;&#x5C31;&#x8BF4;&#xFF0C;&#x5BF9;&#x65B9;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x6015;&#x7279;&#x79CD;&#x5206;&#x961F;&#x6765;&#x7834;&#x574F;&#x6211;&#x4EEC;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x5206;&#x961F;&#x3002;&#x6240;&#x4EE5;&#x5927;&#x5BB6;&#x8981;&#x542C;&#x4ECE;&#x8B66;&#x901A;&#x8FDE;&#x7684;&#x6307;&#x6325;&#x3002;<br>&#x3000;&#x3000;&#x5988;&#x5440;&#xFF0C;&#x641E;&#x7684;&#x50CF;&#x771F;&#x7684;&#x4E00;&#x6837;&#x3002;&#x6CA1;&#x53C2;&#x52A0;&#x8FC7;&#x6F14;&#x4E60;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x7684;&#x6F14;&#x4E60;&#x5206;&#x4E3A;&#x51E0;&#x79CD;&#xFF0C;&#x6709;&#x8868;&#x6F14;&#x578B;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x6F14;&#x7ED9;&#x4E0A;&#x7EA7;&#x770B;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x6BD4;&#x8F83;&#x5047;&#xFF0C;&#x53EA;&#x56FE;&#x597D;&#x770B;&#xFF0C;&#x4E0D;&#x56FE;&#x5B9E;&#x7528;&#x7684;&#x3002;&#x4F46;&#x662F;&#x66F4;&#x591A;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x7EC3;&#x5175;&#x6F14;&#x4E60;&#xFF0C;&#x90A3;&#x662F;&#x6B63;&#x513F;&#x516B;&#x7ECF;&#x7684;&#x50CF;&#x6253;&#x4ED7;&#x4E00;&#x6837;&#xFF0C;&#x4EC0;&#x4E48;&#x62DB;&#x6570;&#x90FD;&#x80FD;&#x7528;&#x4E0A;&#x3002;&#x6211;&#x4F53;&#x4F1A;&#x8FC7;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x771F;&#x7684;&#x5C31;&#x8DDF;&#x6253;&#x4ED7;&#x4E00;&#x6837;&#x5440;&#x3002;&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x519B;&#x961F;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x6280;&#x672F;&#x771F;&#x7684;&#x4E00;&#x822C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x6253;&#x4ED7;&#x7684;&#x65F6;&#x5019;&#x7528;&#x5904;&#x4E5F;&#x4E0D;&#x5341;&#x5206;&#x7684;&#x5927;&#xFF0C;&#x522B;&#x542C;&#x6709;&#x4E9B;&#x4EBA;&#x4E71;&#x5439;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x7684;&#x5175;&#xFF0C;&#x771F;&#x662F;&#x5389;&#x5BB3;&#xFF0C;&#x6CA1;&#x8BF4;&#x7684;&#x3002;&#x6211;&#x63A5;&#x89E6;&#x7684;&#x662F;&#x8B66;&#x901A;&#x8FDE;&#xFF0C;&#x5176;&#x5B9E;&#x5230;&#x73B0;&#x5728;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x8B66;&#x901A;&#x8FDE;&#x3002;&#x53CD;&#x6B63;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x8B66;&#x6212;&#x7684;&#x5175;&#x90A3;&#x771F;&#x662F;&#x5389;&#x5BB3;&#x5440;&#x3002;&#x4E56;&#x4E56;&#xFF0C;&#x771F;&#x662F;&#x5389;&#x5BB3;&#x5440;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x8BA8;&#x8BBA;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E2A;&#x601D;&#x7EF4;&#x8FD8;&#x662F;&#x5BF9;&#xFF0C;&#x73B0;&#x5728;&#x4E0D;&#x7BA1;&#x80FD;&#x4E0D;&#x80FD;&#x653B;&#x51FB;&#x522B;&#x4EBA;&#xFF0C;&#x5148;&#x628A;&#x81EA;&#x5DF1;&#x641E;&#x5B89;&#x5168;&#x4E86;&#x518D;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x9996;&#x5148;&#x662F;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x662F;&#x90A3;&#x53F0;dell 6600&#x3002;&#x539F;&#x914D;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;redhat 9.0&#x3002;&#x5218;&#x961F;&#x957F;&#x8BA9;&#x5927;&#x5BB6;&#x8BA8;&#x8BBA;&#x662F;&#x5426;&#x7528;&#x4ED6;&#x3002;&#x7528;&#x4ED6;&#x662F;&#x5426;&#x5B89;&#x5168;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x540C;&#x610F;&#x4F7F;&#x7528;redhat 9.0&#x3002;&#x53EA;&#x6709;&#x6211;&#x548C;&#x8001;&#x5F20;&#x53CD;&#x5BF9;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;linux&#x5BF9;&#x884C;&#x5BB6;&#x6765;&#x8BF4;&#xFF0C;&#x76F8;&#x5F53;&#x7684;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x5C3D;&#x7BA1;&#x4ED6;&#x91C7;&#x7528;&#x7684;unix&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6539;&#x7684;&#x592A;&#x591A;&#xFF0C;&#x4ED6;&#x7684;&#x65B0;&#x7248;&#x672C;&#x7684;bug&#x76F8;&#x5F53;&#x7684;&#x591A;&#x3002;&#x6BD4;&#x5982;2.4&#x5185;&#x6838;&#x5C31;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6EA2;&#x51FA;&#x73B0;&#x8C61;&#x591A;&#x3002;&#x4E0D;&#x5C11;&#x6EA2;&#x51FA;&#x90FD;&#x53EF;&#x4EE5;&#x62FF;&#x6765;&#x505A;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x3002;&#x5C3D;&#x7BA1;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x8FD8;&#x4E0D;&#x4F1A;&#x8BA9;&#x6570;&#x636E;&#x4E22;&#x5931;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x5BF9;&#x6297;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x3002;&#x5C3D;&#x7BA1;&#x80FD;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x7684;&#x4EBA;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x80AF;&#x5B9A;&#x4E5F;&#x6709;&#x597D;&#x624B;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x76F8;&#x5F53;&#x7684;&#x4E0D;&#x5B89;&#x5168;&#x3002;<br>&#x3000;&#x3000;&#x8001;&#x5F20;&#x770B;&#x6765;&#x4E5F;&#x662F;&#x4E2A;&#x884C;&#x5BB6;&#x3002;&#x4ED6;&#x8BF4;:&quot;linxu 2.4&#x5185;&#x6838;&#x5B58;&#x5728;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x3002;&quot;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x6562;&#x8BF4;&#x8BDD;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x6709;&#x8BF4;&#xFF1A;&#x201D;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x597D;&#x5462;&#xFF1F;&#x201C;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x5FC3;&#x4E2D;&#x5728;&#x60F3;&#xFF0C;&#x6700;&#x5B89;&#x5168;&#x7684;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x65B9;&#x53EF;&#x80FD;&#x8FDE;&#x539F;&#x7406;&#x90FD;&#x641E;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x66F4;&#x522B;&#x8BF4;&#x653B;&#x51FB;&#x4E86;&#x3002;&#x5475;&#x5475;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x5F00;&#x59CB;&#x8BA8;&#x8BBA;&#x7528;&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x4FE1;&#x606F;&#x5206;&#x961F;&#x7684;&#x4EBA;&#xFF0C;&#x8BF4;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7528;2.2&#x5185;&#x6838;&#x7684;linux&#x5427;&#x3002;&#x6BD4;&#x5982;debian&#x7248;&#x672C;&#x5C31;&#x4E0D;&#x9519;&#x3002;<br>&#x3000;&#x3000;&#x7F51;&#x7BA1;&#x5C0F;&#x8D75;&#x8BF4;&#xFF1A;&#x201D;&#x5E72;&#x8106;&#x5C31;&#x7528;unix&#x5427;&#x201C;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x4F59;&#x8BF4;;&quot;&#x5176;&#x5B9E;&#x7528;windows&#x4E5F;&#x4E0D;&#x9519;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x8001;&#x5F20;&#x8BF4;&#xFF1A;&#x201C;&#x7528;Freebsd&#x5427;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x8BF4;&#xFF1A;&#x201C;&#x7528;openbsd&#x5427;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x7684;&#x610F;&#x89C1;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#x7528;&#x4EC0;&#x4E48;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x8001;&#x5F20;&#x7684;&#x610F;&#x89C1;&#x548C;&#x6211;&#x6BD4;&#x8F83;&#x4E00;&#x81F4;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x89C2;&#x70B9;&#x662F;&#x5728;&#x7A33;&#x5B9A;&#x5B89;&#x5168;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x4EC0;&#x4E48;&#x751F;&#x50FB;&#x7528;&#x4EC0;&#x4E48;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x5BF9;&#x65B9;&#x5BF9;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x77E5;&#x9053;&#x4E86;&#x89E3;&#x7684;&#x8D8A;&#x5C11;&#xFF0C;&#x5C31;&#x76F8;&#x5BF9;&#x8D8A;&#x5B89;&#x5168;&#x3002;&#x5C31;&#x662F;&#x4ED6;&#x5206;&#x6790;&#xFF0C;&#x4E5F;&#x4F1A;&#x6BD4;&#x81EA;&#x5DF1;&#x719F;&#x6089;&#x7684;&#x7CFB;&#x7EDF;&#x82B1;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x3002;<br>&#x3000;&#x3000;&#x6700;&#x540E;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x7AD9;&#x5728;&#x4E86;&#x6211;&#x548C;&#x8001;&#x5F20;&#x7684;&#x4E00;&#x8FB9;&#x3002;&#x8001;&#x5F20;&#x4E5F;&#x540C;&#x610F;&#x4F7F;&#x7528;openbsd&#xFF0C;&#x652F;&#x6301;unix&#x7684;&#x4EBA;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;bsd&#x4E5F;&#x662F;unix&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x7684;&#x610F;&#x89C1;&#x88AB;&#x91C7;&#x7EB3;&#x3002;&#x5F53;&#x7136;&#x5B89;&#x88C5;&#x914D;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x843D;&#x5728;&#x6211;&#x548C;&#x8001;&#x5F20;&#x624B;&#x91CC;&#xFF0C;&#x5176;&#x4ED6;&#x4EBA;&#x90FD;&#x534F;&#x52A9;&#x68C0;&#x67E5;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#x7136;&#x540E;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x901A;&#x8BAF;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5FC5;&#x987B;&#x8981;&#x4FDD;&#x8BC1;&#x53CB;&#x519B;&#x80FD;&#x4ECE;&#x4E0A;&#x9762;&#x83B7;&#x5F97;&#x8D44;&#x6599;&#x3002;&#x80FD;&#x4E0A;&#x4F20;&#x8D44;&#x6599;&#xFF0C;&#x4F5C;&#x6218;&#x6307;&#x6325;&#x90E8;&#x4E5F;&#x8981;&#x5728;&#x4E0A;&#x9762;&#x901A;&#x8BAF;&#x3002;&#x8FD9;&#x4E2A;&#x662F;&#x4E2A;&#x5B89;&#x5168;&#x9690;&#x60A3;&#x3002;<br>&#x3000;&#x3000;&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#x4F7F;&#x7528;www&#x901A;&#x8BAF;&#xFF0C;&#x9A6C;&#x4E0A;&#x88AB;&#x5426;&#x51B3;&#x3002;&#x8FD9;&#x4E2A;&#x5BF9;&#x5389;&#x5BB3;&#x7684;&#x9ED1;&#x5BA2;&#x8FD8;&#x8BF4;&#xFF0C;&#x975E;&#x5E38;&#x4E0D;&#x5B89;&#x5168;&#x3002;<br>&#x3000;&#x3000;&#x8FD8;&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#x4F7F;&#x7528;ftp&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x88AB;&#x5426;&#x5B9A;&#x3002;&#x8FD9;&#x4E2A;&#x4E5F;&#x592A;&#x5371;&#x9669;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#xFF0C;&#x4ED6;&#x4EEC;&#x65E9;&#x5C31;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x5957;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;web&#x7684;&#x3002;&#x4ED6;&#x4EEC;&#x60F3;&#x7528;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x3002;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x90FD;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#x8FD9;&#x4E2A;&#x65B9;&#x5F0F;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x53D1;&#x8A00;&#x3002;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x4E0D;&#x4F1A;&#x5B89;&#x5168;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x89C9;&#x5F97;web&#x7CFB;&#x7EDF;&#x662F;&#x6700;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x3002;&#x6F0F;&#x6D1E;&#x592A;&#x591A;&#x3002;<br>&#x3000;&#x3000;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x518D;&#x4F7F;&#x7528;&#x4E00;&#x5957;&#x5907;&#x7528;&#x7CFB;&#x7EDF;&#x3002;&#x4E07;&#x4E00;&#x88AB;&#x653B;&#x7834;&#x5C31;&#x53EF;&#x4F7F;&#x7528;&#x5907;&#x7528;&#x65B9;&#x6848;&#xFF0C;&#x4E0D;&#x81F3;&#x4E8E;&#x5B8C;&#x5168;&#x762B;&#x75EA;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x540C;&#x610F;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x8BF4; &#xFF0C;&#x8FD9;&#x4E48;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x5907;&#x7528;&#x7CFB;&#x7EDF;&#x3002;<br>&#x3000;&#x3000;&#x8001;&#x5F20;&#x5C31;&#x8BF4;&#xFF1A;&#x201C;&#x90A3;&#x5C31;&#x81EA;&#x5DF1;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;ftp&#x3002;&#x80FD;&#x4E92;&#x76F8;&#x4F20;&#x9001;&#x6587;&#x4EF6;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x901A;&#x7528;ftp&#xFF0C;&#x5426;&#x5219;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x770B;&#x51FA;&#x6765;&#x3002;&#x8001;&#x5F20;&#x7684;&#x610F;&#x601D;&#x548C;&#x6211;&#x662F;&#x4E0D;&#x8C0B;&#x800C;&#x548C;&#x3002;&#x540E;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#x8BC1;&#x660E;&#x6211;&#x4EEC;&#x5F53;&#x65F6;&#x51C6;&#x5907;&#x8FD9;&#x4E2A;&#x5907;&#x7528;&#x7CFB;&#x7EDF;&#x662F;&#x975E;&#x5E38;&#x82F1;&#x660E;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x8BBE;&#x8BA1;&#x7684;&#x4EBA;&#x7269;&#x53C8;&#x4EA4;&#x7ED9;&#x4E86;&#x8001;&#x5F20;&#x3002;<br>&#x3000;&#x3000;&#x54CE;&#xFF0C;&#x51E0;&#x4E4E;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x90FD;&#x4EA4;&#x7ED9;&#x4E86;&#x6211;&#x548C;&#x8001;&#x5F20;&#x3002;&#x4E0D;&#x602A;&#x522B;&#x4EBA;&#xFF0C;&#x5C31;&#x602A;&#x6211;&#x548C;&#x8001;&#x5F20;&#x8BF4;&#x7684;&#x4E1C;&#x897F;&#x5927;&#x5BB6;&#x90FD;&#x597D;&#x50CF;&#x4E0D;&#x662F;&#x5F88;&#x719F;&#x6089;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x65E0;&#x6CD5;&#x8FA9;&#x9A73;&#x3002;&#x770B;&#x7684;&#x51FA;&#x6765;&#xFF0C;&#x5176;&#x4ED6;&#x4E24;&#x4F4D;&#xFF0C;&#x7F51;&#x7BA1;&#x5C0F;&#x8D75;&#x98A4;&#x957F;&#x914D;&#x7F6E;&#x6D41;&#x884C;&#x7684;unix&#x548C;linux&#x7CFB;&#x7EDF;&#x3002;&#x5C0F;&#x4F59;&#x98A4;&#x957F;windows&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x60DC;&#x8FD9;&#x91CC;&#x5B8C;&#x5168;&#x629B;&#x5F03;&#x4E86;windows&#x7CFB;&#x7EDF;&#x3002;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x90A3;&#x51E0;&#x4E2A;&#x519B;&#x4EBA;&#xFF0C;&#x597D;&#x4E9B;&#x521A;&#x521A;&#x6BD5;&#x4E1A;&#x3002;&#x77E5;&#x8BC6;&#x6DF1;&#x5EA6;&#x4E0D;&#x591F;&#x3002;&#x5218;&#x961F;&#x957F;&#x7684;&#x77E5;&#x8BC6;&#x6BD4;&#x8F83;&#x9648;&#x65E7;&#xFF0C;&#x52A0;&#x4E0A;&#x4ECE;&#x4E8B;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x591A;&#x5E74;&#xFF0C;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x7EC6;&#x8282;&#x4E86;&#x89E3;&#x4E0D;&#x6DF1;&#x5165;&#x3002;<br>&#x8001;&#x5F20;&#x5929;&#x5929;&#x548C;&#x75C5;&#x6BD2;&#x63A5;&#x89E6;&#xFF0C;&#x5176;&#x5B9E;&#x73B0;&#x5728;&#x9ED1;&#x5BA2;&#x7A0B;&#x5E8F;&#x548C;&#x75C5;&#x6BD2;&#x7A0B;&#x5E8F;&#x57FA;&#x672C;&#x4E0D;&#x5206;&#x5BB6;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x529F;&#x5E95;&#x624E;&#x5B9E;&#x3002;&#x7EC6;&#x8282;&#x6E05;&#x695A;&#x3002;&#x6211;&#x561B;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x5F53;&#x7136;&#x7B97;&#x662F;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#xFF0C;&#x800C;&#x4E14;&#x77E5;&#x8BC6;&#x9762;&#x6BD4;&#x8F83;&#x5E7F;&#xFF0C;unix&#x5E73;&#x53F0;&#x548C;windows&#x5E73;&#x53F0;&#x90FD;&#x719F;&#x6089;&#x3002;</p>
<p>&#x5206;&#x5DE5;&#x7ED3;&#x675F;&#xFF0C;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x5728;&#x90A3;&#x53F0;dell &#x4E0A;&#x5B89;&#x88C5;openbsd&#x3002;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x6211;&#x7684;&#x5305;&#x5305;&#x91CC;&#x9762;&#x90FD;&#x6709;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x53EA;&#x662F;&#x5B89;&#x88C5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x5168;&#x90E8;&#x6700;&#x5C0F;&#x5B89;&#x88C5;&#xFF0C;&#x5B89;&#x88C5;&#x4E0B;&#x6765;&#x624D;&#x4E0D;&#x5230;400M&#x3002;&#x54CE;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x4E0A;&#x53EF;&#x4EE5;&#x8BF4;&#x8FD0;&#x884C;&#x5982;&#x98DE;&#x5440;&#x3002;dell&#x7684;&#x670D;&#x52A1;&#x5668;&#x505A;&#x5DE5;&#x8BBE;&#x8BA1;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x3002;&#x9632;&#x706B;&#x5899;&#x5B89;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x8FD8;&#x5E26;&#x76D1;&#x89C6;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x7528;&#x6765;&#x4FDD;&#x536B;&#x6211;&#x7684;&#x673A;&#x5668;&#x7684;&#x3002;&#x754C;&#x9762;&#x5168;&#x662F;&#x5B57;&#x7B26;&#x754C;&#x9762;&#x7684;&#x3002;&#x5173;&#x6389;&#x6240;&#x6709;&#x7AEF;&#x53E3;&#xFF0C;&#x7136;&#x540E;&#x5B89;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;apache&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#x3002;&#x628A;&#x4ED6;&#x4EEC;&#x90A3;&#x4E2A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x88C5;&#x8FDB;&#x53BB;&#x3002;&#x9632;&#x706B;&#x5899;&#x6253;&#x5F00;80&#x7AEF;&#x53E3;&#xFF0C;&#x672C;&#x6765;&#x60F3;&#x6362;&#x4E2A;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x662F;&#x540E;&#x6765;&#x60F3;&#xFF0C;&#x5BF9;&#x65B9;&#x4E0D;&#x662F;&#x767D;&#x75F4;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x3002;&#x5E72;&#x8106;&#x5927;&#x65B9;&#x70B9;&#xFF0C;&#x5E72;&#x8106;&#x5C31;&#x5F00;80&#x3002;&#x7B49;&#x628A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x5B89;&#x88C5;&#x5B8C;&#x4E86;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x6655;&#x6B7B;&#xFF0C;&#x4ED6;&#x4EEC;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x662F;asp&#x5199;&#x7684;&#x3002;&#x5927;&#x5BB6;&#x8FD8;&#x4E0D;&#x76F8;&#x4FE1;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x4E5F;&#x4E0D;&#x76F8;&#x4FE1;&#xFF0C;&#x4F46;&#x662F;&#x4E8B;&#x5B9E;&#x5C31;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;asp&#x5199;&#x7684;&#x3002;&#x6211;&#x5230;&#x4E0D;&#x662F;&#x8BF4;asp&#x591A;&#x4E48;&#x591A;&#x4E48;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x5173;&#x952E;&#x662F;asp&#x4E00;&#x822C;&#x548C;iis&#x642D;&#x914D;&#xFF0C;&#x90A3;&#x4E2A;iis&#x662F;&#x7EDD;&#x5BF9;&#x7684;&#x4E0D;&#x5B89;&#x5168;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7684;&#x5FC3;&#x5F80;&#x4E0B;&#x6C89;&#xFF0C;&#x5929;&#xFF0C;&#x8981;&#x662F;&#x8FD8;&#x8981;&#x5B89;&#x4E2A;iis&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x770B;&#x8FD9;&#x4E2A;&#x5BF9;&#x6297;&#x522B;&#x5BF9;&#x6297;&#x4E86;&#x3002;&#x540E;&#x6765;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x8BBE;&#x8BA1;&#x8FD9;&#x4E2A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x8981;&#x5BF9;&#x6297;&#x3002;&#x8BF4;&#x7A7F;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x54CD;&#x5E94;&#x79D1;&#x6280;&#x5EFA;&#x519B;&#x7684;&#x53F7;&#x53EC;&#x641E;&#x51FA;&#x6765;&#x770B;&#x7684;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x4ED6;&#x4EEC;&#x4E5F;&#x77E5;&#x9053;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x88AB;&#x4E0A;&#x9762;&#x8BA4;&#x53EF;&#x4E86;&#x3002;&#x8981;&#x6C42;&#x63A8;&#x5E7F;&#xFF0C;&#x4F60;&#x4E0D;&#x670D;&#x6C14;&#x4E5F;&#x6CA1;&#x529E;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x6211;&#x76F8;&#x4FE1;&#x3002;&#x56E0;&#x4E3A;&#x73B0;&#x5B9E;&#x4E2D;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x592A;&#x591A;&#x3002;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x7684;&#x80E1;&#x961F;&#x957F;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;flash&#x7528;&#x7684;&#x597D;&#xFF0C;&#x800C;&#x6DF1;&#x5F97;&#x8D4F;&#x8BC6;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x54CE;&#xFF0C;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x53EA;&#x8981;&#x4E0B;&#x8F7D;&#x4E86;&#x4E00;&#x4E2A;apahe&#x5F97;asp&#x6A21;&#x5757;&#x3002;IIS&#x6211;&#x662F;&#x7EDD;&#x5BF9;&#x4E0D;&#x6562;&#x7528;&#x5F97;&#x3002;&#x5475;&#x5475;&#x3002;&#x5B89;&#x88C5;&#x597D;&#x540E;&#xFF0C;&#x6D4B;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F97;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x3002;&#x4F46;&#x662F;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7528;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7528;&#x5F97;&#x662F;&#x7684;windows sql2000&#x3002;&#x6655;&#xFF0C;&#x53C8;&#x662F;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x9690;&#x60A3;&#x3002;&#x9A6C;&#x4E0A;&#x4FEE;&#x6539;&#x6210;&#x5B89;&#x5168;&#x5F97;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x770B;&#x662F;&#x6765;&#x4E0D;&#x53CA;&#x4E86;&#x3002;&#x53EA;&#x8981;&#x5728;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x4E0A;&#x5B89;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;windows 2000 server&#xFF0B;sql2000&#x3002;&#x7136;&#x540E;&#x8865;&#x6F0F;&#x6D1E;&#x5C31;&#x8BA9;&#x5C0F;&#x4F59;&#x53BB;&#x505A;&#x5427;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x4F59;&#x4E0D;&#x6127;&#x662F;&#x67D0;&#x67D0;&#x9ED1;&#x5BA2;&#x8054;&#x76DF;&#x5F97;&#x9AA8;&#x5E72;&#xFF0C;&#x5BF9;windows&#x975E;&#x5E38;&#x6709;&#x4E00;&#x5957;&#x3002;&#x53EA;&#x89C1;&#x4ED6;&#x8FB9;&#x719F;&#x6089;&#x5F97;&#x4E0B;&#x8865;&#x4E01;&#xFF0C;&#x6539;&#x914D;&#x7F6E;&#xFF0C;&#x8FB9;&#x5495;&#x5495;&#x9686;&#x9686;&#x5F97;&#x8BF4;&#x7740;&#x4EC0;&#x4E48;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5C31;&#x548C;&#x8001;&#x5F20;&#x5546;&#x91CF;&#x5199;ftp&#x53BB;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x3002;&#x8FD9;&#x4E2A;&#x6211;&#x65E9;&#x5C31;&#x6709;&#x7A0B;&#x5E8F;&#x4E86;&#x3002;&#x6211;&#x5F97;&#x540E;&#x95E8;&#x7A0B;&#x5E8F;&#x5176;&#x5B9E;&#x5C31;&#x6709;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5F20;&#x628A;&#x539F;&#x6765;&#x5F97;&#x7A0B;&#x5E8F;&#x4FEE;&#x6539;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x88C5;&#x5230;server&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x800C;&#x4E14;&#x7AEF;&#x53E3;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x5F00;&#x653E;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x5F97;&#x540E;&#x95E8;&#x662F;&#x7684;&#x65E0;&#x6CD5;&#x626B;&#x5230;&#x7AEF;&#x53E3;&#x5F97;&#x3002;<br>&#x3000;&#x3000;&#x5012;&#x662F;&#x8BBE;&#x8BA1;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x5F97;&#x65F6;&#x5019;&#x82B1;&#x4E86;&#x6211;&#x4EEC;&#x4E0D;&#x5C11;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x7ED9;&#x53CB;&#x519B;&#x548C;&#x6307;&#x6325;&#x90E8;&#x7528;&#x5F97;&#xFF0C;&#x592A;&#x8FC7;&#x7B80;&#x964B;&#x4E0D;&#x884C;&#x3002;&#x8FD8;&#x5F97;&#x5199;&#x4E0A;&#x5E2E;&#x52A9;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;vc++&#x91CD;&#x65B0;&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x5F97;&#x754C;&#x9762;&#x3002;&#x4F30;&#x8BA1;&#x4E00;&#x822C;&#x4F1A;&#x8BA1;&#x7B97;&#x673A;&#x5F97;&#x4EBA;&#x90FD;&#x80FD;&#x64CD;&#x4F5C;&#x4E86;&#xFF0C;&#x624D;&#x7F62;&#x624B;&#x3002;</p>
<p>&#x8FD9;&#x8FB9;&#x5176;&#x4ED6;&#x5144;&#x5F1F;&#x4EEC;&#x90FD;&#x5728;&#x6D4B;&#x8BD5;&#x6211;&#x5EFA;&#x597D;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x5404;&#x6837;&#x5F97;&#x626B;&#x63CF;&#x5DE5;&#x5177;&#xFF0C;&#x90FD;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x6211;&#x5F00;&#x5F97;80&#x7AEF;&#x53E3;&#xFF0C;&#x5176;&#x4ED6;&#x90FD;&#x626B;&#x4E0D;&#x5230;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x5F97;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x548C;&#x6211;&#x4EEC;&#x5F97;&#x7279;&#x5236;&#x5F97;ftp&#x901A;&#x8BAF;&#xFF0C;&#x4E5F;&#x80FD;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x3002;<br>&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x5199;&#x5F97;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x5F97;ip&#x5305;&#x6765;&#x63A2;&#x6D4B;&#xFF0C;&#x66F4;&#x672C;&#x5C31;&#x4E0D;&#x4F1A;&#x54CD;&#x5E94;&#x4F60;&#x5F97;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x4F59;&#x4E5F;&#x5B8C;&#x6210;&#x4E86;2000&#x7CFB;&#x7EDF;&#x5F97;&#x914D;&#x7F6E;&#xFF0C;&#x540C;&#x65F6;&#x4ED6;&#x8FD8;&#x5728;&#x4FEE;&#x6539;&#x90A3;&#x4E2A;asp&#x5F97;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#xFF0C;&#x628A;&#x4E00;&#x4E9B;&#x660E;&#x663E;&#x5F97;&#x5F97;&#x6F0F;&#x6D1E;&#x8865;&#x4E0A;&#x3002;&#x5F53;&#x7136;&#x6709;&#x4E9B;&#x6F0F;&#x6D1E;&#x4ED6;&#x662F;&#x8865;&#x4E0D;&#x5B8C;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF0C;sql&#x6CE8;&#x5165;&#x653B;&#x51FB;&#xFF0C;&#x6211;&#x770B;&#x4E86;&#x770B;&#xFF0C;&#x90A3;&#x4E2A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#x3002;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x5BF9;&#x8F93;&#x5165;&#x4E0D;&#x4F5C;&#x68C0;&#x67E5;&#xFF0C;&#x7ED9;&#x5BF9;&#x65B9;&#x7559;&#x4E0B;&#x4E86;&#x5F88;&#x591A;&#x53D1;&#x6325;&#x5F97;&#x7A7A;&#x95F4;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x8BF4;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x8BF4;&#x4E5F;&#x6CA1;&#x6709;&#x3002;&#x53CD;&#x800C;&#x5F97;&#x7F6A;&#x4EBA;&#x3002;&#x5230;&#x65F6;&#x5019;&#x5E0C;&#x671B;&#x5BF9;&#x65B9;&#x5F97;&#x4EBA;&#x4E0D;&#x8981;&#x5229;&#x7528;&#x5427;&#x3002;</p>
<p>&#x4E00;&#x5207;&#x51C6;&#x5907;&#x505C;&#x5F53;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x6211;&#x4EEC;&#x7684;&#x5907;&#x4EFD;&#x5BA2;&#x6237;&#x7AEF;copy&#x5230;&#x5149;&#x76D8;&#x91CC;&#x9762;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x8BA9;&#x901A;&#x8BAF;&#x5458;&#x7ED9;&#x5404;&#x4E2A;&#x90E8;&#x95E8;&#x9001;&#x53BB;&#x3002;&#x5218;&#x961F;&#x957F;&#x628A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7528;&#x5230;&#x7684;&#x8D44;&#x6599;&#x5168;&#x90E8;&#x8F93;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x8BF4;:&quot;&#x660E;&#x5929;&#x6211;&#x4EEC;&#x968F;&#x90E8;&#x961F;&#x5F00;&#x62D4;&#xFF0C;&#x5927;&#x5BB6;&#x665A;&#x4E0A;&#x65E9;&#x95F4;&#x7761;&#x89C9;&#xFF0C;&#x670D;&#x4ECE;&#x8B66;&#x901A;&#x8FDE;&#x7684;&#x8C03;&#x5EA6;&#x3002;&#x4E0B;&#x9762;&#x5230;&#x519B;&#x9700;&#x5904;&#x53BB;&#x9886;&#x53D6;&#x7535;&#x8111;&#x548C;&#x5DE5;&#x5177;&#x3002;&#x201D;&#x81EA;&#x5DF1;&#x505A;&#x597D;&#x51C6;&#x5907;&#x3002;<br>&#x3000;&#x3000;&#x54CE;&#xFF0C;&#x8FD8;&#x8981;&#x9886;&#x7535;&#x8111;&#xFF0C;&#x662F;&#x4EC0;&#x4E48;&#x7535;&#x8111;&#xFF1F;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x6234;&#x7740;&#x4E00;&#x8111;&#x5B50;&#x7684;&#x95EE;&#x53F7;&#xFF0C;&#x8DDF;&#x7740;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x90A3;&#x5E2E;&#x54E5;&#x4EEC;&#x5230;&#x4E86;&#x519B;&#x9700;&#x5904;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x770B;&#x5230;&#x4E00;&#x5C42;&#x5C42;&#x7684;&#x957F;&#x65B9;&#x5F62;&#x7684;&#x8FF7;&#x5F69;&#x7684;&#x5305;&#x5305;&#x3002;&#x6BD4;&#x666E;&#x901A;&#x7B14;&#x8BB0;&#x672C;&#x5305;&#x5305;&#x5C0F;&#x70B9;&#x3002;&#x7136;&#x540E;&#x4E00;&#x4E2A;&#x4E2A;&#x786C;&#x90A6;&#x90A6;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x88AB;&#x4ECD;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x771F;&#x662F;&#x88AB;&#x4ECD;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4E0D;&#x9A97;&#x4F60;&#x3002;&#x540C;&#x65F6;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x5305;&#x5305;&#xFF0C;&#x4E5F;&#x662F;&#x8FF7;&#x5F69;&#x8272;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x8FD9;&#x5E2E;&#x5144;&#x5F1F;&#x5982;&#x6B64;&#x4ECD;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x4EE5;&#x4E3A;&#x4E0D;&#x662F;&#x7535;&#x8111;&#x3002;&#x7ED3;&#x679C;&#x6253;&#x5F00;&#x4E00;&#x770B;&#xFF0C;&#x4E56;&#x4E56;&#xFF0C;&#x771F;&#x662F;&#x7535;&#x8111;&#x5440;&#xFF0C;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x3002;&#x800C;&#x4E14;&#x53C8;&#x662F;&#x7D2B;&#x5149;&#x7684;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x4E0D;&#x77E5;&#x9053;&#x7D2B;&#x5149;&#x8FD9;&#x6B3E;&#x7535;&#x8111;&#x7684;&#x6765;&#x5386;&#x3002;&#x540E;&#x6765;&#x624D;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x7D2B;&#x5149;&#x7684;&#x519B;&#x7528;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;VL298&#x519B;&#x7528;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5305;&#x5305;&#x91CC;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x914D;&#x4EF6;&#x3002;&#x5149;&#x76D8;&#x5440;&#xFF0C;&#x8FD8;&#x6709;&#x5916;&#x63A5;&#x8FDE;&#x7EBF;&#x5440;&#x3002;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x5F53;&#x65F6;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;&#x519B;&#x7528;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x3002;&#x771F;&#x662F;&#x7231;&#x4E0D;&#x91CA;&#x624B;&#x3002;&#x8DD1;&#x56DE;&#x5BBF;&#x820D;&#x4E00;&#x770B;&#xFF0C;&#x539F;&#x6765;&#x662F;&#x7684;P4 1.7G&#x7684;&#x79FB;&#x52A8;cpu&#x3002;&#x5475;&#x5475;&#xFF0C;&#x7D2B;&#x5149;&#x8FD9;&#x6B21;&#x4E0D;&#x6562;&#x7528;&#x53F0;&#x5F0F;cpu&#x4E86;&#x3002;<br>&#x3000;&#x7535;&#x8111;&#x5F88;&#x91CD;&#x3002;&#x4E00;&#x770B;&#x6027;&#x80FD;&#x4ECB;&#x7ECD;&#xFF0C;&#x4E56;&#x4E56;&#x3002;&#x771F;&#x6B63;&#x7684;&#x9632;&#x6C34;&#x6297;&#x9707;&#x52A8;&#x5440;&#x3002;&#x6454;&#x5728;&#x5730;&#x4E0A;&#xFF0C;&#x771F;&#x7684;&#x4E00;&#x70B9;&#x4E8B;&#x60C5;&#x90FD;&#x6CA1;&#x6709;&#x5440;&#x3002;<br>&#x3000;&#x636E;&#x8BF4;&#x952E;&#x76D8;&#x4E0A;&#x653E;100&#x6BEB;&#x5347;&#x7684;&#x6C34;&#x4E5F;&#x4E00;&#x70B9;&#x4E8B;&#x60C5;&#x6CA1;&#x6709;&#x5440;&#x3002;<br>&#x3000;&#x540E;&#x6765;&#x6211;&#x770B;&#x5230;&#x4FE1;&#x606F;&#x961F;&#x90A3;&#x5E2E;&#x54E5;&#x4EEC;&#x673A;&#x5668;&#x810F;&#x4E86;&#xFF0C;&#x5C31;&#x5728;&#x6C34;&#x9F99;&#x5934;&#x4E0B;&#x9762;&#x51B2;&#x5440;&#x3002;&#x725B;&#xFF01;&#x771F;&#x662F;&#x725B;&#x5440;&#xFF01;</p>
<p>&#x60F3;&#x8D77;&#x300A;&#x7A81;&#x51FA;&#x91CD;&#x56F4;&#x300B;&#x7684;&#x90A3;&#x5E2E;sb&#x5BFC;&#x6F14;&#xFF0C;&#x5728;&#x91CE;&#x5916;&#x5E10;&#x7BF7;&#x4E2D;&#x67B6;&#x8D77;&#x8054;&#x60F3;&#x53F0;&#x5F0F;&#x673A;&#x5668;&#x6765;&#x6307;&#x6325;&#x6218;&#x6597;&#xFF0C;&#x6211;&#x7B80;&#x76F4;&#x5DEE;&#x70B9;&#x5410;&#x8840;&#x5440;&#x3002;&#x59D1;&#x4E14;&#x4E0D;&#x8BF4;&#x91CE;&#x5916;&#x7535;&#x6E90;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5C31;&#x662F;&#x628A;&#x4F60;&#x7684;&#x53F0;&#x5F0F;&#x673A;&#x641E;&#x5230;&#x6218;&#x8F66;&#x4E0A;&#x53BB;&#x91CE;&#x5916;&#x98A0;&#x7C38;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x62A5;&#x4E0B;&#x6765;&#xFF0C;&#x8FD8;&#x80FD;&#x5F00;&#x7684;&#x4E86;&#x673A;&#x5417;&#xFF1F;<br>&#x3000;&#x770B;&#x770B;&#xFF0C;&#x6211;&#x624B;&#x4E2D;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x519B;&#x7528;&#x7684;&#x7535;&#x8111;&#x3002;&#x81EA;&#x5907;&#x7535;&#x6C60;&#x53EF;&#x4EE5;&#x575A;&#x6301;8&#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x3002;&#x8DE8;&#x5728;&#x8EAB;&#x4E0A;&#xFF0C;&#x8DDF;&#x80CC;&#x4E2A;&#x5B50;&#x5F39;&#x888B;&#x5DEE;&#x4E0D;&#x591A;&#x3002;&#x6478;&#x722C;&#x6EDA;&#x6253;&#xFF0C;&#x771F;&#x7684;&#x6CA1;&#x7684;&#x95EE;&#x9898;&#x5440;&#x3002;<br>&#x3000;&#x62A5;&#x7740;&#x90A3;&#x592A;&#x7535;&#x8111;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7684;&#x8F6F;&#x4EF6;&#x914D;&#x7F6E;&#x597D;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x7684;windows 2000&#x3002;&#x5475;&#x5475;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#x4E0D;&#x6015;&#x3002;</p>
<p>&#x90A3;&#x5929;&#x665A;&#x4E0A;&#x597D;&#x5174;&#x594B;&#x5440;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter7.html" class="navigation navigation-prev " aria-label="Previous page: 第七章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter9.html" class="navigation navigation-next " aria-label="Next page: 第九章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第八章","level":"1.9","depth":1,"next":{"title":"第九章","level":"1.10","depth":1,"path":"chapter9.md","ref":"chapter9.md","articles":[]},"previous":{"title":"第七章","level":"1.8","depth":1,"path":"chapter7.md","ref":"chapter7.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter8.md","mtime":"2017-02-27T04:04:15.735Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

