
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;">&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;</h2>
<p>&#x8FD9;&#x51E0;&#x5929;&#x773C;&#x775B;&#x8981;&#x597D;&#x53D7;&#x4E9B;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x521A;&#x4E70;&#x4E86;&#x4E00;&#x4E2A;15&#x2019;&#x7684;&#x6DB2;&#x6676;&#x663E;&#x793A;&#x5668;&#x3002;&#x4E5F;&#x8BB8;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x6211;&#x4EE5;&#x524D;&#x7684;&#x90A3;&#x4E2A;&#x7279;&#x4E3D;&#x73D1;&#x7684;17&quot;&#x7684;&#x663E;&#x793A;&#x5668;&#x5E94;&#x8BE5;&#x5F88;&#x5A01;&#x98CE;&#x624D;&#x5BF9;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x6574;&#x5929;15&#x4E2A;&#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x5750;&#x5728;&#x663E;&#x793A;&#x5668;&#x9762;&#x524D;&#xFF0C;&#x8DDD;&#x79BB;&#x4E0D;&#x8D85;&#x8FC7;30&#x5398;&#x7C73;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x90A3;&#x4E2A;CRT&#x663E;&#x793A;&#x5668;&#x7EDD;&#x5BF9;&#x662F;&#x4E00;&#x4E2A;&#x7978;&#x5BB3;&#xFF01;&#x773C;&#x775B;&#x7EA2;&#x80BF;&#xFF0C;&#x5E03;&#x6EE1;&#x8840;&#x4E1D;&#xFF0C;&#x5934;&#x53D1;&#x8131;&#x843D;&#xFF0C;&#x98DF;&#x6B32;&#x4E0D;&#x632F;&#xFF0C;&#x51FA;&#x95E8;&#x8FD8;&#x7279;&#x522B;&#x6015;&#x5149;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x548C;&#x90A3;&#x4E2A;CRT&#x663E;&#x793A;&#x5668;&#x7EDD;&#x5BF9;&#x8131;&#x4E0D;&#x4E86;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5206;&#x6790;&#x8FD9;&#x4E2A;&#x653B;&#x51FB;&#x76EE;&#x6807;&#x5DF2;&#x7ECF;1&#x4E2A;&#x591A;&#x661F;&#x671F;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x70B9;&#x8FDB;&#x5C55;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x5012;&#x662F;&#x4E0D;&#x5FC3;&#x6025;&#xFF0C;&#x5076;&#x5C14;&#x8FD8;&#x4E0A;&#x4E0A;&#x804A;&#x5929;&#x5BA4;&#xFF0C;&#x548C;MM&#x4EEC;&#x8C03;&#x7B11;&#x4E00;&#x756A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x5176;&#x5B9E;&#x90FD;&#x5728;&#x60F3;&#xFF0C;&#x4ED6;&#x5988;&#x7684;&#xFF0C;&#x96BE;&#x9053;&#x771F;&#x7684;&#x5C31;&#x6CA1;&#x6709;&#x6F0F;&#x6D1E;&#x5417;&#xFF1F;</p>
<p>&#x8981;&#x653B;&#x7834;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x4E13;&#x4E1A;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x54EA;&#x91CC;&#x6709;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#xFF1F;&#x4EBA;&#x5BB6;&#x7684;&#x7F51;&#x7BA1;&#x96BE;&#x9053;&#x90FD;&#x662F;&#x50BB;&#x5B50;&#xFF1F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5176;&#x5B9E;&#x8C01;&#x4E5F;&#x4E0D;&#x6BD4;&#x8C01;&#x50BB;&#x591A;&#x5C11;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x77E5;&#x8BC6;&#x5C31;&#x90A3;&#x4E48;&#x70B9;&#x4E1C;&#x897F;&#xFF0C;&#x5B66;&#x61C2;&#x7684;&#x4EBA;&#x5176;&#x5B9E;&#x90FD;&#x660E;&#x767D;&#x5C31;&#x90A3;&#x4E48;&#x4E2A;&#x73A9;&#x610F;&#xFF0C;&#x522B;&#x770B;&#x73B0;&#x5728;&#x65B0;&#x7684;&#x540D;&#x8BCD;&#x4E00;&#x5806;&#x4E00;&#x5806;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x548C;&#x5341;&#x5E74;&#x524D;&#x7684;&#x4E1C;&#x897F;&#x5DEE;&#x522B;&#x4E0D;&#x5927;&#xFF0C;&#x5C24;&#x5176;&#x5BF9;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x4E13;&#x95E8;&#x8FDB;&#x653B;&#x522B;&#x4EBA;&#x7F51;&#x7AD9;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x773C;&#x91CC;&#xFF0C;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x4E00;&#x6761;&#x4E00;&#x6761;&#x7684;&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x66F4;&#x662F;&#x5DEE;&#x522B;&#x4E0D;&#x5927;&#x3002;&#x65E0;&#x804A;&#x5730;&#x5728;&#x7F51;&#x4E0A;&#x901B;&#xFF0C;&#x968F;&#x4FBF;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x8BBA;&#x575B;&#xFF0C;&#x968F;&#x4FBF;&#x8FD9;&#x4E48;&#x4E00;&#x770B;&#xFF0C;&#x5C31;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5E16;&#x5B50;&#xFF0C;&#x4E5F;&#x8BB8;&#x5929;&#x751F;&#x5BF9;&#x9ED1;&#x5BA2;&#x7684;&#x4E1C;&#x897F;&#x654F;&#x611F;&#xFF0C;&#x968F;&#x4FBF;&#x8FD9;&#x4E48;&#x4E00;&#x770B;&#xFF0C;&#x770B;&#x5230;&#x7684;&#x4E0D;&#x662F;&#x522B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x5E16;&#x5B50;&#xFF1A;3&#x5206;&#x949F;&#x9ED1;&#x6389;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x3002;&#x4E00;&#x4E2A;&#x201C;&#x725B;&#x4EBA;&#x201D;&#x5728;&#x4E0A;&#x9762;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4E86;&#x81EA;&#x5DF1;&#x5982;&#x4F55;&#x5728;3&#x5206;&#x949F;&#x653B;&#x5165;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x540E;&#x9762;&#x5F88;&#x591A;&#x8D5E;&#x8A89;&#x7684;&#x56DE;&#x5E16;&#x3002;&#x8FD9;&#x4F4D;&#x8001;&#x5144;&#x4FE8;&#x7136;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x9AD8;&#x624B;&#x5F62;&#x8C61;&#x4E86;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x6211;&#x7981;&#x4E0D;&#x4F4F;&#x7B11;&#x8D77;&#x6765;&#x3002;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x7F51;&#x4E0A;&#x5B9E;&#x5728;&#x592A;&#x591A;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x5BF9;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x611F;&#x89C9;&#x975E;&#x5E38;&#x795E;&#x79D8;&#xFF0C;&#x5305;&#x62EC;&#x4E0D;&#x5C11;&#x7684;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#x5728;&#x5185;&#xFF0C;&#x52A0;&#x4E0A;&#x4E00;&#x5E2E;&#x201C;&#x8BA1;&#x7B97;&#x673A;&#x76F2;&#x201D;&#x5BFC;&#x6F14;&#x7684;&#x6E32;&#x67D3;&#xFF0C;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x51E0;&#x4E4E;&#x6210;&#x4E86;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#xFF0C;&#x62AC;&#x9AD8;&#x81EA;&#x5DF1;&#x8EAB;&#x4EF7;&#x7684;&#x201C;&#x6CD5;&#x5B9D;&#x201D;&#x4E86;&#x3002;&#x4F60;&#x73B0;&#x5728;&#x8BF4;&#x81EA;&#x5DF1;&#x61C2;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x4EBA;&#x201C;&#x9E1F;&#x201D;&#x4F60;&#xFF1B;&#x61C2;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x968F;&#x4FBF;&#x5728;&#x8857;&#x4E0A;&#x4E00;&#x6293;&#xFF0C;10&#x4E2A;&#x6709;9&#x4E2A;&#x90FD;&#x61C2;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x662F;&#x201C;&#x8BA1;&#x7B97;&#x673A;&#x9AD8;&#x624B;&#x201D;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x53EA;&#x8981;&#x8BF4;&#x81EA;&#x5DF1;&#x662F;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x4F1A;&#x5BF9;&#x4F60;&#x975E;&#x5E38;&#x53E6;&#x773C;&#x76F8;&#x770B;&#x4E86;&#x3002;&#x5509;&#xFF0C;&#x73B0;&#x5728;&#x5C31;&#x8FD9;&#x4E48;&#x5947;&#x602A;&#x3002;&#x90FD;&#x662F;&#x90A3;&#x5E2E;&#x201C;&#x8BA1;&#x7B97;&#x673A;&#x76F2;&#x201D;&#x7684;&#x5BFC;&#x6F14;&#x5BB3;&#x7684;&#x3002;</p>
<p>&#x518D;&#x770B;&#x90A3;&#x4F4D;&#x53D1;&#x5E16;&#x5B50;&#x7684;&#x8001;&#x5144;&#xFF0C;&#x539F;&#x6765;&#x5BF9;&#x65B9;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x5BC6;&#x7801;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x4E8F;&#x4ED6;&#x8FD8;&#x53E3;&#x82E5;&#x60AC;&#x6CB3;&#x7684;&#x8BF4;&#x90A3;&#x4E48;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x4EC0;&#x4E48;&#x4E0A;&#x4F20;&#x7A0B;&#x5E8F;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x8FDE;&#x63A5;&#x5566;&#xFF0C;&#x4EC0;&#x4E48;&#x540E;&#x95E8;&#x5566;&#x3002;&#x552F;&#x72EC;&#xFF0C;&#x7834;&#x8BD1;&#x5BC6;&#x7801;&#x90A3;&#x4E00;&#x6B65;&#xFF0C;&#x4ED6;&#x53EA;&#x662F;&#x7565;&#x5FAE;&#x5E26;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x5C31;&#x51E0;&#x4E2A;&#x5B57;&#xFF0C;&#x5BC6;&#x7801;&#x4E3A;&#x7A7A;&#xFF01;&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x3002;&#x6211;&#x5F00;&#x59CB;&#x5927;&#x7B11;&#x8D77;&#x6765;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x5BC6;&#x7801;&#x90FD;&#x6CA1;&#x6709;&#x8BBE;&#xFF0C;&#x662F;&#x4E2A;&#x61C2;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x90FD;&#x5E94;&#x8BE5;&#x6653;&#x5F97;&#xFF0C;&#x5982;&#x679C;&#x4EBA;&#x5BB6;&#x8BBE;&#x7F6E;&#x4E86;&#x5BC6;&#x7801;&#xFF0C;&#x4F60;&#x90A3;&#x4E9B;&#x6B65;&#x9AA4;&#x6709;&#x5C41;&#x7528;&#x5440;&#x3002;&#x77E5;&#x9053;&#x4E86;&#x5BC6;&#x7801;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x5C31;&#x662F;&#x7F51;&#x7EDC;&#x64CD;&#x4F5C;&#x8BFE;&#x7A0B;&#x4E2D;&#x7684;&#x4E1C;&#x897F;&#x4E86;&#x3002;&#x8DDF;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x6709;&#x4E2A;&#x5C41;&#x7684;&#x5173;&#x7CFB;&#x5440;&#xFF01;&#x54C8;&#x54C8;&#x54C8;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x4ECE;&#x6765;&#x4E0D;&#x6562;&#x8BF4;&#x81EA;&#x5DF1;&#x662F;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6015;&#x522B;&#x4EBA;&#x77E5;&#x9053;&#x6211;&#x9ED1;&#x8FC7;&#x4E0D;&#x5C11;&#x7F51;&#x7AD9;&#x3002;&#x6211;&#x5176;&#x5B9E;&#x662F;&#x6015;&#x4EBA;&#x5BB6;&#x7ED9;&#x6211;&#x8981;&#x6C42;&#x53BB;&#x9ED1;&#x67D0;&#x67D0;&#x7F51;&#x7AD9;&#xFF0C;&#x5230;&#x65F6;&#x5019;&#x6211;&#x4E0B;&#x4E0D;&#x6765;&#x53F0;&#x3002;&#x6BD4;&#x5982;&#x9762;&#x5BF9;&#x4E00;&#x4E2A;&#x53EF;&#x7231;MM&#x7684;&#x54C0;&#x6C42;&#xFF0C;&#x4F60;&#x5982;&#x4F55;&#x56DE;&#x7B54;&#xFF0C;&#x7B54;&#x5E94;&#x5427;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x9ED1;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x5C31;&#x50CF;&#x77E5;&#x9053;&#x4E86;1&#xFF0B;3&#xFF1D;4&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5230;&#x5904;&#x7528;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x5440;&#xFF1F;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x5728;&#x7834;&#x8BD1;&#x4E4B;&#x524D;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;&#x90FD;&#x4E0D;&#x6562;&#x4E8B;&#x524D;&#x5C31;&#x8BF4;&#x81EA;&#x5DF1;&#x80FD;&#x6210;&#x529F;&#xFF0C;&#x9664;&#x975E;&#x4ED6;&#x65E9;&#x5C31;&#x628A;&#x90A3;&#x4E2A;&#x7F51;&#x7AD9;&#x9ED1;&#x6389;&#x4E86;&#xFF1B;&#x4E0D;&#x7B54;&#x5E94;&#x5427;&#xFF0C;mm&#x4F1A;&#x8BF4;&#xFF1A;&#x54FC;&#xFF0C;&#x8FD8;&#x8BF4;&#x81EA;&#x5DF1;&#x662F;&#x9ED1;&#x5BA2;&#xFF0C;&#x5149;&#x8BF4;&#x4E0D;&#x7EC3;&#xFF0C;&#x770B;&#x6765;&#x662F;&#x4E2A;&#x9A97;&#x5B50;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x8FD9;&#x5BF9;&#x6211;&#x521A;&#x521A;&#x6811;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#x5149;&#x8F89;&#x5F62;&#x8C61;&#xFF0C;&#x5C82;&#x4E0D;&#x662F;&#x81F4;&#x547D;&#x6253;&#x51FB;&#xFF01;&#x9ED1;&#x5BA2;&#x5176;&#x5B9E;&#x6210;&#x529F;&#x5C31;&#x9760;&#x8FD0;&#x6C14;&#x548C;&#x6BC5;&#x529B;&#xFF0C;&#x5F53;&#x7136;&#x6280;&#x672F;&#x529F;&#x5E95;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x3002;&#x65E0;&#x804A;&#xFF0C;&#x8FD9;&#x4E9B;&#x5E16;&#x5B50;&#x6211;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x5230;&#xFF0C;&#x7136;&#x540E;&#x6F02;&#x4E00;&#x773C;&#x5C31;&#x77E5;&#x9053;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x7136;&#x540E;&#x5C31;&#x6C89;&#x9ED8;&#x7684;&#x79BB;&#x5F00;&#xFF0C;&#x5F53;&#x7136;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x5FCD;&#x4E0D;&#x4F4F;&#x7684;&#x7B11;&#x3002;&#x4E0D;&#x8FC7;&#x770B;&#x7684;&#x592A;&#x591A;&#xFF0C;&#x7B11;&#x7684;&#x65F6;&#x5019;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x8FD8;&#x662F;&#x7B11;&#x4E86;&#xFF0C;&#x90A3;&#x4E2A;&#x201C;&#x725B;&#x4EBA;&#x201D;&#x786E;&#x5B9E;&#x6BD4;&#x8F83;&#x53EF;&#x7231;&#x3002;&#x5475;&#x5475;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x8111;&#x5B50;&#x91CC;&#x9762;&#x8FD8;&#x662F;&#x5728;&#x60F3;&#x6211;&#x7684;&#x90A3;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x4E00;&#x4E2A;&#x519B;&#x65B9;&#x7F51;&#x7AD9;&#x3002;&#x6211;&#x5DF2;&#x7ECF;&#x626B;&#x63CF;&#x8FC7;&#x5F88;&#x591A;&#x6B21;&#x4E86;&#x3002;&#x4ED6;&#x4EEC;&#x7528;&#x7684;apache&#x6700;&#x65B0;&#x7248;&#x672C;&#x4F5C;&#x7684;http server&#x3002;&#x91C7;&#x7528;&#x7684;&#x662F;unix&#xFF0C;&#x5177;&#x4F53;&#x8BF4;&#x50CF;&#x662F;sco unix&#xFF0C;&#x7248;&#x672C;&#x4ECE;&#x53CD;&#x9988;&#x7684;&#x4FE1;&#x606F;&#x770B;&#x5E94;&#x8BE5;&#x662F;7.0&#x7684;scounixware&#x3002;&#x4F46;&#x662F;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x51C6;&#x786E;&#x3002;&#x73B0;&#x5728;&#x4FEE;&#x6539;&#x7248;&#x672C;&#x6765;&#x8BA9;&#x4F60;&#x8BA4;&#x8BC6;&#x9519;&#x8BEF;&#x662F;&#x6BD4;&#x8F83;&#x6D41;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x7AEF;&#x53E3;&#x5F00;&#x4E86;80&#xFF0C;21&#x548C;20&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x7BA1;&#x7406;&#x7684;4410&#x7684;&#x7AEF;&#x53E3;&#x5C31;&#x56DB;&#x4E2A;&#x3002;&#x4ED6;&#x5988;&#x7684;&#xFF0C;&#x7F8E;&#x56FD;&#x9B3C;&#x5B50;&#x6D77;&#x519B;&#x4E2D;&#x8FD8;&#x662F;&#x6709;&#x80FD;&#x4EBA;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x628A;&#x4F60;&#x7684;&#x5FF5;&#x5934;&#x65AD;&#x4E86;&#x3002;21&#x548C;20&#x663E;&#x7136;&#x662F;&#x7528;&#x6765;&#x4F5C;FTP&#x7684;&#xFF0C;&#x4ED6;&#x7528;&#x7684;FTP&#x7684;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C45;&#x7136;&#x662F;vsftp1.2&#x7248;&#x672C;&#x3002;&#x9760;&#xFF01;&#x5C31;&#x662F;&#x90A3;&#x4E2A;&#x53F7;&#x79F0;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x7A33;&#x5B9A;&#x548C;&#x6700;&#x5B89;&#x5168;&#x7684;ftp&#x670D;&#x52A1;&#x5668;&#x3002;vs&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;very security &#x7684;&#x610F;&#x601D;&#x3002;&#x4ECE;&#x540D;&#x5B57;&#x770B;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5389;&#x5BB3;&#x4E86;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x73A9;&#x610F;&#x522B;&#x770B;&#x5F88;&#x5C0F;&#xFF0C;&#x529F;&#x80FD;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x5B89;&#x5168;&#x6027;&#x771F;&#x662F;&#x4E0D;&#x662F;&#x5439;&#x7684;&#x3002;&#x73B0;&#x5728;&#x7F51;&#x4E0A;&#x8FD8;&#x6CA1;&#x6709;&#x516C;&#x5F00;&#x8FC7;&#x8FD9;&#x4E2A;&#x80FD;&#x653B;&#x7834;&#x8FD9;&#x4E2A;vs&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x6211;&#x4EE5;&#x524D;&#x591A;&#x6B21;&#x9047;&#x5230;&#x8FC7;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x6210;&#x529F;&#xFF0C;&#x90FD;&#x662F;&#x4ECE;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x60F3;&#x7684;&#x529E;&#x6CD5;&#xFF0C;&#x73B0;&#x5728;&#x53C8;&#x9047;&#x5230;&#x8FD9;&#x4E2A;&#x73A9;&#x610F;&#x4E86;&#x3002;&#x770B;&#x6765;&#x5BF9;&#x65B9;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x884C;&#x3002;</p>
<p>apache&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x4F7F;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;http server&#x3002;&#x8981;&#x653B;&#x7834;&#x5B83;&#x4E5F;&#x662F;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x65E0;&#x6570;&#x7684;&#x9AD8;&#x624B;&#x7684;&#x5B9E;&#x8DF5;&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x7EDD;&#x5BF9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x786C;&#x7684;&#x9AA8;&#x5934;&#x3002;&#x6211;&#x4E0D;&#x662F;&#x795E;&#x4ED9;&#x3002;&#x6211;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x5E76;&#x4E0D;&#x6BD4;&#x4EBA;&#x5BB6;&#x591A;&#x4E00;&#x4E2A;&#x8111;&#x888B;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x5426;&#x89C9;&#x5F97;&#x4F1A;&#x5F71;&#x54CD;&#x6211;&#x7684;&#x5F62;&#x8C61;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x8FD8;&#x662F;&#x8001;&#x5B9E;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x3002;&#x5176;&#x5B9E;&#x4E00;&#x822C;&#x7684;unix&#x548C;linux&#x4E3B;&#x673A;&#x90FD;&#x4F1A;&#x7559;&#x4E0B;&#x8FDC;&#x7A0B;&#x767B;&#x9646;&#x7684;&#x53E3;&#x5B50;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x5BC6;&#x7801;&#xFF0C;&#x8FD8;&#x662F;&#x6CA1;&#x7528;&#x3002;&#x4EC0;&#x4E48;&#xFF0C;&#x7834;&#x8BD1;&#x5BC6;&#x7801;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x4EE5;&#x4E3A;&#x8FD9;&#x662F;email&#x4FE1;&#x7BB1;&#x5440;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x5BC6;&#x7801;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x524D;&#x65E0;&#x53E4;&#x4EBA;&#x540E;&#x65E0;&#x6765;&#x8005;&#xFF0C;&#x80FD;&#x8BA9;&#x4F60;&#x731C;&#x51FA;&#x6765;&#xFF1F;&#x51B5;&#x4E14;&#xFF0C;&#x767B;&#x9646;&#x4E09;&#x6B21;&#x4E0D;&#x5BF9;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x7ED9;&#x4F60;&#x8FDE;&#x63A5;&#x4E86;&#x3002;</p>
<p>&#x5B9E;&#x5728;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#xFF0C;&#x5C31;&#x5728;&#x4ED6;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x80E1;&#x4E71;&#x70B9;&#x7740;&#xFF0C;&#x5FC3;&#x91CC;&#x60F3;&#xFF0C;&#x662F;&#x5426;&#x653E;&#x5F03;&#x7B97;&#x4E86;&#x3002;&#x7F8E;&#x56FD;&#x6D77;&#x519B;&#x7684;&#x88C5;&#x5907;&#x771F;&#x4ED6;&#x5988;&#x7684;&#x597D;&#xFF0C;&#x5F53;&#x5175;&#x7684;&#x5F85;&#x9047;&#x771F;&#x7684;&#x597D;&#xFF0C;&#x7F51;&#x7AD9;&#x4E0A;&#x5F88;&#x591A;&#x56FE;&#x7247;&#xFF0C;&#x8FD8;&#x6709;&#x58EB;&#x5175;&#x641E;&#x7684;&#x8D5B;&#x8F66;&#x5927;&#x8D5B;&#xFF0C;&#x5168;&#x662F;&#x6211;&#x6CA1;&#x770B;&#x8FC7;&#x7684;&#x8D5B;&#x8F66;&#x3002;&#x771F;&#x662F;&#x6709;&#x94B1;&#x5440;&#x3002;&#x5509;&#xFF0C;&#x6211;&#x4EEC;&#x5F53;&#x5175;&#x7684;&#x9664;&#x4E86;&#x5403;&#x82E6;&#xFF0C;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x6253;&#x8D77;&#x4ED7;&#x4E86;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x4EBA;&#x80AF;&#x5B9A;&#x4E0D;&#x5982;&#x6211;&#x4EEC;&#x7684;&#x3002;</p>
<p>&#x7A81;&#x7136;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x4FF1;&#x4E50;&#x90E8;&#x767B;&#x9646;&#x5165;&#x53E3;&#xFF0C;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x767B;&#x9646;&#x6846;&#x3002;&#x4E00;&#x770B;&#x4E0A;&#x9762;&#x7684;&#x8FDE;&#x63A5;&#x5730;&#x5740;&#xFF0C;&#x662F;php&#x5199;&#x7684;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;bbs&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x754C;&#x9762;&#x3002;&#x968F;&#x4FBF;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x8FDB;&#x53BB;&#x4E00;&#x770B;&#x3002;&#x54C7;&#xFF0C;&#x91CC;&#x9762;&#x662F;&#x4E2A;&#x5C0F;&#x793E;&#x533A;&#xFF0C;&#x6709;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x6709;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x53EF;&#x4EE5;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#x3002;&#x5F53;&#x7136;&#x6211;&#x73B0;&#x5728;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x4EBA;&#xFF0C;&#x6CA1;&#x6709;&#x4E0A;&#x4F20;&#x6743;&#x9650;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x7684;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x7075;&#x5149;&#x4E00;&#x95EA;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x80FD;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#xFF0C;&#x5475;&#x5475;&#x3002;&#x3002;&#x3002;&#x4E5F;&#x8BB8;&#x80FD;&#x627E;&#x5230;&#x70B9;&#x6F0F;&#x6D1E;&#x3002;&#x6211;&#x4E5F;&#x4E0D;&#x6562;&#x80AF;&#x5B9A;&#x3002;&#x4E8E;&#x662F;&#x90A3;&#x4E2A;&#x7F51;&#x6C11;&#x53EB;caption Tom&#x7684;&#x7BA1;&#x7406;&#x5458;&#x843D;&#x5165;&#x6211;&#x7684;&#x89C6;&#x7EBF;&#xFF0C;&#x7834;&#x8BD1;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x800C;&#x4E14;&#x5728;bbs&#x4E0A;&#x9762;&#x8981;&#x5BB9;&#x6613;&#x591A;&#x4E86;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x90A3;&#x4E2A;captionTom&#x80AF;&#x5B9A;&#x4E0D;&#x4F1A;&#x662F;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x4ED6;&#x80AF;&#x5B9A;&#x6709;&#x758F;&#x5FFD;&#x7684;&#x65F6;&#x5019;&#x3002;&#x3002;&#x3002;&#x597D;&#xFF01;&#x5C31;&#x76EF;&#x4ED6;&#x4E86;&#x3002;&#x3002;&#x3002;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x7ACB;&#x523B;&#x6709;&#x4E86;&#x7CBE;&#x795E;&#x3002;&#x5E72;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x7684;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x5C31;&#x8FD9;&#x5FB7;&#x884C;&#xFF0C;&#x5E73;&#x65F6;&#x7684;&#x65F6;&#x5019;&#x5944;&#x7684;&#x50CF;&#x4E2A;&#x8981;&#x6B7B;&#x7684;&#x6BCD;&#x9E21;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x6709;&#x4E86;&#x60F3;&#x6CD5;&#x548C;&#x76EE;&#x6807;&#xFF0C;&#x5C31;&#x4EA2;&#x594B;&#x5F97;3&#x5929;&#x4E0D;&#x7761;&#x89C9;&#x4E5F;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<p>&#x5475;&#x5475;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;caption tom&#x8BA9;&#x6211;&#x540E;&#x6765;&#x6210;&#x529F;&#x5730;&#x4FB5;&#x5165;&#x4E86;&#x8FD9;&#x4E2A;&#x9632;&#x5907;&#x53CA;&#x5176;&#x5B8C;&#x5907;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x6211;&#x662F;&#x5F88;&#x4F69;&#x670D;&#x7684;&#xFF0C;&#x660E;&#x663E;&#xFF0C;&#x4F5C;&#x7F51;&#x9875;&#x7684;&#x4EBA;&#x663E;&#x7136;&#x4E0D;&#x662F;&#x90A3;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x70B9;&#x529E;&#x6CD5;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x5740;&#x60F3;&#x6362;&#x6210;&#x4EC0;&#x4E48;&#x5C31;&#x4EC0;&#x4E48;&#xFF0C;&#x5176;&#x5B9E;&#x90A3;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#x3002;&#x4F60;&#x60F3;&#x5440;&#xFF0C;&#x4F60;&#x6362;&#x7684;ip&#x5730;&#x5740;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5728;&#x4F60;&#x7684;&#x5B50;&#x7F51;&#x5185;&#x90E8;&#xFF0C;&#x5BF9;&#x65B9;&#x53D1;&#x56DE;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x65E0;&#x6CD5;&#x5230;&#x8FBE;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x4F60;&#x8BF4;&#x4F60;&#x5199;&#x4FE1;&#x7684;&#x65F6;&#x5019;&#x81EA;&#x5DF1;&#x660E;&#x660E;&#x5728;&#x5317;&#x4EAC;&#xFF0C;&#x504F;&#x8981;&#x7559;&#x4E2A;&#x4E0A;&#x6D77;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5BF9;&#x65B9;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7ED9;&#x4F60;&#x56DE;&#x4FE1;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x80FD;&#x6536;&#x5230;&#x5417;&#xFF1F;&#x522B;&#x542C;&#x90A3;&#x4E9B;sb&#x5BFC;&#x6F14;&#x4E71;&#x8BF4;&#xFF01;&#x5B57;&#x5178;10&#x5206;&#x949F;&#x5C31;&#x626B;&#x5B8C;&#x4E86;&#xFF0C;&#x770B;&#x6765;&#x5BF9;&#x65B9;&#x8FD9;&#x4E2A;caption tom&#x8FD8;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x83DC;&#x9E1F;&#xFF0C;&#x81F3;&#x5C11;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x6211;&#x7684;&#x5B57;&#x5178;&#x91CC;&#x9762;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x5509;&#xFF0C;&#x770B;&#x6765;&#x7701;&#x4E8B;&#x7684;&#x529E;&#x6CD5;&#x6CA1;&#x6709;&#x4E86;&#x3002;&#x53EA;&#x597D;&#x4F7F;&#x7528;&#x201C;&#x7A77;&#x4E3E;&#x5927;&#x6CD5;&#x201D;&#x4E86;&#x3002;&#x522B;&#x770B;&#x4E0D;&#x8D77;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x7B28;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x660E;&#x767D;&#xFF0C;&#x4F46;&#x662F;&#x8C01;&#x4E5F;&#x9632;&#x4E0D;&#x4E86;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x9664;&#x975E;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x7ED9;&#x4EBA;&#x7528;&#x3002;&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x4EBA;&#x90FD;&#x4E0D;&#x4F1A;&#x662F;&#x83DC;&#x9E1F;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5BC6;&#x7801;&#x5C31;&#x4ECE;6&#x4F4D;&#x5F00;&#x59CB;&#x5206;&#x6790;&#x5427;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x76F4;&#x89C9;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x5C31;&#x89C9;&#x5F97;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x80AF;&#x5B9A;&#x5728;6&#x4F4D;&#x4EE5;&#x4E0A;&#x3002;&#x5F88;&#x5FEB;&#x751F;&#x6210;&#x4E86;&#x6211;&#x7684;&#x7A77;&#x4E3E;&#x5BC6;&#x7801;&#x5B57;&#x5178;&#x3002;&#x6709;60&#x591A;M&#xFF0C;&#x7792;&#x5927;&#x7684;&#x3002;</p>
<p>&#x5F00;&#x52A8;&#x673A;&#x5668;&#xFF0C;&#x5F00;&#x59CB;&#x81EA;&#x52A8;&#x5206;&#x6790;&#xFF0C;&#x5C4F;&#x5E55;&#x4E0A;&#x5F00;&#x59CB;&#x8DF3;&#x52A8;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5468;&#x56F4;&#x4E00;&#x7247;&#x5BC2;&#x9759;&#xFF0C;&#x9759;&#x7684;&#x80FD;&#x542C;&#x89C1;&#x6211;&#x7684;&#x5FC3;&#x8DF3;&#x3002;&#x6211;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x6025;&#xFF0C;&#x6839;&#x636E;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6211;&#x7684;amd1600&#xFF0B;&#x770B;&#x6765;&#x6CE8;&#x5B9A;&#x8981;&#x8FDE;&#x7EED;&#x5DE5;&#x4F5C;1&#x5929;&#x4E00;&#x591C;&#x4EE5;&#x4E0A;&#x4E86;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x8BA9;&#x5B83;&#x8DF3;&#x5427;&#x3002;&#x6211;&#x8D70;&#x5230;&#x5BA2;&#x5385;&#xFF0C;&#x6253;&#x5F00;&#x7535;&#x89C6;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x662F;&#x665A;&#x4E0A;10&#x70B9;&#x949F;&#x4E86;&#x3002;</p>
<p>&#x5BF9;&#x4E0D;&#x8D77;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x5931;&#x671B;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x53F7;&#x79F0;&#x9ED1;&#x5BA2;&#x7684;&#x4EBA;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5728;1&#x5206;&#x949F;&#x4E4B;&#x5185;&#x5C31;&#x795E;&#x5947;&#x7684;&#x8F93;&#x5165;&#x6B63;&#x786E;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x5E76;&#x4F5C;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x72B6;&#xFF0C;&#x6765;&#x5C55;&#x793A;&#x6211;&#x7684;&#x98CE;&#x91C7;&#x3002;&#x770B;&#x770B;&#x7535;&#x89C6;&#x5427;&#xFF0C;&#x6253;&#x5F00;&#x7535;&#x89C6;&#xFF0C;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x90A3;&#x4E9B;&#x5F31;&#x667A;&#x7535;&#x89C6;&#x53F0;&#x6709;&#x6CA1;&#x6709;&#x597D;&#x770B;&#x4E00;&#x70B9;&#x7684;&#x8282;&#x76EE;&#x3002;&#x5509;&#xFF0C;&#x771F;&#x662F;&#x54EA;&#x58F6;&#x4E0D;&#x5F00;&#x63D0;&#x54EA;&#x58F6;&#xFF0C;&#x751F;&#x6D3B;&#x771F;&#x662F;&#x5145;&#x6EE1;&#x4E86;&#x620F;&#x5267;&#x6027;&#x3002;&#x4F60;&#x7231;&#x4FE1;&#x4E0D;&#x4FE1;&#x3002;&#x5F53;&#x65F6;&#x8F6C;&#x7684;&#x4E00;&#x4E2A;&#x53F0;&#xFF0C;&#x6B63;&#x597D;&#x5728;&#x653E;&#x4E00;&#x4E2A;&#x7535;&#x89C6;&#x8FDE;&#x7EED;&#x5267;&#xFF0C;&#x800C;&#x4E14;&#x6B63;&#x597D;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x4EBA;&#x8BF7;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;&#x6765;&#x8FDB;&#x5165;&#x4EBA;&#x5BB6;&#x7684;&#x8D22;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x7A83;&#x53D6;&#x8D44;&#x6599;&#x3002;&#x5F53;&#x65F6;&#x90A3;&#x4E2A;&#x9ED1;&#x5BA2;&#x6765;&#x4E86;&#xFF0C;&#x5F88;&#x81EA;&#x4FE1;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x4E00;&#x770B;&#x5C31;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x80AF;&#x5B9A;&#x5728;&#x51E0;&#x5206;&#x949F;&#x5185;&#x5C31;&#x80FD;&#x653B;&#x5165;&#x4EBA;&#x5BB6;&#x7CFB;&#x7EDF;&#x7684;&#x90A3;&#x79CD;&#x611F;&#x89C9;&#x3002;&#x679C;&#x7136;&#x4E0D;&#x51FA;&#x6240;&#x6599;&#xFF0C;&#x53EA;&#x89C1;&#x4ED6;&#x7684;&#x624B;&#x6307;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x4E0A;&#x4E0B;&#x7FFB;&#x98DE;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x770B;&#x5C31;&#x77E5;&#x9053;&#x662F;&#x4E00;&#x4E2A;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x6478;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x4E00;&#x770B;&#x5C31;&#x77E5;&#x9053;&#x4ED6;&#x53EA;&#x77E5;&#x9053;&#x52A8;&#x624B;&#x6307;&#xFF0C;&#x4F46;&#x662F;&#x624B;&#x6307;&#x6572;&#x5230;&#x952E;&#x76D8;&#x6CA1;&#x6709;&#xFF0C;&#x4EC0;&#x4E48;&#x952E;&#x7528;&#x4EC0;&#x4E48;&#x624B;&#x6307;&#xFF0C;&#x4ED6;&#x662F;&#x4E00;&#x70B9;&#x4E0D;&#x7BA1;&#x3002;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E24;&#x4E2A;&#x5B57;&#x201C;&#x4E71;&#x6572;&#x201D;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x4E50;&#x4E86;&#x3002;&#x54C8;&#x54C8;&#x54C8;&#x3002;&#x7136;&#x540E;&#x5C31;&#x66F4;&#x725B;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;&#x8981;&#x6C42;&#x767B;&#x9646;&#x7684;&#x7A97;&#x53E3;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8981;&#x6C42;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#xFF0C;&#x4E4B;&#x95F4;&#x8FD9;&#x4F4D;&#x201C;&#x9AD8;&#x624B;&#x201D;&#x7709;&#x5934;&#x7D27;&#x76B1;&#xFF0C;&#x6C57;&#x6C34;&#x76F4;&#x6D41;&#xFF0C;&#x770B;&#x6765;&#x786E;&#x5B9E;&#x5F88;&#x82B1;&#x529B;&#x6C14;&#x3002;&#x7136;&#x540E;&#xFF0C;3&#x5206;&#x949F;&#x4E4B;&#x540E;&#xFF0C;&#x968F;&#x7740;&#x5C4F;&#x5E55;&#x4E0A;&#x4E00;&#x4E2A;MM&#x7684;&#x58F0;&#x97F3;&#xFF1A;&#x201C;&#x606D;&#x559C;&#x60A8;&#xFF0C;&#x4F60;&#x7684;&#x5BC6;&#x7801;&#x6B63;&#x786E;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x90A3;&#x4E2A;&#x9AD8;&#x624B;&#x5C31;&#x4F5C;&#x72C2;&#x6B22;&#x548C;&#x4E0D;&#x5C51;&#x72B6;&#xFF0C;&#x65C1;&#x8FB9;&#x90A3;&#x4E2A;&#x4EBA;&#x5C31;&#x4F5C;&#x60CA;&#x559C;&#x72B6;&#x548C;&#x4F69;&#x670D;&#x72B6;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x7B11;&#x5230;&#x5728;&#x6C99;&#x53D1;&#x4E0A;&#x4E86;&#x3002;&#x54C8;&#x54C8;&#x54C8;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x6211;&#x53EA;&#x60F3;&#x5BF9;&#x90A3;&#x4E9B;&#x4E0D;&#x61C2;&#x7535;&#x8111;&#x7684;&#x89C2;&#x4F17;&#x8BF4;&#xFF0C;&#x90A3;&#x4F4D;&#x4E0D;&#x662F;&#x9ED1;&#x5BA2;&#xFF0C;&#x4ED6;&#x7EDD;&#x5BF9;&#x662F;&#x4E2A;&#x7B97;&#x547D;&#x7684;&#x3002;&#x4ED6;&#x5E94;&#x8BE5;&#x53BB;&#x7B97;&#x4F53;&#x80B2;&#x5F69;&#x7968;&#xFF0C;&#x4F53;&#x80B2;&#x5F69;&#x7968;&#x624D;7&#x4F4D;&#x561B;&#xFF0C;&#x5BF9;&#x4ED6;&#x6765;&#x8BF4;1&#x4E2A;&#x949F;&#x5934;&#x5C31;&#x80FD;&#x7B97;&#x51FA;&#x6765;&#x3002;&#x6211;&#x9760;&#xFF01;&#x6211;&#x9760;&#x4E86;&#x53C8;&#x9760;&#xFF01;</p>
<p>&#x987A;&#x4FBF;&#x7ED9;&#x90A3;&#x4E9B;&#x4EE5;&#x540E;&#x8981;&#x62CD;&#x7535;&#x5F71;&#x7684;&#x670B;&#x53CB;&#x8BF4;&#x4E00;&#x53E5;&#xFF08;&#x73B0;&#x5728;&#x90A3;&#x4E9B;&#x62CD;&#x7535;&#x5F71;&#x7535;&#x89C6;&#x7684;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x8BF4;&#x4E86;&#x4E5F;&#x6CA1;&#x7528;&#xFF09;&#xFF0C;&#x4F60;&#x4EEC;&#x4E0D;&#x61C2;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x88C5;&#x61C2;&#x3002;&#x591A;&#x7684;&#x94B1;&#x90FD;&#x82B1;&#x4E86;&#xFF0C;&#x968F;&#x4FBF;&#x5230;&#x54EA;&#x4E2A;&#x5927;&#x5B66;&#x627E;&#x4E00;&#x4E2A;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x4E13;&#x4E1A;&#x7684;&#x5B66;&#x751F;&#x4F5C;&#x4F60;&#x7684;&#x987E;&#x95EE;&#xFF0C;&#x80FD;&#x82B1;&#x51E0;&#x4E2A;&#x94B1;&#xFF1F;&#x7ED9;&#x4E2A;&#x51E0;&#x767E;&#x5757;&#x94B1;&#xFF0C;&#x4EBA;&#x5BB6;&#x8FD8;&#x4E0D;&#x4E50;&#x7684;&#x5C41;&#x98A0;&#x5C41;&#x98A0;&#x7684;&#xFF1F;&#x4FDD;&#x8BC1;&#x8BA9;&#x4F60;&#x4E0D;&#x72AF;&#x8FD9;&#x4E48;&#x5E38;&#x8BC6;&#x6027;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#x56FD;&#x5185;&#x7684;&#x5BFC;&#x6F14;&#x90FD;&#x662F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x6700;&#x725B;&#xFF0C;&#x660E;&#x660E;&#x4E0D;&#x61C2;&#x8BA1;&#x7B97;&#x673A;&#x5427;&#xFF0C;&#x4F60;&#x627F;&#x8BA4;&#x4E86;&#x53C8;&#x6709;&#x8C01;&#x4F1A;&#x8BF4;&#x4F60;&#x964D;&#x683C;&#x4E86;&#xFF1F;&#x4E0D;&#x61C2;&#x5C31;&#x627E;&#x4E2A;&#x61C2;&#x7684;&#x4EBA;&#x561B;&#xFF01;&#x8001;&#x5916;&#x4EBA;&#x5BB6;&#x5C31;&#x4F5C;&#x7684;&#x4E0D;&#x9519;&#xFF0C;&#x4F60;&#x770B;&#x4EBA;&#x5BB6;&#x62CD;&#x4F8F;&#x7F57;&#x7EAA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4E9B;&#x6A21;&#x578B;&#x8BBE;&#x8BA1;&#x5E08;&#x90FD;&#x662F;&#x5DE5;&#x4E1A;&#x754C;&#x6709;&#x540D;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x63A7;&#x5236;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x7684;&#x96C6;&#x5408;&#x3002;&#x4F60;&#x770B;&#x4EBA;&#x5BB6;&#x90A3;&#x6548;&#x679C;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter2.html" class="navigation navigation-next " aria-label="Next page: 第二章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章","level":"1.2","depth":1,"next":{"title":"第二章","level":"1.3","depth":1,"path":"chapter2.md","ref":"chapter2.md","articles":[]},"previous":{"title":"简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1.md","mtime":"2017-02-27T04:01:16.896Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

