
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第六章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter7.html" />
    
    
    <link rel="prev" href="chapter5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第六章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x548C;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x6218;&#x4E89;-3">&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90E8;&#x548C;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x6218;&#x4E89; [3]</h2>
<p>&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x6211;&#x5F88;&#x5FEB;&#x901A;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x628A;&#x6211;&#x7684;&#x7A0B;&#x5E8F;down&#x4E0B;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x8DD1;&#x5BC6;&#x7801;&#x201D;&#x6211;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x673A;&#x5668;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5F53;&#x7136;&#x662F;&#x8D8A;&#x5FEB;&#x8D8A;&#x597D;&#x62C9;&#x201D;&#x6211;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x5458;&#x6A21;&#x6837;&#x7684;&#x4EBA;&#x60F3;&#x4E86;&#x60F3;&#xFF0C;&#x8BF4;&#xFF1A;&#x201C;&#x6211;&#x4EEC;&#x79D1;&#x521A;&#x5230;&#x4E86;&#x4E00;&#x53F0;IBM&#x7684;&#x6700;&#x65B0;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x6295;&#x5165;&#x4F7F;&#x7528;&#xFF0C;&#x8981;&#x4E0D;&#x5148;&#x7528;&#x4ED6;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x8BF4;&#xFF0C;&#x597D;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x4E00;&#x4F1A;&#x513F;&#x4E00;&#x53F0;IBM&#x7684;&#x673A;&#x5668;&#x5C31;&#x88AB;&#x62B1;&#x8FC7;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x770B;&#xFF0C;&#x9760;&#xFF01;&#x516C;&#x5B89;&#x5C40;&#x771F;&#x662F;&#x6709;&#x94B1;&#x5440;&#xFF0C;&#x5509;&#xFF0C;&#x56FD;&#x5BB6;&#x7684;&#x94B1;&#x7528;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x4E0D;&#x5FC3;&#x75BC;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x53F0;IBM&#x6700;&#x65B0;&#x7684;xseries 440&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x6211;&#x4EEC;&#x90E8;&#x90FD;&#x6CA1;&#x6709;&#x7528;&#x8FC7;&#x3002;&#x6211;&#x4E5F;&#x53EA;&#x662F;&#x770B;&#x8FC7;&#x7167;&#x7247;&#x3002;&#x522B;&#x770B;&#x9ED1;&#x547C;&#x547C;&#x7684;&#x5916;&#x58F3;&#x6446;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x6BEB;&#x4E0D;&#x8D77;&#x773C;&#xFF0C;&#x4F46;&#x662F;&#x6027;&#x80FD;&#x7EDD;&#x5BF9;&#x6CA1;&#x8BF4;&#x7684;&#x5440;&#x3002;&#x6211;&#x4E00;&#x770B;&#x914D;&#x7F6E;&#xFF0C;&#x4E56;&#x4E56;&#xFF0C;&#x53CC;cpu 2.G&#x7684;&#x81F3;&#x5F3A; MP&#xFF0C;2G&#x5185;&#x5B58;&#x3002;<br>&#x3000;&#x3000;&#x7BA1;&#x7406;&#x5458;&#x8FD8;&#x95EE;&#x6211;&#xFF0C;&#x591F;&#x7528;&#x4E86;&#x5417;&#xFF1F;&#x672C;&#x6765;&#x8FD9;&#x662F;&#x7528;&#x6765;&#x4F5C;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x591F;&#x7528;&#x4E86;&#xFF0C;&#x591F;&#x7528;&#x4E86;&#x201D;&#x6655;&#xFF0C;&#x8FD9;&#x4E2A;&#x673A;&#x5668;&#x90FD;&#x6765;&#x4E0D;&#x591F;&#x7528;&#xFF0C;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x673A;&#x5668;&#x591F;&#x7528;&#x3002;<br>&#x3000;&#x3000;&#x88C5;&#x597D;&#x673A;&#x5668;&#x4E00;&#x770B;&#xFF0C;&#x6655;&#x6B7B;&#xFF0C;&#x5C45;&#x7136;&#x7CFB;&#x7EDF;&#x81EA;&#x5DF1;&#x5E26;&#x7684;&#x662F;&#x4E00;&#x4E2A;windows xp datacenter&#x7248;&#x672C;&#x3002;&#x597D;&#x5728;&#xFF0C;window xp &#x64CD;&#x4F5C;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x624D;&#x4E0D;&#x81F3;&#x4E8E;&#x51FA;&#x4E11;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x8FD9;&#x4E5F;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x7528;Data Center&#x7248;&#x672C;&#x7684;xp&#x62C9;&#x3002;&#x597D;&#x5728;&#x6211;&#x4F30;&#x8BA1;&#x5468;&#x56F4;&#x7684;&#x51E0;&#x4E2A;&#x8B66;&#x5BDF;&#x5144;&#x5F1F;&#x4E5F;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x4ED6;&#x4EEC;&#x56F4;&#x5728;&#x6211;&#x8EAB;&#x540E;&#x9762;&#xFF0C;&#x4E00;&#x53E5;&#x8BDD;&#x90FD;&#x4E0D;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x9762;&#x524D;&#x7684;&#x6211;&#x7684;&#x81EA;&#x4FE1;&#x662F;&#x7EDD;&#x5BF9;&#x6709;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x5BF9;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#xFF0C;&#x4F7F;&#x7528;xp&#x5B8C;&#x5168;&#x662F;&#x6D6A;&#x8D39;&#xFF0C;&#x4F7F;&#x7528;data center&#x66F4;&#x662F;&#x6D6A;&#x8D39;&#x4E2D;&#x7684;&#x6D6A;&#x8D39;&#x3002;<br>&#x3000;&#x3000;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x987E;&#x4E0D;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x4E86;&#x3002;&#x6211;&#x4E0D;&#x53EF;&#x80FD;&#x7ED9;&#x4ED6;&#x4EEC;&#x4ECE;&#x65B0;&#x5B89;&#x88C5;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5427;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x628A;&#x6211;&#x7684;&#x5728;windows2000&#x4E0B;&#x7F16;&#x8BD1;&#x7684;&#x63A7;&#x5236;&#x53F0;&#x89E3;&#x5BC6;&#x7A0B;&#x5E8F;down&#x4E0B;&#x6765;&#xFF0C;copy&#x5230;&#x8FD9;&#x53F0;ibm&#x4E0A;&#x3002;&#x7136;&#x540E;&#x5C0F;&#x6797;&#x628A;&#x4ED6;&#x4EEC;&#x8981;&#x89E3;&#x5BC6;&#x7684;&#x6587;&#x4EF6;&#x4E5F;copy&#x8FC7;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6253;&#x5F00;&#x63A7;&#x5236;&#x53F0;&#xFF0C;&#x8F93;&#x5165;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x540D;&#x5B57;&#x540E;&#x9762;&#x8DDF;&#x4E86;&#x4E00;&#x4E2A;&#x4ED6;&#x8981;&#x89E3;&#x5BC6;&#x7684;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x4E00;&#x56DE;&#x8F66;&#xFF0C;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x8DD1;&#x52A8;&#x8D77;&#x6765;&#x3002;&#x5C4F;&#x5E55;&#x4E0A;&#x5F00;&#x59CB;&#x95EA;&#x70C1;&#x4E00;&#x4E32;&#x4E32;&#x7684;&#x6570;&#x5B57;&#x3002;&#x4E56;&#x4E56;&#xFF0C;&#x4E0D;&#x6127;&#x662F;IBM&#x7684;&#x5B9A;&#x7EA7;server&#x3002;&#x5728;&#x6211;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x53EF;&#x4EE5;&#x770B;&#x6E05;&#x695A;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x7684;&#x6570;&#x5B57;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#xFF0C;&#x5C4F;&#x5E55;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x7247;&#x767D;&#x5440;&#xFF0C;&#x6839;&#x672C;&#x770B;&#x4E0D;&#x5230;&#x663E;&#x793A;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x663E;&#x793A;&#x8FD0;&#x884C;&#x7684;&#x592A;&#x5FEB;&#x4E86;&#x3002;&#x771F;&#x7684;&#x592A;&#x5FEB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5F53;&#x65F6;&#x771F;&#x6709;&#x628A;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x642C;&#x56DE;&#x5BB6;&#x7684;&#x51B2;&#x52A8;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7231;&#x4E0D;&#x91CA;&#x624B;&#x7684;&#x79BB;&#x5F00;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x7AD9;&#x8D77;&#x6765;&#x3002;&#x53E4;&#x4EBA;&#x8BF4;&#x5B9D;&#x5251;&#x9001;&#x82F1;&#x96C4;&#x3002;&#x6211;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x8005;&#xFF0C;&#x6CA1;&#x6709;&#x6BD4;&#x770B;&#x5230;&#x597D;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x66F4;&#x8BA9;&#x6211;&#x5174;&#x594B;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x597D;&#x4E86;&#xFF0C;&#x8BA9;&#x673A;&#x5668;&#x4E00;&#x76F4;&#x5F00;&#x7740;&#xFF0C;&#x4E0D;&#x8981;&#x505C;&#x673A;&#x3002;&#x7B49;&#x5230;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5C4F;&#x5E55;&#x4E0D;&#x95EA;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#x4E4B;&#x65E5;&#x62C9;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x51E0;&#x4E2A;&#x8B66;&#x5BDF;&#x5144;&#x5F1F;&#x7684;&#x76EE;&#x5173;&#x91CC;&#x9762;&#x660E;&#x663E;&#x6709;&#x4E86;&#x4F69;&#x670D;&#x7684;&#x610F;&#x601D;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4ED6;&#x4EEC;&#x8DDF;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x3002;<br>&#x3000;&#x3000;&#x521A;&#x624D;&#x5728;&#x8DDF;&#x8E2A;&#x75C5;&#x6BD2;&#x7684;&#x90A3;&#x4E2A;&#x8B66;&#x5BDF;&#x8BF4;&#xFF1A;&#x201C;&#x4ED6;&#x52A0;&#x5BC6;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x7B97;&#x6CD5;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x201C;DES&#x201D;&#x5BF9;&#x5185;&#x884C;&#x4E0D;&#x5FC5;&#x5E9F;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x53CD;&#x8DDF;&#x8E2A;&#x624B;&#x6BB5;&#x5389;&#x5BB3;&#x3002;&#x8DDF;&#x90FD;&#x8DDF;&#x4E0D;&#x8D70;&#x201D;<br>&#x3000;&#x3000;&#x6211;&#x7B11;&#x7B11;&#xFF0C;&#x6CA1;&#x8BF4;&#x8BDD;&#x3002;</p>
<p>&#x548C;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x51FA;&#x4E86;&#x673A;&#x623F;&#x7684;&#x95E8;&#x3002;&#x6211;&#x8BF4;&#xFF1A;&#x201D;&#x4F60;&#x4EEC;&#x771F;&#x662F;&#x6709;&#x94B1;&#x5440;&#xFF0C;&#x8FD9;&#x4E48;&#x597D;&#x7684;&#x673A;&#x5668;&#x90FD;&#x7528;&#x201C;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x4E0A;&#x7EA7;&#x914D;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x6CA1;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x5C31;&#x56DE;&#x53BB;&#x4E86;&#xFF0C;&#x7B49;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#xFF0C;&#x901A;&#x77E5;&#x6211;&#x4E00;&#x58F0;&#xFF0C;&#x8BA9;&#x6211;&#x4E5F;&#x6EE1;&#x8DB3;&#x4E00;&#x4E0B;&#x865A;&#x8363;&#x5FC3;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x5C31;&#x7B11;&#x3002;&#x5475;&#x5475;&#x7684;&#x7B11;&#x3002;&#x7136;&#x540E;&#x770B;&#x770B;&#x8868;&#xFF0C;&#x8BF4;:&quot;&#x4E0D;&#x884C;&#x5440;&#xFF0C;&#x5230;&#x5348;&#x996D;&#x65F6;&#x95F4;&#x4E86;&#x3002;&#x6211;&#x8BF7;&#x4F60;&#x5403;&#x996D;&#x5427;&#xFF0C;&#x7B97;&#x662F;&#x611F;&#x8C22;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x522B;&#x6765;&#x8FD9;&#x4E00;&#x5957;&#xFF0C;&#x6211;&#x53EF;&#x662F;&#x6E05;&#x767D;&#x7684;&#x3002;&quot;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x8BF4;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x5C31;&#x5728;&#x6211;&#x4EEC;&#x98DF;&#x5802;&#x5403;&#x5DE5;&#x4F5C;&#x9910;&#xFF0C;&#x53C8;&#x4E0D;&#x662F;&#x5728;&#x996D;&#x9986;&#x91CC;&#x9762;&#x5403;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x7B49;&#x5BC6;&#x7801;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x5728;&#x6B63;&#x5F0F;&#x8BF7;&#x4F60;&#x5427;&#x3002;&#x201D;&#x5C0F;&#x6797;MM&#x7B11;&#x7740;&#x8BF4;&#x3002;</p>
<p>&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x60F3;&#x79BB;&#x5F00;&#x3002;&#x4F46;&#x662F;&#x5C0F;&#x6797;&#x5DF2;&#x7ECF;&#x62C9;&#x7740;&#x6211;&#x5F00;&#x59CB;&#x5F80;&#x98DF;&#x5802;&#x53BB;&#x4E86;&#x3002;&#x6839;&#x672C;&#x4E0D;&#x5BB9;&#x6211;&#x627E;&#x501F;&#x53E3;&#x3002;<br>&#x3000;&#x3000;&#x73B0;&#x5728;&#x5C0F;&#x6797;&#x548C;&#x6211;&#x5DF2;&#x7ECF;&#x6DF7;&#x719F;&#x6089;&#x4E86;&#x3002;&#x5979;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x8DDF;&#x6211;&#x5BA2;&#x5957;&#x3002;<br>&#x3000;&#x3000;&#x5509;&#xFF0C;&#x770B;&#x770B;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x4F19;&#x98DF;&#x5982;&#x4F55;&#xFF0C;&#x4E5F;&#x597D;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x60F3;&#xFF0C;&#x7B49;&#x56DE;&#x53BB;&#xFF0C;&#x8DDF;&#x54E5;&#x4EEC;&#x8BF4;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x516C;&#x5B89;&#x5C40;&#x90A3;&#x5E2E;&#x4EBA;&#x5403;&#x7684;&#x4E0D;&#x5982;&#x6211;&#x4EEC;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x6211;&#x53D1;&#x8A93;&#xFF0C;&#x4E0B;&#x6B21;&#x5C31;&#x662F;&#x6253;&#x6B7B;&#x6211;&#x3002;&#x6211;&#x4E5F;&#x4E0D;&#x4F1A;&#x518D;&#x5230;&#x516C;&#x5B89;&#x5C40;&#x98DF;&#x5802;&#x53BB;&#x5403;&#x996D;&#x4E86;&#x3002;&#x5C24;&#x5176;&#x662F;&#x7A7F;&#x7684;&#x4FBF;&#x88C5;&#x7684;&#x65F6;&#x5019;&#x3002;&#x5E9F;&#x8BDD;&#xFF0C;&#x6211;&#x8FD8;&#x6709;&#x5236;&#x670D;&#x5417;&#xFF1F;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x53CD;&#x6B63;&#x5C31;&#x662F;&#x4E0D;&#x8981;&#x53BB;&#x5C31;&#x662F;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x4F60;&#x4EEC;&#x80FD;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x98DF;&#x5802;&#x6765;&#x6765;&#x5F80;&#x5F80;&#x4E0A;&#x767E;&#x53F7;&#x4EBA;&#xFF0C;&#x6E05;&#x4E00;&#x8272;&#x7684;&#x7070;&#x8272;&#xFF0C;&#x9ED1;&#x8272;&#x8B66;&#x670D;&#x3002;&#x5C31;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x7A7F;&#x4E2A;&#x4FBF;&#x88C5;&#x7684;&#x611F;&#x89C9;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x5E73;&#x65F6;&#x80AF;&#x5B9A;&#x4E5F;&#x6709;&#x7A7F;&#x4FBF;&#x88C5;&#x7684;&#xFF0C;&#x6211;&#x60F3;&#x3002;&#x4F46;&#x662F;&#x90A3;&#x5929;&#xFF0C;&#x6211;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#xFF0C;&#x9664;&#x4E86;&#x53A8;&#x623F;&#x91CC;&#x9762;&#x7684;&#x5E08;&#x5085;&#x3002;&#x5916;&#x9762;&#x5C31;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x7A7F;&#x4FBF;&#x88C5;&#x3002;<br>&#x3000;&#x3000;&#x800C;&#x4E14;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x7537;&#x8B66;&#x5BDF;&#xFF0C;&#x5927;&#x5BB6;&#x90A3;&#x5929;&#x5403;&#x996D;&#x90FD;&#x628A;&#x6211;&#x5F53;&#x8C03;&#x5473;&#x54C1;&#x4E86;&#x3002;&#x6211;&#x60F3;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x548C;&#x5979;&#x4EEC;&#x4E00;&#x4E2A;&#x5973;&#x8B66;&#x5BDF;&#x9762;&#x5BF9;&#x9762;&#x5EA7;&#x7740;&#x3002;&#x7537;&#x8B66;&#x5BDF;&#x5C31;&#x770B;&#x6211;&#x3002;&#x8138;&#x4E0A;&#x6709;&#x70B9;&#x654C;&#x610F;&#x3002;&#x5973;&#x8B66;&#x5BDF;&#x5C31;&#x8DDF;&#x6797;&#x8B66;&#x5B98;&#x6324;&#x7709;&#x5F04;&#x773C;&#x7684;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x3002;<br>&#x3000;&#x3000;&#x65E9;&#x77E5;&#x9053;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6253;&#x6B7B;&#x6211;&#x4E5F;&#x4E0D;&#x4F1A;&#x6765;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#xFF0C;&#x6765;&#x5C31;&#x6765;&#x4E86;&#x3002;&#x6211;&#x57CB;&#x7740;&#x5934;&#xFF0C;&#x60F3;&#x5FEB;&#x70B9;&#x628A;&#x996D;&#x6252;&#x5B8C;&#xFF0C;&#x597D;&#x5FEB;&#x70B9;&#x9003;&#x8DD1;&#x3002;&#x8FD9;&#x4E2A;&#x6ECB;&#x5473;&#x771F;&#x662F;&#x96BE;&#x53D7;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x9A6C;&#x4E0A;&#x5C31;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x884C;&#x5440;&#x3002;&#x4F60;&#x60F3;&#x5440;&#xFF0C;&#x4F60;&#x5728;&#x4E0A;&#x767E;&#x53F7;&#x4EBA;&#x7684;&#x98DF;&#x5802;&#x4F60;&#x9762;&#x8D77;&#x8EAB;&#xFF0C;&#x8D70;&#x51FA;&#x95E8;&#x53E3;&#xFF0C;&#x7ECF;&#x8FC7;&#x5F88;&#x591A;&#x684C;&#x5B50;&#x3002;&#x7136;&#x540E;&#x63A5;&#x53D7;&#x5927;&#x5BB6;&#x76EE;&#x5149;&#x7684;&#x6D17;&#x793C;&#xFF0C;&#x66F4;&#x60E8;&#x5440;&#x3002;&#x552F;&#x4E00;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x8BA9;&#x4ED6;&#x4EEC;&#x5148;&#x8D70;&#x5440;&#xFF0C;&#x6211;&#x53CD;&#x6B63;&#x6709;&#x65F6;&#x95F4;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x4E0D;&#x52A8;&#x3002;&#x5475;&#x5475;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x9A6C;&#x4E0A;&#x5403;&#x996D;&#x6539;&#x6210;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x5403;&#xFF0C;&#x6BD4;&#x5927;&#x5B66;&#x7684;&#x5973;&#x751F;&#x5403;&#x996D;&#x8FD8;&#x8981;&#x79C0;&#x6C14;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x4E5F;&#x8BB8;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x591A;&#x60F3;&#xFF0C;&#x4EBA;&#x5BB6;&#x4E5F;&#x8BB8;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x628A;&#x6211;&#x5F53;&#x56DE;&#x4E8B;&#x3002;&#x53CD;&#x6B63;&#xFF0C;&#x6211;&#x5C31;&#x662F;&#x4E0D;&#x81EA;&#x5728;&#x3002;<br>&#x3000;&#x3000;&#x5BF9;&#x4E86;&#xFF0C;&#x90A3;&#x5929;&#x5403;&#x4EC0;&#x4E48;&#x62C9;&#xFF1F;&#x9760;&#xFF0C;&#x8FD8;&#x771F;&#x7684;&#x6CA1;&#x600E;&#x4E48;&#x6CE8;&#x610F;&#x3002;&#x597D;&#x50CF;&#x662F;&#x4E2A;&#x7C89;&#x84B8;&#x8089;&#xFF0C;&#x8FD8;&#x6709;&#x4E2A;&#x9E21;&#x86CB;&#x6C64;&#xFF0C;&#x8FD8;&#x6709;&#x4E2A;&#x9C7C;&#x9999;&#x8089;&#x4E1D;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x771F;&#x7684;&#x6CA1;&#x5370;&#x8C61;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5473;&#x9053;&#x561B;&#xFF0C;&#x6655;&#xFF0C;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x54C1;&#x51FA;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x4E0D;&#x8BB0;&#x5F97;&#x548C;&#x5C0F;&#x6797;&#x8BF4;&#x8FC7;&#x4EC0;&#x4E48;&#x4EC0;&#x4E48;&#x8BDD;&#x4E86;&#x3002;&#x53CD;&#x6B63;&#x5C31;&#x662F;&#x6709;&#x4E00;&#x53E5;&#x6CA1;&#x4E00;&#x53E5;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x6797;&#x5F88;&#x65E9;&#x5C31;&#x5403;&#x5B8C;&#x4E86;&#x3002;&#x5C31;&#x770B;&#x7740;&#x6211;&#x5403;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x60F3;&#x6211;&#x5F53;&#x65F6;&#x7684;&#x6837;&#x5B50;&#x5F88;&#x597D;&#x7B11;&#x3002;&#x4E00;&#x8FB9;&#x5403;&#xFF0C;&#x773C;&#x775B;&#x8FD8;&#x8981;&#x560C;&#x5176;&#x4ED6;&#x4EBA;&#x8D70;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x6CA1;&#x6709;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x53EA;&#x662F;&#x8BB0;&#x5F97;&#x5F53;&#x65F6;&#x6211;&#x95EE;&#x4E86;&#x4E00;&#x53E5;&#x975E;&#x5E38;&#x597D;&#x7B11;&#x7684;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8BF4;&#xFF1A;&#x201C;&#x516C;&#x5B89;&#x5C40;&#x4E0D;&#x662F;&#x4E5F;&#x6709;&#x4FBF;&#x8863;&#x8B66;&#x5BDF;&#x5417;&#xFF1F;&#x600E;&#x4E48;&#x4ECA;&#x5929;&#x90FD;&#x662F;&#x7A7F;&#x5236;&#x670D;&#x7684;&#xFF1F;&#x201D;<br>&#x3000;&#x3000;&#x5F53;&#x65F6;&#x5C0F;&#x6797;&#x5C31;&#x7B11;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8FD9;&#x91CC;&#x662F;&#x529E;&#x516C;&#x5927;&#x697C;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x51FA;&#x52E4;&#x7684;&#x3002;&#x5F53;&#x7136;&#x4E0D;&#x4F1A;&#x7A7F;&#x4FBF;&#x8863;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x7B49;&#x5230;&#x770B;&#x5230;&#x4EBA;&#x8D70;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#x3002;&#x6211;&#x4EE5;&#x8BA9;&#x5C0F;&#x6797;&#x773C;&#x775B;&#x90FD;&#x7741;&#x5706;&#x4E86;&#x7684;&#x901F;&#x5EA6;&#x6252;&#x5B8C;&#x996D;&#xFF0C;&#x7ACB;&#x523B;&#x8BF4;&#x58F0;&#x8D70;&#xFF0C;&#x5C31;&#x8DD1;&#x51FA;&#x98DF;&#x5802;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5230;&#x516C;&#x5B89;&#x5C40;&#x5927;&#x95E8;&#x53E3;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4E00;&#x8EAB;&#x8F7B;&#x677E;&#x3002;&#x7A81;&#x7136;&#x89C9;&#x5F97;&#x81EA;&#x7531;&#x7684;&#x7A7A;&#x6C14;&#x591A;&#x4E48;&#x7684;&#x597D;&#x3002;&#x6655;&#xFF0C;&#x53C8;&#x4E0D;&#x662F;&#x5750;&#x7262;&#xFF0C;&#x4EC0;&#x4E48;&#x81EA;&#x7531;&#x90FD;&#x51FA;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x53CD;&#x6B63;&#x5F53;&#x65F6;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x662F;&#x597D;&#x3002;<br>&#x3000;&#x3000;&#x5728;&#x5C0F;&#x6797;&#x8B66;&#x5B98;&#x7684;&#x201C;&#x62A4;&#x9001;&#x201D;&#x4E0B;&#xFF0C;&#x6211;&#x56DE;&#x5230;&#x4E86;&#x5355;&#x4F4D;&#x3002;&#x4E0B;&#x4E86;&#x8B66;&#x8F66;&#xFF0C;&#x5927;&#x6447;&#x5927;&#x6446;&#x7684;&#x5411;&#x5927;&#x95E8;&#x8D70;&#x53BB;&#x3002;&#x771F;&#x6B63;&#x7684;&#x62AC;&#x5934;&#x633A;&#x80F8;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x4E2A;&#x95E8;&#x536B;&#x663E;&#x7136;&#x8BA4;&#x51FA;&#x4E86;&#x6211;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x8F86;&#x8B66;&#x8F66;&#x5E94;&#x8BE5;&#x4F1A;&#x5524;&#x8D77;&#x4ED6;&#x7684;&#x56DE;&#x5FC6;&#xFF0C;&#x90A3;&#x4E2A;&#x5B59;&#x5B50;&#x5C31;&#x662F;&#x8BE7;&#x5F02;&#x7684;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x4E00;&#x53E5;&#x8BDD;&#x90FD;&#x6CA1;&#x8BF4;&#x5440;&#xFF0C;&#x5C45;&#x7136;&#x8FD8;&#x662F;&#x6CA1;&#x95EE;&#x6211;&#x8981;&#x51FA;&#x5165;&#x8BC1;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x540E;&#x6765;&#xFF0C;&#x51E1;&#x662F;&#x90A3;&#x4E2A;&#x4FDD;&#x5B89;&#x503C;&#x73ED;&#xFF0C;&#x5C31;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x95EE;&#x6211;&#x8981;&#x8FC7;&#x51FA;&#x5165;&#x8BC1;&#x3002;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x3002;&#x5C31;&#x662F;&#x4E0D;&#x95EE;&#x6211;&#x8981;&#x3002;<br>&#x3000;&#x3000;&#x56DE;&#x5230;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x81EA;&#x7136;&#x5C11;&#x4E0D;&#x4E86;&#x54E5;&#x4EEC;&#x7684;&#x4E00;&#x987F;&#x5BA1;&#x95EE;&#x3002;&#x8FDE;&#x6211;&#x4EEC;&#x529E;&#x516C;&#x5BA4;&#x7684;&#x674E;&#x5A9B;&#x5A9B;&#x90FD;&#x6765;&#x51D1;&#x70ED;&#x95F9;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5C31;&#x8BF4;&#xFF1A;&#x201C;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x7F8E;&#x5973;&#x597D;&#x591A;&#x5440;&#xFF0C;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x4F19;&#x98DF;&#x771F;&#x4ED6;&#x5988;&#x597D;&#x5440;&#xFF0C;&#x516C;&#x5B89;&#x5C40;&#x7684;&#x8BBE;&#x5907;&#x771F;&#x4ED6;&#x5976;&#x5976;&#x9AD8;&#x7EA7;&#x5440;&#x3002;&quot;&#x5176;&#x5B9E;&#x9664;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x70B9;&#x6211;&#x8BF4;&#x7684;&#x771F;&#x8BDD;&#xFF0C;&#x5176;&#x4ED6;&#x90FD;&#x662F;&#x9017;&#x4ED6;&#x4EEC;&#x73A9;&#x513F;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x8BF4;&#x7684;&#x51E0;&#x4E2A;&#x54E5;&#x4EEC;&#x53E3;&#x6C34;&#x90FD;&#x6D41;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x90FD;&#x8BF4;&#xFF0C;&#x7ED9;&#x6211;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x600E;&#x4E48;&#x6837;&#x3002;<br>&#x3000;&#x3000;&#x8BF4;&#x7684;&#x674E;&#x5A9B;&#x5A9B;&#x76F4;&#x63A5;&#x7B11;&#x9A82;&#x5176;&#x4ED6;&#x54E5;&#x4EEC;&#x8272;&#x9B3C;&#x4E91;&#x4E91;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x6253;&#x95F9;&#x4E00;&#x756A;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x4F5C;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5176;&#x5B9E;&#x4E00;&#x76F4;&#x5C31;&#x5728;&#x60E6;&#x8BB0;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x5BC6;&#x7801;&#x3002;&#x73B0;&#x5728;&#x9759;&#x4E0B;&#x5FC3;&#x6765;&#x3002;&#x770B;&#x5230;&#x7F51;&#x7EDC;&#x7684;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x8FD8;&#x662F;10k&#x5DE6;&#x53F3;&#x3002;&#x6211;&#x7684;&#x6C14;&#x5C31;&#x4E0D;&#x6253;&#x4E00;&#x51FA;&#x6765;&#x3002;&#x4F60;&#x4E0D;&#x4EC1;&#xFF0C;&#x522B;&#x602A;&#x6211;&#x4E0D;&#x4E49;&#x4E86;&#x3002;&#x5C11;&#x4E0D;&#x5F97;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x4F7F;&#x70B9;&#x5351;&#x9119;&#x624B;&#x6BB5;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x9ED1;&#x5BA2;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#x4F5C;&#x54C1;&#x8868;&#x73B0;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#x3002;&#x4E00;&#x4E2A;&#x8FDE;&#x670D;&#x52A1;&#x90FD;&#x4E0D;&#x5F00;&#xFF0C;&#x8FDE;&#x5916;&#x6765;&#x8FDE;&#x63A5;&#x7684;&#x90FD;&#x7981;&#x6B62;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x6709;&#x5929;&#x5927;&#x7684;&#x672C;&#x4E8B;&#xFF0C;&#x4F60;&#x53C8;&#x80FD;&#x5982;&#x4F55;&#xFF1F;&#x7F51;&#x7EDC;&#x9ED1;&#x5BA2;&#xFF0C;&#x4F60;&#x518D;&#x5389;&#x5BB3;&#xFF0C;&#x4F60;&#x4E5F;&#x5FC5;&#x987B;&#x9075;&#x5B88;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x534F;&#x8BAE;&#xFF0C;&#x4F60;&#x4E5F;&#x5FC5;&#x987B;&#x8981;&#x548C;&#x5BF9;&#x65B9;&#x673A;&#x5668;&#x901A;&#x8BAF;&#x3002;&#x8BB0;&#x5F97;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x4E3A;&#x4E86;&#x8868;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5B89;&#x5168;&#x6027;&#x597D;&#xFF0C;&#x5C45;&#x7136;&#x60AC;&#x8D4F;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x3002;&#x53EF;&#x662F;&#x5927;&#x5BB6;&#x626B;&#x63CF;&#x4E00;&#x770B;&#x3002;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x901A;&#x561B;&#xFF0C;&#x8FDE;&#x63A5;&#x4E5F;&#x65E0;&#x6CD5;&#x5EFA;&#x7ACB;&#x3002;&#x670D;&#x52A1;&#x4E5F;&#x6CA1;&#x5F00;&#xFF0C;&#x4F60;&#x8BF4;&#x8FD9;&#x4E0D;&#x662F;&#x9A97;&#x4EBA;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x653B;&#x51FB;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x548C;&#x653B;&#x51FB;&#x4E00;&#x4E2A;&#x9632;&#x5907;&#x5B8C;&#x5584;&#x7684;&#x4E2A;&#x4EBA;&#x673A;&#x5668;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x540E;&#x8005;&#x66F4;&#x96BE;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x60F3;&#x4E0D;&#x901A;&#x3002;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4ED6;&#x65E0;&#x8BBA;&#x9632;&#x5907;&#x591A;&#x5B8C;&#x5584;&#xFF0C;&#x4ED6;&#x5FC5;&#x987B;&#x8981;&#x8003;&#x8651;&#x7528;&#x6237;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x6BD4;&#x5982;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x4FBF;&#x7A0B;&#x5EA6;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x6548;&#x7387;&#x7B49;&#x7B49;&#x3002;&#x4ED6;&#x5FC5;&#x987B;&#x8981;&#x5F00;&#x7AEF;&#x53E3;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x5141;&#x8BB8;&#x8FDE;&#x63A5;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x670D;&#x52A1;&#x5982;&#x4F55;&#x63D0;&#x4F9B;&#x3002;&#x53EA;&#x8981;&#x6709;&#x670D;&#x52A1;&#xFF0C;&#x53EA;&#x8981;&#x5141;&#x8BB8;&#x5916;&#x6765;&#x901A;&#x8BAF;&#x548C;&#x8FDE;&#x63A5;&#xFF0C;&#x5C31;&#x80AF;&#x5B9A;&#x6709;&#x6F0F;&#x6D1E;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#xFF0C;&#x670D;&#x52A1;&#x7A0B;&#x5E8F;&#x5C31;&#x6709;&#x3002;&#x53CD;&#x6B63;&#x8FDF;&#x65E9;&#x6709;&#x4EBA;&#x4F1A;&#x627E;&#x5230;&#x6F0F;&#x6D1E;&#x3002;&#x4F46;&#x662F;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x4E0D;&#x540C;&#x4E86;&#xFF0C;&#x4ED6;&#x53EA;&#x8003;&#x8651;&#x4ED6;&#x53BB;&#x8BBF;&#x95EE;&#x522B;&#x4EBA;&#xFF0C;&#x4ED6;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x8003;&#x8651;&#x8BA9;&#x522B;&#x4EBA;&#x8BBF;&#x95EE;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x5F00;&#x670D;&#x52A1;&#xFF0C;&#x7981;&#x6B62;&#x5916;&#x6765;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x51E0;&#x4E4E;&#x4E0D;&#x5F00;&#x591A;&#x4F59;&#x7684;&#x7AEF;&#x53E3;&#x3002;&#x8981;&#x653B;&#x7834;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x5668;&#x771F;&#x7684;&#x66F4;&#x96BE;&#x3002;&#x5F53;&#x7136;&#x90A3;&#x79CD;&#x8FDE;&#x5BC6;&#x7801;&#x90FD;&#x4E0D;&#x8BBE;&#x7F6E;&#x7684;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x518D;&#x6211;&#x8BA8;&#x8BBA;&#x7684;&#x8303;&#x56F4;&#x3002;</p>
<p>&#x80E1;&#x961F;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9632;&#x5907;&#x4E25;&#x5BC6;&#x7684;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x80E1;&#x961F;&#x957F;&#x5728;&#x7F51;&#x7EDC;&#x65B9;&#x9762;&#x867D;&#x7136;&#x4E0D;&#x6DF1;&#x5165;&#x61C2;&#x539F;&#x7406;&#xFF0C;&#x4F60;&#x53EB;&#x4ED6;&#x7F16;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x7F51;&#x7EDC;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ED6;&#x80AF;&#x5B9A;&#x6CA1;&#x620F;&#xFF0C;&#x4F46;&#x662F;&#x7F51;&#x7EDC;&#x64CD;&#x4F5C;&#xFF0C;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#x548C;&#x9632;&#x62A4;&#xFF0C;&#x4ED6;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x83DC;&#x9E1F;&#x3002;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x9AD8;&#x624B;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x5355;&#x4F4D;&#x5BF9;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x7F51;&#x7EDC;&#x90E8;&#x4E3B;&#x4EFB;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x626B;&#x63CF;&#x4E5F;&#x4E0D;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x54E5;&#x4EEC;&#xFF0C;&#x5E73;&#x65F6;&#x4E5F;&#x7ECF;&#x5E38;&#x62FF;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4F5C;&#x4F5C;&#x8BD5;&#x9A8C;&#x3002;<br>&#x3000;&#x3000;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x4E3A;&#x4E86;&#x663E;&#x793A;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x9632;&#x62A4;&#x4E25;&#x5BC6;&#xFF0C;&#x8FD8;&#x4F1A;&#x4F5C;&#x51FA;&#x56DE;&#x5E94;&#x3002;&#x8BB0;&#x5F97;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x626B;&#x4ED6;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4ED6;&#x5C31;&#x53D1;&#x73B0;&#x4E86;&#x3002;&#x4F7F;&#x7528;windows&#x7684;&#x4FE1;&#x4F7F;&#x670D;&#x52A1;&#x7ED9;&#x6211;&#x53D1;&#x4E86;&#x4E2A;&#x6D88;&#x606F;&#xFF1A;&#x201C;&#x4E0D;&#x8981;&#x653B;&#x51FB;&#x6211;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#xFF01;&#x201D;&#x6211;&#x56DE;&#x201C;&#x6211;&#x53EA;&#x662F;&#x68C0;&#x9A8C;&#x4E00;&#x4E0B;&#x5B89;&#x5168;&#x6027;&#x3002;&#x6211;&#x6CA1;&#x6709;&#x653B;&#x51FB;&#x201D;&#x3002;&#x540E;&#x6765;&#x53EF;&#x80FD;&#x626B;&#x63CF;&#x4ED6;&#x7684;&#x4EBA;&#x591A;&#x4E86;&#x3002;&#x90A3;&#x4E2A;&#x5BB6;&#x4F19;&#x4E5F;&#x5C31;&#x9EBB;&#x6728;&#x4E86;&#x3002;&#x540C;&#x65F6;&#x53EF;&#x80FD;&#x4E5F;&#x89C9;&#x5F97;&#x6BD4;&#x8F83;&#x5B89;&#x5168;&#x4E86;&#x3002;&#x518D;&#x4E5F;&#x4E0D;&#x4F1A;&#x901A;&#x8FC7;&#x4EC0;&#x4E48;&#x4FE1;&#x4F7F;&#x670D;&#x52A1;&#x7ED9;&#x4EBA;&#x5BB6;&#x53D1;&#x6D88;&#x606F;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;windows&#x5B89;&#x5168;&#x6027;&#x4E0D;&#x597D;&#x3002;&#x6211;&#x5230;&#x6709;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x770B;&#x6CD5;&#x3002;&#x5176;&#x5B9E;windows&#x5B89;&#x5168;&#x6027;&#x4E0D;&#x597D;&#x5927;&#x90E8;&#x5206;&#x51FA;&#x5728;&#x90A3;&#x4E2A;&#x9B3C;IIS&#x4E0A;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x4E0D;&#x5B89;&#x5168;&#x4E0A;&#x3002;windows&#x771F;&#x6B63;&#x914D;&#x7F6E;&#x597D;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5927;&#x5BB6;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x4E0D;&#x5B89;&#x5168;&#x3002;&#x90A3;&#x4E2A;IIS&#x6211;&#x662F;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x5927;&#x5BB6;&#x4E0D;&#x7528;&#x7684;&#x3002;&#x4ED6;&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x7684;&#x6700;&#x5927;&#x4EA7;&#x751F;&#x8005;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;windows&#x7684;IPC$&#x7A7A;&#x8FDE;&#x63A5;&#x3002;&#x4E5F;&#x662F;&#x9ED1;&#x5BA2;&#x7684;&#x7A81;&#x7834;&#x7EBF;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;windows&#x7684;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x95EE;&#x9898;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6709;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x7684;&#x3002;&#x4F46;&#x662F;MS&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x786E;&#x5B9E;&#x8BA9;&#x6211;&#x9119;&#x89C6;&#x7684;&#x3002;&#x4ED6;&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#xFF0C;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x57FA;&#x672C;&#x5168;&#x90E8;&#x5B58;&#x5728;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x653B;&#x51FB;&#x4E00;&#x53F0;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x7684;windows&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x51E1;&#x662F;&#x61C2;&#x4E00;&#x70B9;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x653B;&#x4E0D;&#x7834;&#x7684;&#x3002;&#x8FD9;&#x70B9;&#x6211;&#x4EEC;&#x7684;unix&#x548C;linux&#x5C31;&#x597D;&#x4E86;&#x3002;linux&#x7CFB;&#x7EDF;&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x4E25;&#x683C;&#x7684;&#x3002;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x65E0;&#x6CD5;&#x8BA9;&#x4F60;&#x6709;&#x673A;&#x4F1A;&#x7684;&#x3002;window&#x6700;&#x5927;&#x7684;&#x5931;&#x8D25;&#x548C;&#x6700;&#x5927;&#x6210;&#x529F;&#x5C31;&#x662F;&#xFF1A;&#x7ED9;&#x7528;&#x6237;&#x9690;&#x85CF;&#x4E86;&#x592A;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x3002;<br>&#x3000;&#x3000;&#x5BF9;&#x4E13;&#x4E1A;&#x7528;&#x6237;&#xFF0C;&#x9690;&#x85CF;&#x592A;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x8BA1;&#x7B97;&#x673A;&#x5F00;&#x4E86;&#x90A3;&#x4E9B;&#x7AEF;&#x53E3;&#xFF0C;&#x8FD9;&#x4E9B;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x662F;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#x90FD;&#x9119;&#x89C6;MS&#x7684;&#x6839;&#x672C;&#x539F;&#x56E0;&#x3002;<br>&#x3000;&#x3000;&#x5BF9;&#x666E;&#x901A;&#x7528;&#x6237;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x79CD;&#x9690;&#x85CF;&#x975E;&#x5E38;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x5374;&#x57CB;&#x4E0B;&#x4E86;&#x592A;&#x591A;&#x7684;&#x6F0F;&#x6D1E;&#x3002;<br>&#x3000;&#x3000;unix&#x548C;linux&#x5C31;&#x8FD9;&#x70B9;&#x597D;&#x3002;&#x4F60;&#x5F00;&#x4E86;www&#xFF0C;&#x4F60;&#x626B;&#x63CF;&#xFF0C;&#x5C31;&#x53D1;&#x73B0;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x53EA;&#x5F00;&#x4E86;80&#x7AEF;&#x53E3;&#x3002;&#x6E05;&#x6E05;&#x695A;&#x695A;&#xFF0C;&#x660E;&#x660E;&#x767D;&#x767D;&#x3002;&#x7BA1;&#x7406;&#x5458;&#x5FC3;&#x4E2D;&#x6709;&#x5E95;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x670D;&#x52A1;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x89C9;&#x5F97;unix&#x548C;linux&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x4F18;&#x4E8E;windows&#x3002;&#x6211;&#x7684;&#x4E00;&#x4E2A;&#x54E5;&#x4EEC;&#x517C;&#x540C;&#x5B66;&#x8BF4;&#x7684;&#x597D;&#x3002;&#x4ED6;&#x8BF4;&#xFF1A;&#x201C;&#x5FAE;&#x8F6F;&#x662F;&#x5148;&#x8003;&#x8651;&#x6613;&#x7528;&#x548C;&#x529F;&#x80FD;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8003;&#x8651;&#x5B89;&#x5168;&#x3002;&#x800C;unix&#x548C;liunx&#x662F;&#x5148;&#x8003;&#x8651;&#x5B89;&#x5168;&#x548C;&#x7A33;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x8003;&#x8651;&#x6613;&#x7528;&#x3002;&#x201D;&#x6211;&#x4EE5;&#x4E3A;&#x4E00;&#x9488;&#x89C1;&#x8840;&#x3002;<br>&#x3000;&#x3000;&#x5F53;&#x7136;&#x5728;&#x4F5C;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;windows&#x662F;&#x6700;&#x6210;&#x529F;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x4E0D;&#x670D;&#x4E0D;&#x884C;&#x3002;MS&#x6709;&#x4ECA;&#x5929;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x5439;&#x51FA;&#x6765;&#x7684;&#x3002;&#x8FD8;&#x662F;&#x9760;&#x5B9E;&#x529B;&#x548C;&#x5E02;&#x573A;&#x7B56;&#x7565;&#x6253;&#x51FA;&#x6765;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7ECF;&#x8FC7;&#x7CBE;&#x5FC3;&#x4FEE;&#x6539;&#x7684;windows2000&#x7684;&#x673A;&#x5668;&#x3002;&#x800C;&#x4E14;&#x8FD8;&#x5B89;&#x88C5;&#x4E86;&#x75C5;&#x6BD2;&#x9632;&#x706B;&#x5899;&#x548C;&#x7F51;&#x7EDC;&#x9632;&#x706B;&#x5899;&#x3002;&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x65E0;&#x6CD5;&#x8FDB;&#x5165;&#x3002;&#x771F;&#x7684;&#x3002;&#x4ED6;&#x7684;&#x673A;&#x5668;&#x6240;&#x6709;&#x6F0F;&#x6D1E;&#x5168;&#x90E8;&#x8865;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x5F00;&#x4EFB;&#x4F55;&#x670D;&#x52A1;&#x3002;&#x7A7A;&#x8FDE;&#x63A5;&#x4E5F;&#x88AB;&#x7981;&#x6B62;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x60F3;&#x8BA9;&#x4ED6;&#x673A;&#x5668;&#x7BEE;&#x5C4F;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x6211;&#x60F3;&#x6216;&#x8BB8;&#x80FD;&#x505A;&#x5230;&#x3002;&#x4F46;&#x662F;&#x60F3;&#x8FDB;&#x5165;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5B89;&#x88C5;&#x4E2A;&#x540E;&#x95E8;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x6211;&#x771F;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#x3002;<br>&#x3000;&#x3000;&#x9ED1;&#x5BA2;&#x5C31;&#x548C;&#x9B54;&#x672F;&#x5E08;&#x4E00;&#x6837;&#xFF0C;&#x5916;&#x4EBA;&#x770B;&#x8D77;&#x6765;&#x89C9;&#x5F97;&#x5F88;&#x795E;&#x5947;&#xFF0C;&#x4F46;&#x662F;&#x628A;&#x8C1C;&#x5E95;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x5176;&#x5B9E;&#x7528;&#x7684;&#x90FD;&#x662F;&#x4E9B;&#x5927;&#x5BB6;&#x77E5;&#x9053;&#x7684;&#x539F;&#x7406;&#x3002;&#x6CA1;&#x4EC0;&#x4E48;&#x795E;&#x5947;&#x7684;&#x3002;&#x9ED1;&#x5BA2;&#x548C;&#x9B54;&#x672F;&#x5E08;&#x90FD;&#x662F;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x795E;&#x3002;<br>&#x3000;&#x3000;&#x81F3;&#x4E8E;&#x5230;&#x7F51;&#x7EDC;&#x90E8;&#xFF0C;&#x5927;&#x6447;&#x6253;&#x6446;&#xFF0C;&#x8D81;&#x80E1;&#x961F;&#x957F;&#x4E0D;&#x5728;&#xFF0C;&#x7ED9;&#x4ED6;&#x5B89;&#x4E2A;&#x540E;&#x95E8;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x4E5F;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x3002;&#x4F46;&#x662F;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x5F88;&#x5FEB;&#x88AB;&#x53D1;&#x73B0;&#x3002;&#x88AB;&#x53D1;&#x73B0;&#x4E86;&#x3002;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x4E86;&#x3002;&#x4ED6;&#x53C8;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x4ED6;&#x91CD;&#x88C5;&#x4E86;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x770B;&#x4F60;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x51B5;&#x4E14;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x6709;&#x70B9;&#x4E0D;&#x9F7F;&#xFF0C;&#x4F60;&#x8FD8;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x7528;&#x67AA;&#x6307;&#x7740;&#x4ED6;&#x7684;&#x5934;&#xFF0C;&#x53EB;&#x4ED6;&#x4EA4;&#x51FA;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x60F3;&#x4ED6;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E0D;&#x4EA4;&#xFF0C;&#x5475;&#x5475;&#x3002;</p>
<p>&#x6211;&#x7279;&#x522B;&#x70E6;&#x4E00;&#x4E9B;&#x767D;&#x75F4;&#x4F5C;&#x8005;&#x548C;&#x767D;&#x75F4;&#x5BFC;&#x6F14;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x5FC3;&#x4E2D;&#x6811;&#x7ACB;&#x7684;&#x9ED1;&#x5BA2;&#x5F62;&#x8C61;&#x3002;&#x4ED6;&#x4EEC;&#x603B;&#x662F;&#x80FD;&#x60F3;&#x8FDB;&#x5165;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x5C31;&#x80FD;&#x8FDB;&#x5165;&#x3002;&#x60F3;&#x83B7;&#x5F97;&#x4EC0;&#x4E48;&#x8D44;&#x6599;&#x5C31;&#x80FD;&#x83B7;&#x5F97;&#x8D44;&#x6599;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x601D;&#x7EF4;&#x7684;&#x5C31;&#x662F;&#xFF1A;&#x61C2;&#x4E00;&#x70B9;&#x7684;&#xFF0C;&#x662F;&#x6709;&#x7F51;&#x7EDC;&#xFF1D;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#xFF1D;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4E00;&#x5207;&#x3002;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x66F4;&#x767D;&#x75F4;&#x7684;&#x3002;&#x4E0D;&#x7BA1;&#x6709;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#xFF1D;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#xFF1D;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x4E00;&#x5207;&#x3002;&#x751A;&#x81F3;&#x8BA9;&#x5BF9;&#x65B9;&#x8BA1;&#x7B97;&#x673A;&#x5192;&#x70DF;&#x548C;&#x7206;&#x70B8;&#x7684;&#x90FD;&#x6709;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x6C14;&#x7684;&#x90FD;&#x53EA;&#x597D;&#x7B11;&#x3002;&#x8FD9;&#x4E9B;&#x767D;&#x75F4;&#x7684;&#x60F3;&#x8C61;&#x529B;&#x786E;&#x5B9E;&#x4E0D;&#x662F;&#x5439;&#x7684;&#x3002;&#x4EC0;&#x4E48;&#x628A;&#x4EBA;&#x5BB6;&#x7684;&#x5E10;&#x8F6C;&#x5230;&#x522B;&#x4EBA;&#x5E10;&#x53F7;&#x4E0A;&#x5440;&#x3002;&#x4EC0;&#x4E48;&#x5077;&#x519B;&#x65B9;&#x6700;&#x65B0;&#x7684;&#x8D44;&#x6599;&#x62C9;&#x3002;&#x7B49;&#x7B49;&#x3002;&#x751A;&#x81F3;&#x4F0A;&#x62C9;&#x514B;&#x90FD;&#x662F;&#x9ED1;&#x5BA2;&#x7684;&#x529F;&#x52B3;&#x7B49;&#x7B49;&#x3002;&#x5168;&#x4ED6;&#x5988;&#x7684;&#x653E;&#x5C41;&#xFF01;<br>&#x3000;&#x3000;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x54EA;&#x4E2A;&#x9ED1;&#x5BA2;&#x662F;&#x901A;&#x8FC7;&#x9ED1;&#x5BA2;&#x624B;&#x6BB5;&#x53D1;&#x4E86;&#x8D22;&#x7684;&#xFF1F;&#x53CD;&#x6B63;&#x6211;&#x6653;&#x5F97;&#x6CA1;&#x6709;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x53EA;&#x662F;&#x77E5;&#x9053;&#x5F88;&#x591A;&#x9ED1;&#x5BA2;&#x6D3B;&#x7684;&#x5176;&#x5B9E;&#x6BD4;&#x8F83;&#x60E8;&#x3002;&#x6211;&#x53EA;&#x662F;&#x77E5;&#x9053;&#x597D;&#x7684;&#x9ED1;&#x5BA2;&#x6700;&#x540E;&#x90FD;&#x662F;&#x5B89;&#x5168;&#x987E;&#x95EE;&#x6216;&#x8005;&#x5B89;&#x5168;&#x4E13;&#x5BB6;&#x4F5C;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x5F52;&#x5BBF;&#x3002;<br>&#x3000;&#x3000;&#x8BF4;&#x7A7F;&#x4E86;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6CE1;&#x6CAB;&#xFF0C;&#x4ED6;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x76F4;&#x63A5;&#x521B;&#x9020;&#x8D22;&#x5BCC;&#x3002;&#x5728;&#x6253;&#x4ED7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x5403;&#x996D;&#x90FD;&#x5403;&#x4E0D;&#x9971;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED6;&#x7EDD;&#x5BF9;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x662F;&#x3002;&#x4ED6;&#x5C31;&#x662F;&#x4E00;&#x5806;&#x5E9F;&#x94C1;&#x3002;<br>&#x3000;&#x3000;&#x7F51;&#x7EDC;&#x5B9E;&#x9645;&#x6709;&#x5F88;&#x591A;&#x9650;&#x5236;&#x7684;&#x3002;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x600E;&#x4E48;&#x6837;&#x5C31;&#x600E;&#x4E48;&#x6837;&#x3002;&#x5373;&#x4F7F;&#x5C31;&#x662F;&#x6559;&#x4F60;&#x81EA;&#x5DF1;&#x53BB;&#x5B89;&#x88C5;&#x8C03;&#x8BD5;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x90FD;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x7684;&#x6545;&#x969C;&#x3002;&#x4F55;&#x51B5;&#x5728;&#x6BEB;&#x65E0;&#x6388;&#x6743;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x54EA;&#x91CC;&#x662F;&#x4F60;&#x60F3;&#x600E;&#x4E48;&#x4F5C;&#x5C31;&#x80FD;&#x4F5C;&#x7684;&#xFF1F;<br>&#x3000;&#x3000;&#x4F60;&#x771F;&#x4EE5;&#x4E3A;&#x90A3;&#x4E9B;&#x7F51;&#x7EDC;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#xFF0C;&#x4F60;&#x771F;&#x4EE5;&#x4E3A;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#x5458;&#x662F;&#x767D;&#x75F4;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#xFF0C;&#x6211;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x624D;&#x662F;&#x4E2A;&#x767D;&#x75F4;&#x3002;<br>&#x3000;&#x3000;&#x4F60;&#x771F;&#x4EE5;&#x4E3A;&#x94F6;&#x884C;&#x7684;&#x7684;&#x7EF4;&#x62A4;&#x4EBA;&#x5458;&#xFF0C;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x65B9;&#x6848;&#x7684;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x662F;&#x767D;&#x75F4;&#xFF0C;&#x4F60;&#x60F3;&#x8F6C;&#x5E10;&#x5C31;&#x8F6C;&#xFF0C;&#x4F60;&#x60F3;&#x62B9;&#x6570;&#x636E;&#x5C31;&#x62B9;&#xFF1F;&#x4F60;&#x60F3;&#x8BA9;&#x4EBA;&#x5BB6;&#x762B;&#x75EA;&#x5C31;&#x762B;&#x75EA;&#xFF1F;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x8005;&#x90FD;&#x662F;&#x90A3;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x4E13;&#x5BB6;&#x3002;&#x4EBA;&#x5BB6;&#x4E00;&#x8F88;&#x5B50;&#x7814;&#x7A76;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8BA9;&#x4F60;&#x8FD9;&#x4E9B;&#x8BF4;&#x7A7F;&#x4E86;&#x5C31;&#x662F;&#x94BB;&#x70B9;&#x6F0F;&#x6D1E;&#xFF0C;&#x6700;&#x591A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8C03;&#x8BD5;&#x4E13;&#x5BB6;&#x7684;&#x4EBA;&#x9ED1;&#x5BA2;&#x4EEC;&#x5C31;&#x8FD9;&#x4E48;&#x5BB9;&#x6613;&#x7834;&#x4E86;&#xFF1F;<br>&#x3000;&#x3000;&#x5373;&#x4F7F;&#x4F60;&#x8F6C;&#x5E10;&#x6210;&#x529F;&#x4E86;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x5220;&#x6570;&#x636E;&#x6210;&#x529F;&#x4E86;&#x3002;&#x6211;&#x8BF4;&#x7684;&#x5373;&#x4F7F;&#x3002;&#x53C8;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x94B1;&#x80FD;&#x5230;&#x4F60;&#x624B;&#x91CC;&#xFF1F;&#x4EBA;&#x5BB6;&#x7684;&#x5907;&#x4EFD;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EBA;&#x5BB6;&#x7684;&#x5DEE;&#x9519;&#x68C0;&#x67E5;&#x7CFB;&#x7EDF;&#x3002;&#x4EBA;&#x5BB6;&#x5BA1;&#x6838;&#x7CFB;&#x7EDF;&#x4F60;&#x4EE5;&#x4E3A;&#x771F;&#x662F;&#x6446;&#x8BBE;&#x5440;&#xFF1F;&#x4F60;&#x4EE5;&#x4E3A;&#x51E0;&#x5341;&#x4EBF;&#x8BF4;&#x8BA9;&#x4F60;&#x8F6C;&#x5C31;&#x8F6C;&#xFF1F;&#x7B80;&#x76F4;&#x7B11;&#x8BDD;&#x3002;&#x5929;&#x5927;&#x7684;&#x7B11;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x5C31;&#x662F;&#x9000;&#x4E00;&#x4E07;&#x90E8;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x6210;&#x529F;&#x4E86;&#x3002;&#x4EBA;&#x5BB6;&#x8FD8;&#x6709;&#x6700;&#x540E;&#x4E00;&#x62DB;&#x5462;&#xFF0C;&#x4EBA;&#x5BB6;&#x628A;&#x7F51;&#x7EBF;&#x7ED9;&#x4F60;&#x6252;&#x4E86;&#x3002;&#x4EBA;&#x5BB6;&#x4E0D;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x4E86;&#x3002;&#x4F60;&#x518D;&#x5389;&#x5BB3;&#xFF0C;&#x4F60;&#x80FD;&#x90FD;&#x6597;&#x7684;&#x8FC7;&#x4EBA;&#x5BB6;&#x4E3B;&#x4EBA;&#xFF1F;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x7684;&#x9ED1;&#x5BA2;&#x90FD;&#x662F;&#x94BB;&#x7A7A;&#x5B50;&#x800C;&#x5DF2;&#xFF0C;&#x90FD;&#x662F;&#x201C;&#x5077;&#x5077;&#x7684;&#x8FDB;&#x53BB;&#xFF0C;&#x6253;&#x67AA;&#x7684;&#x4E0D;&#x8981;&#x201D;&#x3002;&#x4F46;&#x662F;&#x88AB;&#x53D1;&#x73B0;&#x90A3;&#x662F;&#x8FDF;&#x65E9;&#x7684;&#x4E8B;&#x60C5;&#x3002;<br>&#x3000;&#x3000;&#x4F60;&#x89C1;&#x8FC7;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x7834;&#x4EA7;&#xFF0C;&#x505C;&#x6B62;&#x8425;&#x4E1A;&#x7684;&#x6CA1;&#x6709;&#x3002;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x561B;&#xFF1F;<br>&#x3000;&#x3000;&#x56E0;&#x4E3A;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x7684;&#x90FD;&#x662F;&#x7EDF;&#x4E00;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x6CA1;&#x4EC0;&#x4E48;&#x7A7A;&#x5B50;&#x53EF;&#x4EE5;&#x94BB;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x8FDB;&#x6765;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x63AA;&#x65BD;&#x7B49;&#x7740;&#x4F60;&#x5462;&#x3002;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x88AB;&#x53D1;&#x73B0;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x88AB;&#x7EA0;&#x6B63;&#x8FC7;&#x6765;&#x3002;&#x4F60;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x3002;&#x53EA;&#x8981;&#x91CD;&#x89C6;&#x4F60;&#xFF0C;&#x4F60;&#x662F;&#x4E00;&#x70B9;&#x529E;&#x6CD5;&#x4E5F;&#x6CA1;&#x6709;&#x3002;&#x5F88;&#x591A;&#x9ED1;&#x5BA2;&#x6210;&#x529F;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x5BF9;&#x65B9;&#x4E0D;&#x91CD;&#x89C6;&#xFF0C;&#x63AA;&#x65BD;&#x4E0D;&#x5F97;&#x529B;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x4E00;&#x822C;&#x4E5F;&#x5C31;&#x662F;&#x4E9B;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;<br>&#x3000;&#x3000;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5BF9;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x7684;&#x3002;&#x6CA1;&#x6709;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x3002;&#x4E0D;&#x6015;&#x4F60;&#x7B11;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x518D;&#x4E25;&#x5BC6;&#xFF0C;&#x5176;&#x4ED6;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x4E00;&#x5B9A;&#x4E25;&#x5BC6;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x90E8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x9664;&#x4E86;&#x7F51;&#x7EDC;&#x90E8;&#xFF0C;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x7684;server&#x57FA;&#x672C;&#x5168;&#x90E8;&#x88AB;&#x6211;&#x63A7;&#x5236;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x90FD;&#x4E0D;&#x662F;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x3002;&#x540E;&#x6765;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x4EBA;&#x6328;&#x4E2A;&#x90E8;&#x95E8;&#x6253;&#x8865;&#x4E01;&#xFF0C;&#x6539;&#x8BBE;&#x7F6E;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x5DF2;&#x7ECF;&#x665A;&#x4E86;&#x3002;&#x6211;&#x65E9;&#x5C31;&#x5B89;&#x4E86;&#x540E;&#x95E8;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4E00;&#x6837;&#x4E5F;&#x80FD;&#x8FDB;&#x5165;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7684;&#x540E;&#x95E8;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x3002;&#x77ED;&#x5C0F;&#x7CBE;&#x608D;&#x3002;&#x90FD;&#x662F;&#x76F4;&#x63A5;&#x63D2;&#x5165;&#x4EE3;&#x7801;&#x5230;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x7A7A;&#x95F4;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x901A;&#x8FC7;&#x8FDB;&#x7A0B;&#x67E5;&#x770B;&#x662F;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F02;&#x6837;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x75C5;&#x6BD2;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x75C5;&#x6BD2;&#x4E0D;&#x641E;&#x7834;&#x574F;&#xFF0C;&#x4E0D;&#x4F20;&#x67D3;&#x3002;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x4F5C;&#x6211;&#x7684;&#x5185;&#x5E94;&#x3002;&#x7531;&#x4E8E;windows&#x4E0B;&#x662F;&#x7531;&#x5B58;&#x50A8;&#x4FDD;&#x62A4;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#xFF0C;&#x4F60;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x6216;&#x8005;&#x8FDB;&#x7A0B;&#x6743;&#x9650;&#x4E0D;&#x591F;&#xFF0C;&#x4F60;&#x662F;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5176;&#x4ED6;&#x7A7A;&#x95F4;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x7559;&#x4E0B;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x4FEE;&#x6539;&#x4E86;windows&#x7684;&#x5185;&#x6838;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x8D77;&#x52A8;&#x5C31;&#x662F;0&#x7EA7;&#x6743;&#x5229;&#xFF0C;&#x5C31;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4E00;&#x822C;&#x7684;&#x4EBA;&#xFF0C;&#x6839;&#x672C;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x3002;&#x5C24;&#x5176;&#x662F;windows&#x7CFB;&#x7EDF;&#x5982;&#x6B64;&#x590D;&#x6742;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5176;&#x5B9E;&#x4E5F;&#x641E;&#x4E0D;&#x660E;&#x767D;&#x4EC0;&#x4E48;&#x662F;&#x8BE5;&#x6709;&#x7684;&#x4EC0;&#x4E48;&#x662F;&#x4E0D;&#x8BE5;&#x6709;&#x7684;&#x3002;&#x8981;&#x53D1;&#x73B0;&#x7B80;&#x76F4;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x3000;&#x4F46;&#x662F;&#x8981;&#x548C;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x901A;&#x8BAF;&#xFF0C;&#x7AEF;&#x53E3;&#x80AF;&#x5B9A;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x7528;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x4E00;&#x626B;&#xFF0C;&#x4E00;&#x822C;&#x4E5F;&#x80FD;&#x770B;&#x51FA;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x7AEF;&#x53E3;&#x3002;&#x6216;&#x8005;&#x7CFB;&#x7EDF;&#x672C;&#x6765;&#x6CA1;&#x6709;&#x5F00;&#x7684;&#x670D;&#x52A1;&#x600E;&#x4E48;&#x5F00;&#x4E86;&#x7B49;&#xFF1F;<br>&#x3000;&#x3000;&#x5BF9;&#x4ED8;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x66FE;&#x7ECF;&#x5E9F;&#x4E86;&#x6211;&#x5F88;&#x4E00;&#x6BB5;&#x8111;&#x7B4B;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#x6700;&#x540E;&#x6211;&#x8FD8;&#x662F;&#x60F3;&#x51FA;&#x4E00;&#x4E2A;&#x529E;&#x6CD5;&#x3002;&#x6210;&#x529F;&#x7684;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x7AEF;&#x53E3;&#x626B;&#x63CF;&#x5C31;&#x662F;&#x548C;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x6210;&#x529F;&#xFF0C;&#x8BF4;&#x660E;&#x7AEF;&#x53E3;&#x5F00;&#x53D1;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x5F00;&#x53D1;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x7531;&#x4E8E;&#x666E;&#x901A;&#x7684;&#x7F51;&#x7EDC;&#x7A0B;&#x5E8F;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x90FD;&#x662F;tcp/ip&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x7136;&#x4F60;&#x5F00;&#x4E86;&#x7AEF;&#x53E3;&#xFF0C;&#x7A0B;&#x5E8F;&#x90FD;&#x80FD;&#x8FDE;&#x63A5;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#x6211;&#x7684;&#x540E;&#x95E8;&#xFF0C;&#x6211;&#x62E6;&#x622A;&#x4E86;&#x8FDE;&#x63A5;&#x51FD;&#x6570;&#x3002;&#x5E76;&#x4E14;&#x62E6;&#x622A;&#x4E86;&#x6570;&#x636E;&#x5305;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5305;&#x4E0D;&#x662F;&#x6211;&#x7279;&#x6B8A;&#x7684;&#x6570;&#x636E;&#x3002;&#x6211;&#x5C31;&#x77E5;&#x9053;&#x662F;&#x666E;&#x901A;&#x7684;&#x626B;&#x63CF;&#x8F6F;&#x4EF6;&#x3002;&#x6211;&#x5C31;&#x4E0D;&#x54CD;&#x5E94;&#x3002;&#x4E8E;&#x662F;&#x5BF9;&#x65B9;&#x5C31;&#x8BA4;&#x4E3A;&#x6CA1;&#x6709;&#x5F00;&#x53D1;&#x8FD9;&#x4E2A;&#x7AEF;&#x53E3;&#x3002;<br>&#x3000;&#x3000;&#x5982;&#x679C;&#x662F;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x662F;&#x6709;&#x7279;&#x6B8A;&#x6570;&#x636E;&#x6807;&#x8BC6;&#x7684;&#x3002;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x54CD;&#x5E94;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E9B;&#x9053;&#x7406;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x77E5;&#x9053;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5B89;&#x88C5;&#x4E86;&#x540E;&#x95E8;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x54E5;&#x4EEC;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x5341;&#x516B;&#x822C;&#x6B66;&#x5668;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#xFF0C;&#x8FD8;&#x662F;&#x6CA1;&#x53D1;&#x73B0;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x3002;&#x4F46;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x5835;&#x4F4F;&#x4E86;&#x6F0F;&#x6D1E;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x59CB;&#x7EC8;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x8FDB;&#x53BB;&#x5B89;&#x540E;&#x95E8;&#x3002;<br>&#x3000;&#x3000;&#x73B0;&#x5728;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x673A;&#x5668;&#xFF0C;&#x770B;&#x80FD;&#x5426;&#x6709;&#x70B9;&#x4EC0;&#x4E48;&#x8FDB;&#x5C55;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x901B;&#xFF0C;&#x8FDB;&#x5165;&#x8BBE;&#x5907;&#x5904;&#x3002;<br>&#x3000;&#x3000;&#x5F39;&#x51FA;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#xFF0C;&#x8BF4;&#xFF1A;&#x8BF7;&#x5404;&#x90E8;&#x95E8;&#x8D1F;&#x8D23;&#x4EBA;&#x5230;&#x8BBE;&#x5907;&#x5904;&#x4E0B;&#x8F7D;&#x8BBE;&#x5907;&#x62A5;&#x8868;&#x751F;&#x6210;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C3D;&#x5FEB;&#x628A;&#x8BBE;&#x5907;&#x62A5;&#x8868;&#x63D0;&#x4EA4;&#x4E0A;&#x6765;&#x3002;&#x4E00;&#x770B;&#x65E5;&#x671F;&#xFF0C;&#x521A;&#x521A;&#x624D;&#x53D1;&#x51FA;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x7075;&#x5149;&#x4E00;&#x95EA;&#xFF0C;&#x8D76;&#x5FEB;&#x52A8;&#x624B;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x80AF;&#x5B9A;&#x4E5F;&#x662F;&#x8981;&#x4E0B;&#x8F7D;&#x7684;&#x3002;&#x5FC5;&#x987B;&#x6562;&#x5728;&#x4ED6;&#x7684;&#x524D;&#x9762;&#x52A8;&#x624B;&#x3002;<br>&#x3000;&#x3000;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x7684;&#x624B;&#x5F00;&#x59CB;&#x719F;&#x7EC3;&#x64CD;&#x4F5C;&#x952E;&#x76D8;&#xFF0C;&#x542F;&#x52A8;&#x6211;&#x7684;&#x8FDE;&#x63A5;&#x7A0B;&#x5E8F;&#x3002;&#x60F3;&#x8BBE;&#x5907;&#x5904;&#x7684;serve&#x8FDE;&#x63A5;&#x4E0A;&#x53BB;&#x3002;<br>&#x3000;&#x3000;&#x540E;&#x95E8;&#x8FD8;&#x5728;&#xFF0C;&#x8BBE;&#x5907;&#x5904;&#x90A3;&#x5E2E;&#x54E5;&#x4EEC;&#x6BD4;&#x8F83;&#x83DC;&#xFF0C;&#x6CA1;&#x4E8B;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x88C5;&#x670D;&#x52A1;&#x5668;&#x73A9;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x4F7F;&#x7528;&#x6211;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#x4E0A;&#x53BB;&#x3002;&#x53D1;&#x6307;&#x4EE4;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x5BF9;&#x719F;&#x624B;&#xFF0C;&#x5B57;&#x7B26;&#x754C;&#x9762;&#x7EDD;&#x5BF9;&#x662F;&#x6700;&#x5FEB;&#x7684;&#x3002;&#x6211;&#x59CB;&#x7EC8;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7684;&#x624B;&#x6307;&#x4E0D;&#x505C;&#x7FFB;&#x98DE;&#xFF0C;&#x719F;&#x6089;&#x7684;&#x627E;&#x5230;&#x90A3;&#x4E2A;&#x8BBE;&#x5907;&#x62A5;&#x8868;&#x751F;&#x6210;&#x7A0B;&#x5E8F;&#x7684;&#x76EE;&#x5F55;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x4E0B;&#x8F7D;&#x5230;&#x6211;&#x7684;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x628A;&#x6211;&#x7684;&#x540E;&#x95E8;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;exe&#x6346;&#x7ED1;&#x673A;&#x628A;&#x4ED6;&#x6253;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5F88;&#x5FEB;&#x628A;&#x670D;&#x52A1;&#x5668;&#x90A3;&#x4E2A;&#x66FF;&#x6362;&#x6210;&#x6211;&#x52A0;&#x4E2A;&#x5DE5;&#x7684;&#x3002;&#x6587;&#x4EF6;&#x7684;&#x5927;&#x5C0F;&#x5927;&#x4E86;100K&#x5DE6;&#x53F3;&#x3002;<br>&#x3000;&#x3000;&#x4E0D;&#x8FC7;&#xFF0C;&#x4EE5;&#x8BBE;&#x5907;&#x51FA;&#x90A3;&#x5E2E;&#x54E5;&#x4EEC;&#x7684;&#x6C34;&#x5E73;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7684;&#x6539;&#x53D8;&#x5F02;&#x5E38;&#x7684;&#x3002;</p>
<p>&#x6211;&#x8212;&#x4E86;&#x4E00;&#x53E3;&#x6C14;&#xFF0C;&#x9759;&#x9759;&#x7684;&#x5F00;&#x52A8;&#x6211;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5F00;&#x59CB;&#x626B;&#x63CF;&#x3002;&#x4F46;&#x613F;&#x80E1;&#x961F;&#x957F;&#x6CA1;&#x6709;&#x5728;&#x6211;&#x52A8;&#x624B;&#x811A;&#x4E4B;&#x524D;&#x4E0B;&#x8F7D;&#x3002;<br>&#x3000;&#x3000;&#x663E;&#x7136;&#x5404;&#x90E8;&#x95E8;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x901A;&#x77E5;&#xFF0C;&#x800C;&#x4E14;&#x4E0B;&#x8F7D;&#x8FD0;&#x884C;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x663E;&#x793A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x663E;&#x793A;&#x51FA;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x90E8;&#x95E8;&#x7684;ip&#x5206;&#x5E03;&#x6211;&#x662F;&#x5F88;&#x719F;&#x6089;&#x7684;&#x3002;&#x6211;&#x770B;&#x5230;&#x4E86;&#x8D22;&#x52A1;&#x5904;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E86;&#x540E;&#x52E4;&#x51FA;&#xFF0C;&#x6211;&#x8FD8;&#x770B;&#x5230;&#x5F88;&#x591A;&#x79D1;&#x5BA4;&#x548C;&#x90E8;&#x95E8;&#x7684;ip&#x3002;&#x4F46;&#x662F;&#x7F51;&#x7EDC;&#x90E8;&#x7684;ip&#x8FD8;&#x6CA1;&#x51FA;&#x73B0;&#x3002;<br>&#x3000;&#x3000;&#x96BE;&#x9053;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x52A8;&#x4F5C;&#x5982;&#x6B64;&#x5FEB;&#xFF1F;<br>&#x3000;&#x3000;&#x6211;&#x6B63;&#x60F3;&#x7740;&#xFF0C;&#x4E00;&#x4E2A;&#x719F;&#x6089;&#x7684;ip&#x8DF3;&#x51FA;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x80E1;&#x961F;&#x957F;&#x7684;ip&#xFF0C;&#x6211;&#x5DEE;&#x70B9;&#x7B11;&#x51FA;&#x4E86;&#x3002;</p>
<p>&#x72D7;&#x65E5;&#x7684;&#x80E1;&#x961F;&#x957F;&#xFF0C;&#x4F60;&#x518D;&#x806A;&#x660E;&#xFF0C;&#x4ECA;&#x5929;&#x4E5F;&#x7740;&#x4E86;&#x6211;&#x7684;&#x9053;&#x513F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x6015;&#x4F60;&#x4E2A;&#x7403;&#x5440;&#xFF0C;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4EE5;&#x540E;&#x5C31;&#x5728;&#x6211;&#x7684;&#x63A7;&#x5236;&#x4E4B;&#x4E2D;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x901A;&#x8FC7;&#x8FD9;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x767B;&#x9646;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x4F60;&#x7684;&#x5BC6;&#x7801;&#x8FD8;&#x8DD1;&#x7684;&#x4E86;&#xFF1F;<br>&#x3000;&#x3000;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x4E0A;&#x8DEF;&#x7531;&#x5668;&#x7EDD;&#x5BF9;&#x53EA;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x4F5C;&#x7684;&#x3002;&#x4ED6;&#x8FD9;&#x70B9;&#x5B89;&#x5168;&#x610F;&#x8BC6;&#x8FD8;&#x662F;&#x6709;&#x7684;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x770B;&#x5230;&#x80E1;&#x961F;&#x957F;&#x7684;ip&#x51FA;&#x73B0;&#x5728;&#x6211;&#x7684;&#x76D1;&#x89C6;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x4E86;&#x90A3;&#x4E2A;&#x5E26;&#x6709;&#x6211;&#x540E;&#x95E8;&#x7A0B;&#x5E8F;&#x7684;&#x7684;&#x62A5;&#x8868;&#x751F;&#x6210;&#x7A0B;&#x5E8F;&#x3002;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x5DF2;&#x7ECF;&#x5728;&#x4ED6;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x624E;&#x4E0B;&#x4E86;&#x6839;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x4FE1;&#x53F7;&#x8FC7;&#x53BB;&#xFF0C;&#x7ACB;&#x523B;&#x5F97;&#x5230;&#x4E86;&#x56DE;&#x5E94;&#x3002;&#x54C8;&#x54C8;&#xFF0C;&#x6CA1;&#x9519;&#x3002;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x751F;&#x6548;&#x679C;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x521A;&#x624D;&#x7ED9;&#x90A3;&#x4E2A;&#x62A5;&#x8868;&#x751F;&#x6210;&#x7A0B;&#x5E8F;&#x6253;&#x5305;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x628A;&#x8D85;&#x7EA7;&#x7EC8;&#x7AEF;&#x7684;&#x5916;&#x58F3;&#x7A0B;&#x5E8F;&#x7A0B;&#x5E8F;&#x6253;&#x8FDB;&#x53BB;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x5916;&#x58F3;&#x7A0B;&#x5E8F;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x952E;&#x76D8;&#x6572;&#x51FB;&#x4FE1;&#x606F;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x975E;&#x5E38;&#x5C0F;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x8981;&#x628A;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#x5BF9;winsock&#x51FD;&#x6570;&#x7684;&#x62E6;&#x622A;&#x7ED9;&#x4ED6;&#x7834;&#x574F;&#x3002;&#x5426;&#x5219;&#x6211;&#x53EA;&#x8981;&#x4E00;&#x53D1;&#x4FE1;&#x606F;&#x5C31;&#x4F1A;&#x88AB;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#x62E6;&#x622A;&#x3002;&#x5176;&#x5B9E;&#x9632;&#x706B;&#x5899;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;winsock2&#x51FD;&#x6570;&#x7684;&#x94A9;&#x5B50;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x76F8;&#x5F53;&#x4E8E;dos&#x4E0B;&#x7684;&#x4E2D;&#x65AD;&#x62E6;&#x622A;&#x3002;&#x4E0D;&#x8FC7;window&#x4E0B;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x4E86;&#x3002;&#x90FD;&#x6539;&#x51FD;&#x6570;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8981;&#x4ECE;&#x5916;&#x9762;&#x7A81;&#x7834;&#x9632;&#x706B;&#x5899;&#x975E;&#x5E38;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x4ECE;&#x5185;&#x90E8;&#x8BA9;&#x9632;&#x706B;&#x5899;&#x5DE5;&#x4F5C;&#x4E0D;&#x6B63;&#x5E38;&#x5E76;&#x4E0D;&#x56F0;&#x96BE;&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x4EC0;&#x4E48;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x6211;&#x8BA9;&#x4F60;&#x5BF9;winsock&#x51FD;&#x6570;&#x7684;&#x62E6;&#x622A;&#x5931;&#x6548;&#xFF0C;&#x4F60;&#x57FA;&#x672C;&#x5C31;&#x762B;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x81F3;&#x4E8E;&#x75C5;&#x6BD2;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x66F4;&#x672C;&#x4E0D;&#x4F1A;&#x5BF9;&#x901A;&#x8BAF;&#x6709;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4E0D;&#x7BA1;&#x4ED6;&#x3002;&#x8FD9;&#x4E9B;&#x6211;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x4E9B;&#x75C5;&#x6BD2;&#x9632;&#x706B;&#x5899;&#x4E00;&#x70B9;&#x7528;&#x5904;&#x90FD;&#x6CA1;&#x6709;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6253;&#x5F00;&#x5BF9;&#x65B9;&#x7684;&#x8D85;&#x7EA7;&#x7EC8;&#x7AEF;&#x7684;&#x76D1;&#x89C6;&#x7A0B;&#x5E8F;&#x3002;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x56DE;&#x5E94;&#x3002;&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x5BF9;&#x65B9;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x3002;<br>&#x3000;&#x3000;&#x73B0;&#x5728;&#x5FC5;&#x987B;&#x8BA9;&#x4ED6;&#x4F7F;&#x7528;&#x624D;&#x884C;&#x3002;<br>&#x3000;&#x3000;&#x6CA1;&#x5173;&#x7CFB;&#x3002;&#x4ED6;&#x603B;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x4F7F;&#x7528;&#x7684;&#x3002;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x4F1A;&#x8BB0;&#x5F55;&#x4ED6;&#x7684;&#x952E;&#x76D8;&#x6572;&#x51FB;&#x5230;&#x6587;&#x4EF6;&#x3002;&#x6211;&#x53EA;&#x8981;&#x7B49;&#x5F85;&#xFF0C;&#x5C31;&#x884C;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x4F46;&#x662F;&#x6211;&#x7B49;&#x4E0D;&#x53CA;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x4E00;&#x4E2A;&#x6708;&#x4E0D;&#x52A8;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5C82;&#x4E0D;&#x4E00;&#x4E2A;&#x6708;&#x5FCD;&#x53D7;&#x8FD9;&#x4E2A;10k&#x7684;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#xFF1F;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x6211;&#x8981;&#x901F;&#x5EA6;&#xFF0C;&#x6211;&#x901A;&#x8FC7;&#x8D22;&#x52A1;&#x5904;&#x7684;server&#x4F5C;&#x4EE3;&#x7406;&#xFF0C;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x3002;&#x4F46;&#x662F;&#x603B;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#xFF0C;&#x7ED3;&#x679C;&#x867D;&#x7136;&#x4E00;&#x6837;&#x3002;&#x4F46;&#x662F;&#x6027;&#x8D28;&#x4E0D;&#x540C;&#x3002;&#x6211;&#x5C31;&#x662F;&#x8981;&#x81EA;&#x5DF1;&#x63A7;&#x5236;&#xFF0C;&#x6211;&#x4E5F;&#x8BF4;&#x4E0D;&#x6E05;&#x695A;&#x662F;&#x81EA;&#x5DF1;&#x8BA8;&#x538C;&#x80E1;&#x961F;&#x957F;&#x7684;&#x4F5C;&#x4E3A;&#xFF0C;&#x8FD8;&#x662F;&#x5176;&#x5B9E;&#x81EA;&#x5DF1;&#x60F3;&#x8BC1;&#x5B9E;&#x81EA;&#x5DF1;&#x7684;&#x5B9E;&#x529B;&#x3002;&#x5176;&#x5B9E;&#x6709;&#x4E9B;&#x4EBA;&#x8BF4;&#xFF0C;&#x9ED1;&#x5BA2;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E3A;&#x4E86;&#x81EA;&#x6211;&#x6EE1;&#x8DB3;&#x3002;&#x6211;&#x70B9;&#x6211;&#x5F88;&#x662F;&#x540C;&#x610F;&#x3002;&#x9ED1;&#x5BA2;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x4E3A;&#x9ED1;&#x5BA2;&#x800C;&#x9ED1;&#x5BA2;&#xFF0C;&#x4ED6;&#x4EEC;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x8FDB;&#x5165;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x540E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4ED6;&#x4EEC;&#x4EAB;&#x53D7;&#x7684;&#x662F;&#x90A3;&#x4E2A;&#x9ED1;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x6280;&#x672F;&#x548C;&#x667A;&#x6167;&#x7684;&#x6311;&#x6218;&#x3002;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x5176;&#x5B9E;&#x662F;&#x4E3A;&#x4E86;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x6311;&#x6218;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x6B21;&#x4E0D;&#x80FD;&#x6211;&#x6253;&#x7535;&#x8BDD;&#x4E86;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x6B21;&#x6211;&#x6253;&#x4E86;&#x7535;&#x8BDD;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4E0A;&#x6B21;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x80AF;&#x5B9A;&#x4F1A;&#x6000;&#x7591;&#x5230;&#x6211;&#x7684;&#x5934;&#x4E0A;&#x3002;&#x51B5;&#x4E14;&#x8FD9;&#x51E0;&#x5929;&#xFF0C;&#x4ED6;&#x4E5F;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x6211;&#x5E2E;&#x516C;&#x5B89;&#x5C40;&#x89E3;&#x5BC6;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x57FA;&#x672C;&#x8FD9;&#x51E0;&#x5929;&#x6211;&#x4EEC;&#x90E8;&#x61C2;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x73B0;&#x5728;&#x89C1;&#x4E86;&#x6211;&#xFF0C;&#x773C;&#x5149;&#x90FD;&#x6709;&#x70B9;&#x4E0D;&#x5BF9;&#x4E86;&#x3002;&#x8BF4;&#x4E0D;&#x51FA;&#x6765;&#x662F;&#x4EC0;&#x4E48;&#x76EE;&#x5149;&#x3002;&#x53CD;&#x6B63;&#x5C31;&#x662F;&#x6211;&#x597D;&#x50CF;&#x4E0D;&#x6B63;&#x5E38;&#x4E00;&#x6837;&#x3002;<br>&#x3000;&#x3000;&#x8FD8;&#x6709;&#x4E2A;&#x540E;&#x52E4;&#x5904;&#x7684;&#x54E5;&#x4EEC;&#x6253;&#x7535;&#x8BDD;&#x8FC7;&#x6765;&#xFF0C;&#x53EB;&#x6211;&#x5E2E;&#x4ED6;&#x6FC0;&#x6D3B;&#x76D7;&#x7248;&#x7684;xp&#x3002;&#x6211;&#x6655;&#xFF0C;&#x6FC0;&#x6D3B;xp&#x7684;&#x8865;&#x4E01;&#x5230;&#x5904;&#x90FD;&#x662F;&#xFF0C;&#x628A;&#x6211;&#x5F53;&#x4E07;&#x7CBE;&#x6CB9;&#x4E86;&#xFF1F;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x8BF4;&#xFF0C;&#x4E0D;&#x4F1A;&#x3002;&#x90A3;&#x4E2A;&#x54E5;&#x4EEC;&#x8FD8;&#x8BF4;&#xFF1A;&#x201C;&#x9760;&#xFF0C;&#x8FDE;&#x516C;&#x5B89;&#x5C40;&#x90FD;&#x627E;&#x4F60;&#xFF0C;&#x89E3;&#x8FC7;xp&#x8FD8;&#x4E0D;&#x662F;&#x5C0F;&#x83DC;&#x4E00;&#x789F;&#xFF1F;&#x201D;&#x641E;&#x7684;&#x6211;&#x82E6;&#x7B11;&#x4E0D;&#x5F97;&#x3002;xp&#x6211;&#x4E5F;&#x641E;&#x8FC7;&#xFF0C;&#x4E0D;&#x8FC7;&#x641E;&#x7684;&#x6211;&#x7126;&#x5934;&#x70C2;&#x989D;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x80FD;&#x7834;&#x9664;&#x65F6;&#x95F4;&#x548C;&#x6FC0;&#x6D3B;&#x9650;&#x5B9A;&#x3002;&#x4F46;&#x662F;&#x6211;&#x65E0;&#x6CD5;&#x8BA9;&#x4ED6;&#x5230;&#x7F51;&#x4E0A;&#x6FC0;&#x6D3B;&#x3002;&#x65E0;&#x6CD5;&#x6FC0;&#x6D3B;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x5347;&#x7EA7;&#x66F4;&#x65B0;&#x3002;&#x73B0;&#x5728;&#x7F51;&#x4E0A;&#x7684;&#x7834;&#x89E3;&#x5DF2;&#x7ECF;&#x5F88;&#x5B8C;&#x5584;&#x4E86;&#xFF0C;&#x6211;&#x4E5F;&#x61D2;&#x5F97;&#x518D;&#x641E;&#x4E86;&#x3002;&#x6211;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x813E;&#x6C14;&#xFF0C;&#x7F51;&#x4E0A;&#x6709;&#x7684;&#xFF0C;&#x53C8;&#x80FD;&#x6EE1;&#x8DB3;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x6211;&#x7EDD;&#x5BF9;&#x4E0D;&#x4F1A;&#x81EA;&#x5DF1;&#x5199;&#x3002;&#x80FD;&#x7701;&#x5C31;&#x7701;&#x3002;<br>&#x3000;&#x3000;&#x627E;&#x8C01;&#x6253;&#x7535;&#x8BDD;&#x5462;&#xFF1F;&#x627E;&#x5934;&#x513F;&#xFF0C;&#x663E;&#x7136;&#x4ED6;&#x4E0D;&#x4F1A;&#x7406;&#x6211;&#x3002;&#x4E5F;&#x4E0D;&#x597D;&#x8BF4;&#x3002;&#x6211;&#x60F3;&#x6765;&#x60F3;&#x53BB;&#xFF0C;&#x89C9;&#x5F97;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x90E8;&#x7684;&#x674E;&#x5A9B;&#x5A9B;&#x6700;&#x5408;&#x9002;&#x3002;<br>&#x3000;&#x3000;&#x56E0;&#x4E3A;&#x80E1;&#x961F;&#x957F;&#x77E5;&#x9053;&#x5979;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x518D;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x90E8;&#x662F;&#x6700;&#x5F31;&#x7684;&#x3002;&#x5979;&#x672C;&#x6765;&#x5C31;&#x662F;&#x4F5C;&#x6587;&#x6863;&#x7684;&#x3002;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x6000;&#x7591;&#x5979;&#x80FD;&#x591F;&#x8FDB;&#x5165;&#x8DEF;&#x7531;&#x5668;&#x3002;<br>&#x3000;&#x3000;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x62FF;&#x8D77;&#x4EFD;&#x6587;&#x6863;&#x5230;&#x674E;&#x5A9B;&#x5A9B;&#x7684;&#x684C;&#x524D;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x95EE;&#x4E86;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5979;&#x89E3;&#x91CA;&#x4E86;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x662F;&#x6545;&#x610F;&#x95EE;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x81EA;&#x7136;&#x4E00;&#x70B9;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5A9B;&#x5A9B;&#xFF0C;&#x4F60;&#x7684;flashget&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#x5982;&#x4F55;&#x201D;&#x6211;&#x6545;&#x610F;&#x95EE;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x54CE;&#x5440;&#xFF0C;&#x522B;&#x63D0;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x901F;&#x5EA6;&#x6162;&#x3002;&#x624D;10k&#x4E0D;&#x5230;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x6253;&#x4E2A;&#x7535;&#x8BDD;&#x5230;&#x5230;&#x7F51;&#x7EDC;&#x90E8;&#x53BB;&#x95EE;&#x4E00;&#x4E0B;&#x3002;&#x5C31;&#x4F60;&#x6CA1;&#x6253;&#x7535;&#x8BDD;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x6253;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x7ED9;&#x4ED6;&#x4EEC;&#x538B;&#x529B;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x54CE;&#x5440;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7EDC;&#x70E6;&#x6B7B;&#x4EBA;&#x4E86;&#x3002;&#x641E;&#x7684;&#x6211;&#x7684;&#x8FDE;&#x7EED;&#x5267;&#x90FD;&#x6CA1;&#x529E;&#x6CD5;&#x770B;&#x4E86;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5C31;&#x662F;&#xFF0C;&#x6253;&#x7535;&#x8BDD;&#x201D;&#x6211;&#x4E0D;&#x505C;&#x7684;&#x717D;&#x98CE;&#x70B9;&#x706B;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x597D;&#xFF0C;&#x600E;&#x4E48;&#x8BF4;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x4F60;&#x5C31;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7F51;&#x7EDC;&#x4E00;&#x4F1A;&#x513F;90k&#x7684;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x53C8;10k&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x95EE;&#x5979;&#x4EEC;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF1F;&#x5475;&#x5475;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#x201D;&#x674E;&#x5A9B;&#x5A9B;&#x4E50;&#x4E86;&#x3002;&#x201C;&#x8FD9;&#x4E0D;&#x662F;&#x51A4;&#x5979;&#x4EEC;&#x561B;&#xFF1F;&#x201C;<br>&#x3000;&#x3000;&#x201C;&#x5C31;&#x662F;&#x8981;&#x51A4;&#x5979;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x51A4;&#x6211;&#x4EEC;&#x592A;&#x591A;&#x4E86;&#x3002;&#x201D;&#x6211;&#x4E5F;&#x4E50;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x597D;&#x201D;&#x5A9B;&#x5A9B;&#x7B11;&#x7740;&#x6293;&#x8D77;&#x7535;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x5230;&#x5979;&#x62FF;&#x8D77;&#x7535;&#x8BDD;&#x3002;&#x6211;&#x8D76;&#x7D27;&#x56DE;&#x5230;&#x6211;&#x7684;&#x5EA7;&#x4F4D;&#x4E0A;&#x6765;&#x3002;&#x5F00;&#x52A8;&#x6211;&#x7684;&#x76D1;&#x89C6;&#x7A0B;&#x5E8F;&#x3002;&#x4E0D;&#x51FA;&#x9884;&#x6599;&#x7684;&#x8BDD;&#xFF0C;&#x80E1;&#x961F;&#x957F;&#x5E94;&#x8BE5;&#x4F1A;&#x5F88;&#x5FEB;&#x4E0A;&#x6765;&#x767B;&#x9646;&#x8DEF;&#x7531;&#x5668;&#x770B;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x5230;&#x5A9B;&#x5A9B;&#x518D;&#x8BF4;&#x7740;&#x4EC0;&#x4E48;&#xFF0C;&#x7136;&#x540E;&#x653E;&#x4E0B;&#x7535;&#x8BDD;&#x3002;<br>&#x3000;&#x3000;&#x679C;&#x7136;&#xFF0C;&#x4E0D;&#x5230;5&#x5206;&#x949F;&#xFF0C;&#x76D1;&#x89C6;&#x7A0B;&#x5E8F;&#x4E0A;&#x9762;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x6307;&#x4EE4;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x6B21;&#x662F;&#x76F4;&#x63A5;&#x76D1;&#x89C6;&#x4ED6;&#x7684;&#x952E;&#x76D8;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x65E0;&#x7528;&#x6570;&#x636E;&#x3002;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x4ED6;&#x518D;&#x8D85;&#x7EA7;&#x7EC8;&#x7AEF;&#x7684;&#x4E0A;&#x8F93;&#x5165;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x771F;&#x662F;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x554A;&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x5230;&#x4ED6;&#x6572;&#x5165;enable&#x547D;&#x4EE4;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4E00;&#x9635;&#x72C2;&#x559C;&#x3002;&#x8FD9;&#x662F;&#x8FDB;&#x5165;&#x7279;&#x6743;&#x65B9;&#x5F0F;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x540E;&#x9762;&#x5C31;&#x662F;&#x8DEF;&#x7531;&#x5668;&#x5BC6;&#x7801;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x51FA;&#x6765;&#x4E86;&#x3002;&#x4ED6;&#x7684;&#x5BC6;&#x7801;&#x66F4;&#x52A0;&#x957F;,&#x60F3;&#x731C;&#x51FA;&#x6765;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x6211;&#x8BB0;&#x4E0B;&#x5BC6;&#x7801;&#x3002;&#x7EE7;&#x7EED;&#x770B;&#x4ED6;&#x7684;&#x64CD;&#x4F5C;&#x547D;&#x4EE4;&#x3002;<br>&#x3000;&#x3000;&#x53EA;&#x89C1;&#x4ED6;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x7F6E;&#x548C;&#x8DEF;&#x7531;&#x8868;&#xFF0C;&#x5C31;&#x9000;&#x51FA;&#x53BB;&#x4E86;&#x3002;&#x7B49;&#x4ED6;&#x51FA;&#x53BB;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x7ACB;&#x523B;&#x628A;&#x6211;&#x7684;&#x540E;&#x9762;&#x7A0B;&#x5E8F;&#x6539;&#x6210;&#x6587;&#x4EF6;&#x8BB0;&#x5F55;&#x65B9;&#x5F0F;&#x3002;&#x7136;&#x540E;&#x9000;&#x51FA;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE5;&#x540E;&#xFF0C;&#x4ED6;&#x53EA;&#x8981;&#x6539;&#x53D8;&#x8DEF;&#x7531;&#x5668;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x81EA;&#x52A8;&#x8BB0;&#x5F55;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x628A;&#x6587;&#x4EF6;&#x4F20;&#x56DE;&#x6765;&#x770B;&#x3002;&#x6BCF;&#x6B21;&#x6587;&#x4EF6;&#x90FD;&#x4F1A;&#x8986;&#x76D6;&#x4E0A;&#x6B21;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x6587;&#x4EF6;&#x8FC7;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5FC3;&#x6765;&#x65E0;&#x6BD4;&#x7684;&#x8F7B;&#x677E;&#x3002;&#x8FD9;&#x4E48;&#x591A;&#x5929;&#x7684;&#x4E8B;&#x60C5;&#x4ECA;&#x5929;&#x7EC8;&#x4E8E;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x4EE5;&#x540E;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x90FD;&#x5728;&#x6211;&#x63A7;&#x5236;&#x4E2D;&#x4E86;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E0A;&#x8DEF;&#x7531;&#x5668;&#x628A;&#x9650;&#x5B9A;&#x901F;&#x5EA6;&#x53D6;&#x6D88;&#x8C03;&#x3002;&#x6211;&#x4EEC;flashget&#x7ACB;&#x523B;&#x72C2;&#x5954;&#x8D77;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x674E;&#x5A9B;&#x5A9B;&#x9AD8;&#x5174;&#x7684;&#x5927;&#x53EB;&#x3002;&#x8BF4;&#xFF1A;&#x770B;&#x6765;&#x6CA1;&#x6709;&#x538B;&#x529B;&#x662F;&#x6CA1;&#x6709;&#x52A8;&#x529B;&#xFF0C;&#x6211;&#x4E00;&#x6253;&#x7535;&#x8BDD;&#x50AC;&#xFF0C;&#x7F51;&#x7EDC;&#x5C31;&#x901A;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x90FD;&#x8BF4;&#xFF1A;&#x8FD8;&#x662F;&#x5A9B;&#x5A9B;&#x9B45;&#x529B;&#x5927;&#xFF0C;&#x4EE5;&#x540E;&#x8FD9;&#x4E2A;&#x5149;&#x8363;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x4EA4;&#x7ED9;&#x4F60;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5A9B;&#x5A9B;&#x867D;&#x7136;&#x5BF9;&#x6211;&#x4EEC;&#x7FFB;&#x767D;&#x773C;&#xFF0C;&#x4F46;&#x662F;&#x770B;&#x7684;&#x51FA;&#x6765;&#x5FC3;&#x91CC;&#x8FD8;&#x662F;&#x7F8E;&#x6ECB;&#x6ECB;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x53EA;&#x6709;&#x6211;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#x5FC3;&#x91CC;&#x597D;&#x7B11;&#x3002;&#x73B0;&#x5728;&#x5373;&#x4F7F;&#x80E1;&#x961F;&#x957F;&#x6539;&#x53D8;&#x5BC6;&#x7801;&#x4E5F;&#x4E0D;&#x6015;&#x4E86;&#x3002;&#x54C8;&#x54C8;&#x3002;</p>
<p>&#x6B63;&#x7F8E;&#x7740;&#x5462;&#xFF0C;&#x624B;&#x673A;&#x77ED;&#x4FE1;&#x6765;&#x4E86;&#xFF0C;&#x4E00;&#x770B;&#x662F;&#x5C0F;&#x654F;&#x6765;&#x7684;&#x3002;&#x95EE;&#x6211;&#x8FC7;&#x5F97;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x8BF4;&#x5468;&#x672B;&#x8FC7;&#x6765;&#x627E;&#x6211;&#xFF0C;&#x6709;&#x70B9;&#x4E8B;&#x60C5;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4F1A;&#x4E86;&#x4E2A;ok&#x3002;&#x4ECA;&#x5929;&#x5FC3;&#x91CC;&#x8212;&#x670D;&#x3002;&#x6234;&#x4E0A;&#x8033;&#x673A;&#xFF0C;&#x70B9;&#x4E86;&#x90A3;&#x9996;&#x6768;&#x5609;&#x677E;&#x7684;&#x795E;&#x7ECF;&#xFF0C;&#x6B4C;&#x66F2;&#x98D8;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x6B21;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x68A6;&#xFF0C;&#x4F60;&#x8BA9;&#x6211;&#x6709;&#x83AB;&#x540D;&#x7684;&#x51B2;&#x52A8;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter5.html" class="navigation navigation-prev " aria-label="Previous page: 第五章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter7.html" class="navigation navigation-next " aria-label="Next page: 第七章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第六章","level":"1.7","depth":1,"next":{"title":"第七章","level":"1.8","depth":1,"path":"chapter7.md","ref":"chapter7.md","articles":[]},"previous":{"title":"第五章","level":"1.6","depth":1,"path":"chapter5.md","ref":"chapter5.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter6.md","mtime":"2017-02-27T04:03:26.074Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

