
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十一章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter12.html" />
    
    
    <link rel="prev" href="chapter10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十一章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6F14;&#x620F;4">&#x6F14;&#x620F;[4]</h2>
<p>&#x6211;&#x7684;ip&#x5730;&#x5740;&#x6D4B;&#x8BD5;&#x5230;&#x8FD8;&#x5269;&#x4E00;&#x4E2A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x90FD;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x6E17;&#x5165;&#x7684;&#x5730;&#x65B9;&#x3002;&#x60F3;&#x8BA9;&#x5BF9;&#x65B9;&#x6B7B;&#x673A;&#x4E0D;&#x5DE5;&#x4F5C;&#xFF0C;&#x771F;&#x7684;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;&#x4ED6;&#x4EEC;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x90E8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x672C;&#x6CA1;&#x600E;&#x4E48;&#x9632;&#x5907;&#x3002;&#x6F0F;&#x6D1E;&#x4E0D;&#x5C11;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x90FD;&#x6CA1;&#x6709;&#x5F00;&#x670D;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x65E0;&#x6CD5;&#x8FDE;&#x63A5;&#x4E0A;&#x53BB;&#xFF0C;&#x653E;&#x6728;&#x9A6C;&#x3002;&#x4E0D;&#x80FD;&#x653E;&#x540E;&#x95E8;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x65E0;&#x6CD5;&#x91C7;&#x7528;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x6765;&#x8FDE;&#x63A5;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>&#x54CE;&#xFF0C;&#x5176;&#x5B9E;&#x6280;&#x672F;&#x662F;&#x975E;&#x5E38;&#x65E0;&#x5948;&#x7684;&#x3002;&#x9ED1;&#x5BA2;&#x7684;&#x6210;&#x529F;&#x662F;&#x975E;&#x5E38;&#x968F;&#x673A;&#x7684;&#x3002;&#x5E38;&#x5E38;&#x770B;&#x5230;&#xFF0C;&#x7F51;&#x4E0A;&#x5F88;&#x591A;&#x4EBA;&#x627E;&#x4EBA;&#x53BB;&#x9ED1;&#x4EC0;&#x4E48;&#x4EC0;&#x4E48;&#x7F51;&#x7AD9;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x4E0D;&#x7BA1;&#x8FD9;&#x4E2A;&#x9ED1;&#x5BA2;&#x591A;&#x4E48;&#x7684;&#x5389;&#x5BB3;&#xFF0C;&#x4E00;&#x4E2A;&#x9632;&#x5907;&#x5B8C;&#x5584;&#xFF0C;&#x76D1;&#x63A7;&#x4E25;&#x5BC6;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8981;&#x4FB5;&#x5165;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#x3002;&#x91C7;&#x7528;&#x80FD;&#x5426;&#x9ED1;&#x4EC0;&#x4E48;&#x7F51;&#x7AD9;&#x6765;&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x9ED1;&#x5BA2;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x5E7C;&#x7A1A;&#x53EF;&#x7B11;&#x7684;&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x7684;&#x6280;&#x672F;&#x591A;&#x9AD8;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x5426;&#x80FD;&#x5199;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F60;&#x8981;&#x4FB5;&#x5165;&#x7684;&#x522B;&#x4EBA;&#x7CFB;&#x7EDF;&#xFF0C;&#x901A;&#x5E38;&#x7684;&#x51B3;&#x5B9A;&#x56E0;&#x7D20;&#x662F;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x5907;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#xFF0C;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x53EA;&#x662F;&#x4EE3;&#x8868;&#x4F60;&#x5229;&#x7528;&#x6F0F;&#x6D1E;&#x7684;&#x6C34;&#x5E73;&#x7684;&#x9AD8;&#x4F4E;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x6F0F;&#x6D1E;&#xFF0C;&#x4F60;&#x5C31;&#x4EC0;&#x4E48;&#x529E;&#x6CD5;&#x4E5F;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x6CA1;&#x6709;&#x6F0F;&#x6D1E;&#x7684;&#x7A0B;&#x5E8F;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x8BF4;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x9ED1;&#x5BA2;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x5C31;&#x5B58;&#x5728;&#x4E86;&#x3002;&#x5B58;&#x5728;&#x5C31;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x5144;&#x5F1F;&#x4E5F;&#x6CA1;&#x53D1;&#x73B0;&#x4EC0;&#x4E48;&#x6F0F;&#x6D1E;&#x3002;&#x5BF9;&#x65B9;&#x6E05;&#x4E00;&#x8272;&#x51E0;&#x4E4E;&#x5168;&#x90E8;&#x662F;window98&#x7684;&#x673A;&#x5668;&#x3002;&#x8981;&#x4FB5;&#x5165;&#xFF0C;&#x5B9E;&#x5728;&#x592A;&#x96BE;&#x3002;</p>
<p>&#x5403;&#x665A;&#x996D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x975E;&#x5E38;&#x7D2F;&#x4E86;&#x3002;&#x5927;&#x5BB6;&#x8FB9;&#x5403;&#x8FB9;&#x4EA4;&#x6D41;&#xFF0C;&#x90FD;&#x6CA1;&#x4EC0;&#x4E48;&#x6536;&#x83B7;&#xFF0C;&#x7ED3;&#x679C;&#x90FD;&#x662F;&#x548C;&#x6211;&#x7684;&#x6548;&#x679C;&#x5DEE;&#x4E0D;&#x591A;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x5144;&#x5F1F;&#x4EEC;&#x9047;&#x5230;&#x7684;&#x673A;&#x5668;&#x51E0;&#x4E4E;&#x90FD;&#x662F;98&#x7684;&#x673A;&#x5668;&#x3002;&#x4ED6;&#x4EEC;&#x4E5F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x6E17;&#x5165;&#x3002;</p>
<p>&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x5BF9;windows98&#x8FDC;&#x6CA1;&#x6709;&#x5BF9;windows nt&#x719F;&#x6089;&#x3002;&#x56E0;&#x4E3A;&#x5E73;&#x65F6;&#x6CA1;&#x6709;&#x4EBA;&#x4F7F;&#x7528;98&#x6765;&#x505A;&#x6B63;&#x5F0F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x3002;&#x800C;&#x8981;&#x8BA9;98&#x6B7B;&#x673A;&#x7BEE;&#x5C4F;&#x771F;&#x7684;&#x592A;&#x5BB9;&#x6613;&#x3002;&#x6211;&#x5BF9;98&#x4E00;&#x5411;&#x662F;&#x975E;&#x5E38;&#x770B;&#x4E0D;&#x8D77;&#x7684;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;2000&#x4E0D;&#x4F1A;&#x914D;&#x7F6E;&#xFF0C;&#x5BF9;&#x9ED1;&#x5BA2;&#x6765;&#x8BF4;&#xFF0C;98&#x53CD;&#x800C;&#x66F4;&#x5B89;&#x5168;&#x3002;&#x6211;&#x4EEC;&#x90FD;&#x6709;&#x70B9;&#x7EDD;&#x671B;&#x4E86;&#x3002;</p>
<p>&#x665A;&#x996D;&#x540E;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5F20;&#x5F00;&#x59CB;&#x5404;&#x81EA;&#x5B89;&#x88C5;&#x4E86;&#x4E00;&#x4E2A;windows98&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x91C7;&#x7528;&#x7684;&#x662F;&#x7684;&#x9ED8;&#x8BA4;&#x5B89;&#x88C5;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x627E;&#x5230;&#x770B;&#x80FD;&#x5426;&#x5229;&#x7528;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x8001;&#x5F20;&#x548C;&#x6211;&#x90FD;&#x662F;&#x5C5E;&#x4E8E;&#x8C03;&#x8BD5;&#x7EA7;&#x522B;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x81EA;&#x5DF1;&#x627E;&#x6F0F;&#x6D1E;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x4EE5;&#x4E0D;&#x53D8;&#x5E94;&#x4E07;&#x53D8;&#x3002;</p>
<p>&#x6211;&#x6BD4;&#x8F83;&#x9119;&#x89C6;&#x90A3;&#x4E9B;&#x628A;&#x4EBA;&#x5BB6;&#x7F51;&#x7AD9;&#x641E;&#x7684;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x6240;&#x8C13;&#x7684;&#x201C;&#x9ED1;&#x5BA2;&#x201D;&#x3002;&#x73B0;&#x5728;&#x9ED1;&#x5BA2;&#x6210;&#x4E3A;&#x53CD;&#x9762;&#x5F62;&#x8C61;&#xFF0C;&#x548C;&#x8FD9;&#x4E9B;&#x4EBA;&#x8131;&#x4E0D;&#x4E86;&#x5E72;&#x7CFB;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;hacker&#x8FD9;&#x4E2A;&#x8BCD;&#x521A;&#x4EA7;&#x751F;&#x7684;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x662F;&#x8D2C;&#x4E49;&#x8BCD;&#x7684;&#x3002;&#x751A;&#x81F3;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BF4;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x8912;&#x4E49;&#x8BCD;&#x3002;</p>
<p>&#x53EF;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x8FDE;&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x90FD;&#x6574;&#x4E0D;&#x660E;&#x767D;&#xFF0C;&#x6574;&#x5929;&#x5C31;&#x60F3;&#x7740;&#x628A;&#x4EBA;&#x5BB6;&#x7684;&#x7F51;&#x9875;&#x6539;&#x4E86;&#xFF0C;&#x628A;&#x4EBA;&#x5BB6;&#x7684;&#x670D;&#x52A1;&#x5668;&#x641E;&#x7684;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x4E86;&#x3002;&#x4ED6;&#x4EEC;&#x5C31;&#x9AD8;&#x5174;&#x4E86;&#x3002;</p>
<p>&#x7F51;&#x4E0A;&#x5F88;&#x591A;&#x9ED1;&#x5BA2;&#x6559;&#x7A0B;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x6765;&#xFF1A;&#x8BF7;&#x5F00;&#x52A8;&#x626B;&#x63CF;&#x5668;&#xFF0C;&#x968F;&#x4FBF;&#x8F93;&#x5165;XX&#x6BB5;&#x5230;XX&#x6BB5;&#x7684;ip&#xFF0C;&#x7B49;&#x5B83;&#x626B;&#x5427;&#xFF0C;&#x8FD0;&#x6C14;&#x597D;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8089;&#x9E21;&#x51FA;&#x73B0;&#x4E86;&#x3002;</p>
<p>&#x6655;&#xFF0C;&#x8FD9;&#x54EA;&#x91CC;&#x662F;&#x9ED1;&#x5BA2;&#xFF1F;&#x8FD9;&#x5206;&#x660E;&#x662F;&#x6C5F;&#x6E56;&#x90CE;&#x4E2D;&#x561B;&#xFF0C;&#x53CD;&#x6B63;&#x78B0;&#x5230;&#x4E00;&#x4E2A;&#x7B97;&#x4E00;&#x4E2A;&#xFF0C;&#x7BA1;&#x4F60;&#x662F;&#x4EC0;&#x4E48;&#x673A;&#x5668;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4ED6;&#x4EEC;&#x8FD9;&#x6837;&#x627E;&#x5230;&#x7684;&#x673A;&#x5668;99&#xFF05;&#x662F;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E00;&#x70B9;&#x610F;&#x4E49;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x9664;&#x4E86;&#x4F5C;&#x4E3A;&#x5439;&#x5618;&#x7684;&#x8C08;&#x8D44;&#x3002;</p>
<p>&#x6211;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x6709;&#x4E9B;&#x4EBA;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x8FDB;&#x5165;&#x4EBA;&#x5BB6;&#x673A;&#x5668;&#xFF0C;&#x628A;&#x4EBA;&#x5BB6;&#x7684;&#x4E3B;&#x9875;&#x6539;&#x7684;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#xFF0C;&#x751A;&#x81F3;&#x6539;&#x6210;&#x9EC4;&#x8272;&#x9875;&#x9762;&#x7684;&#x90FD;&#x6709;&#xFF0C;&#x4F60;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E0D;&#x662F;&#x5FC3;&#x7406;&#x53D8;&#x6001;&#x5417;&#xFF1F;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x73B0;&#x5728;&#x592A;&#x591A;&#xFF0C;&#x7F51;&#x4E0A;&#x597D;&#x591A;&#x9ED1;&#x522B;&#x4EBA;&#x7F51;&#x7AD9;&#x90FD;&#x662F;&#x8FD9;&#x4E9B;&#x4EBA;&#x5E72;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x80FD;&#x8FDB;&#x5165;&#x8FC7;&#x77E5;&#x540D;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x529B;&#x91CF;&#x6BD4;&#x8F83;&#x5F3A;&#x7684;&#x7F51;&#x7AD9;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x4EC0;&#x4E48;&#x4E2D;&#x7F8E;&#x9ED1;&#x5BA2;&#x5927;&#x6218;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x4E2D;&#x65E5;&#x9ED1;&#x5BA2;&#x5927;&#x6218;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x66F4;&#x662F;&#x65E0;&#x804A;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x4E0D;&#x662F;&#x6280;&#x672F;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#x3002;&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x662F;&#x4E9B;&#x4E0D;&#x61C2;&#x653F;&#x6CBB;&#x7684;&#x4EBA;&#x3002;&#x653F;&#x5E9C;&#x90FD;&#x6CA1;&#x6709;&#x8868;&#x6001;&#xFF0C;&#x4F60;&#x4EEC;&#x81EA;&#x5DF1;&#x8DF3;&#x4EC0;&#x4E48;&#x8DF3;&#xFF0C;&#x8FD8;&#x201C;&#x5927;&#x6218;&#x201D;&#xFF0C;&#x7ED3;&#x679C;&#x600E;&#x4E48;&#x6837;&#xFF1F;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7F8E;&#x56FD;&#x7684;&#x4E00;&#x4E9B;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#xFF0C;&#x66F4;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x53C2;&#x52A0;&#x3002;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#x4E5F;&#x662F;&#x4E00;&#x4E9B;&#x4E00;&#x822C;&#x4E0D;&#x8D85;&#x8FC7;30&#x5C81;&#x7684;&#x4E00;&#x4E9B;&#x5E74;&#x9752;&#x4EBA;&#x3002;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x51FA;&#x6211;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x6BD4;&#x4EBA;&#x5BB6;&#x5DEE;&#x7684;&#x4E0D;&#x5C11;&#x3002;</p>
<p>&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x53F0;&#x6E7E;&#x548C;&#x7F8E;&#x56FD;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4FC4;&#x7F57;&#x65AF;&#x7684;&#x9ED1;&#x5BA2;&#x670B;&#x53CB;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x4E0D;&#x662F;&#x4E71;&#x76D6;&#x7684;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x53C2;&#x52A0;&#x8FC7;&#x5982;&#x6B64;&#x65E0;&#x804A;&#x7684;&#x6D3B;&#x52A8;&#x3002;</p>
<p>&#x6211;&#x4E5F;&#x4E0D;&#x4F1A;&#x53C2;&#x52A0;&#x8FD9;&#x6837;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x65E0;&#x804A;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;&#x8F83;&#x5371;&#x9669;&#x3002;&#x8BF4;&#x4E0D;&#x5B9A;&#x653F;&#x5E9C;&#x98CE;&#x5411;&#x4E00;&#x53D8;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x4E16;&#x754C;&#x7B2C;&#x4E00;&#x9ED1;&#x5BA2;&#xFF0C;&#x5728;&#x653F;&#x6CBB;&#x9762;&#x524D;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x8FC7;&#x662F;&#x4E2A;&#x53EF;&#x601C;&#x866B;&#x3002;</p>
<p>&#x771F;&#x6B63;&#x7231;&#x56FD;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x4EC0;&#x4E48;&#x7A7A;&#x8BDD;&#x90FD;&#x4E0D;&#x8981;&#x8BF4;&#xFF0C;&#x591A;&#x505A;&#x70B9;&#x5B9E;&#x9645;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6BD4;&#x4EC0;&#x4E48;&#x4E0D;&#x5F3A;&#xFF1F;</p>
<p>&#x8001;&#x5F20;&#x4E0D;&#x6127;&#x662F;&#x8C03;&#x8BD5;&#x65B9;&#x9762;&#x7684;&#x9AD8;&#x624B;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4ED6;&#x5DF2;&#x7ECF;&#x5728;&#x5F00;&#x59CB;&#x8C03;&#x8BD5;windows98&#x7684;&#x901A;&#x8BAF;&#x7A0B;&#x5E8F;&#x4E86;&#x3002;&#x4ED6;&#x7684;&#x52A8;&#x4F5C;&#x5F88;&#x8F7B;&#x677E;&#xFF0C;&#x770B;&#x6765;&#x8FD8;&#x6CA1;&#x4EC0;&#x4E48;&#x5B9E;&#x8D28;&#x6027;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x6211;&#x4E5F;&#x65E0;&#x804A;&#x7684;&#x5728;windows98&#x4E2D;&#x4E71;&#x70B9;&#x7740;&#xFF0C;&#x6211;&#x4E3B;&#x8981;&#x770B;windows98&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x9762;&#x90FD;&#x6709;&#x4E9B;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x548C;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x6709;&#x5173;&#xFF1F;</p>
<p>&#x6211;&#x5148;&#x770B;&#x5171;&#x4EAB;&#x3002;windows98&#x7684;&#x5171;&#x4EAB;&#x662F;&#x4E2A;&#x8DEF;&#x4EBA;&#x7686;&#x77E5;&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x7834;&#x8BD1;windows98&#x7684;&#x5171;&#x4EAB;&#x5BC6;&#x7801;&#x7B80;&#x76F4;&#x6613;&#x5982;&#x53CD;&#x638C;&#x3002;&#x4F46;&#x662F;&#x9ED8;&#x8BA4;&#x7684;&#x65F6;&#x5019;&#x5171;&#x4EAB;&#x662F;&#x4E0D;&#x4F1A;&#x6253;&#x5F00;&#x7684;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x626B;&#x63CF;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x6CA1;&#x6709;&#x5F00;&#x5171;&#x4EAB;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x65E9;&#x5C31;&#x88AB;&#x6211;&#x4EEC;&#x653B;&#x7834;&#x4E86;&#x3002;&#x770B;&#x6765;&#x8D70;&#x8FD9;&#x6761;&#x8DEF;&#x7EBF;&#x884C;&#x4E0D;&#x901A;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x70B9;&#x5F00;&#x7F51;&#x7EDC;&#x90BB;&#x5C45;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x54E5;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6211;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#x8001;&#x5F20;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x6211;&#x70B9;&#x53F3;&#x952E;&#xFF0C;&#x9009;&#x62E9;&#x5C5E;&#x6027;&#xFF0C;&#x9009;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x4E86;&#x90A3;&#x4E2A;&#x7F51;&#x7EDC;&#x76D1;&#x89C6;&#x5668;&#x7684;&#x6309;&#x94AE;&#x3002;&#x6211;&#x7684;&#x5FC3;&#x4E2D;&#x4E00;&#x52A8;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x7528;&#x6765;&#x76D1;&#x89C6;&#x5176;&#x4ED6;&#x7F51;&#x7EDC;&#x90BB;&#x5C45;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x5F00;&#x4E86;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x53EA;&#x8981;&#x77E5;&#x9053;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x5C31;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x4E0A;&#x53BB;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x4ED6;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x6211;&#x67E5;&#x770B;&#x4E86;&#x4E00;&#x4E0B;&#x8FDB;&#x7A0B;&#xFF0C;&#x6211;&#x5411;&#x8001;&#x5F20;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8BD5;&#x56FE;&#x8FDE;&#x63A5;&#xFF0C;&#x7ED3;&#x679C;&#x8981;&#x6211;&#x63D0;&#x793A;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x3002;&#x770B;&#x6765;windows98&#x9ED8;&#x8BA4;&#x662F;&#x5F00;&#x4E86;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x7684;&#xFF1F;&#x4F46;&#x662F;&#xFF0C;&#x8001;&#x5F20;&#x90A3;&#x5929;&#x5982;&#x679C;&#x4E0D;&#x8BBE;&#x7F6E;&#x5BC6;&#x7801;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x65E0;&#x8BBA;&#x8F93;&#x5165;&#x4EC0;&#x4E48;&#xFF0C;&#x90FD;&#x662F;&#x4E0D;&#x80FD;&#x76D1;&#x89C6;&#x5BF9;&#x65B9;&#x7684;&#xFF01;</p>
<p>&#x6211;&#x8D76;&#x7D27;&#x8DD1;&#x5230;&#x8001;&#x5F20;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x53BB;&#x3002;</p>
<p>&#x201C;&#x8001;&#x5F20;&#xFF0C;windows98&#x9ED8;&#x8BA4;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4F60;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x5BC6;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x4ED6;&#x662F;&#x62D2;&#x7EDD;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x529E;&#x6CD5;&#xFF0C;&#x8BA9;&#x5B83;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x3002;&#x201D;&#x6211;&#x5174;&#x594B;&#x7684;&#x8BF4;&#x3002;</p>
<p>&#x8001;&#x5F20;&#x4E5F;&#x5174;&#x594B;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x4ED6;&#x77E5;&#x9053;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;&#x4ED6;&#x5F88;&#x5FEB;&#x627E;&#x5230;&#x4E86;&#x90A3;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x7136;&#x540E;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x5BC6;&#x7801;&#xFF0C;&#x6211;&#x4ECE;&#x6211;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7ACB;&#x523B;&#x5C31;&#x8FDE;&#x63A5;&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x5BC6;&#x7801;&#x8FD8;&#x662F;&#x8981;&#x7684;&#xFF0C;&#x6211;&#x5C45;&#x7136;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x5BF9;&#x65B9;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#xFF01;</p>
<p>&#x6211;&#x4EEC;&#x8FDE;&#x63A5;&#x7684;&#x7A0B;&#x5E8F;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x90A3;&#x4E2A; NETWATCH.EXE&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x201C;&#x8001;&#x5F20;&#xFF0C;&#x6211;&#x4EEC;&#x8DDF;&#x4E00;&#x8DDF;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x6CA1;&#x51C6;&#x80FD;&#x627E;&#x5230;&#x6F0F;&#x6D1E;&#xFF0C;98&#x6F0F;&#x6D1E;&#x7684;&#x591A;&#x662F;&#x51FA;&#x4E86;&#x540D;&#x7684;&#x3002;&#x5475;&#x5475;&#x201D;&#x3002;</p>
<p>&#x201C;&#x597D;&#x597D;&#x3002;&#x201D;&#x8001;&#x5F20;&#x7684;softice&#x53C8;&#x547C;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4E5F;&#x56DE;&#x5230;&#x6211;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x5F00;&#x59CB;&#x8C03;&#x8BD5;&#x4E86;&#x3002;</p>
<p>&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x4F5C;&#x771F;&#x662F;&#x67AF;&#x566A;&#x53C8;&#x4E4F;&#x5473;&#x3002;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x52A0;&#x5BC6;&#xFF0C;&#x8DDF;&#x8E2A;&#x8D77;&#x6765;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#x3002;&#x5C31;&#x662F;&#x70E6;&#x3002;&#x5230;12&#x70B9;&#x8FC7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x5934;&#x8111;&#x5F00;&#x59CB;&#x8FDF;&#x949D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x4EC0;&#x4E48;&#x6F0F;&#x6D1E;&#x3002;&#x6211;&#x51B3;&#x5B9A;&#x7761;&#x89C9;&#x3002;</p>
<p>&#x7761;&#x524D;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x8001;&#x5F20;&#xFF0C;&#x6B63;&#x5728;&#x672C;&#x5B50;&#x4E0A;&#x7528;&#x7B14;&#x753B;&#x7740;&#x4EC0;&#x4E48;&#xFF0C;&#x4ED6;&#x5728;&#x5206;&#x6790;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x548C;&#x5BF9;&#x65B9;&#x901A;&#x8BAF;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6211;6&#x70B9;&#x949F;&#x5C31;&#x9192;&#x4E86;&#xFF0C;&#x4E0D;&#x80FD;&#x5165;&#x7761;&#xFF0C;&#x641E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5FC3;&#x91CC;&#x6302;&#x7740;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x7761;&#x61D2;&#x89C9;&#x7684;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x8001;&#x5F20;&#x8FD8;&#x5728;&#x7761;&#xFF0C;&#x53EF;&#x80FD;&#x6628;&#x5929;&#x641E;&#x7684;&#x592A;&#x665A;&#x4E0A;&#xFF0C;&#x4ED6;&#x7684;&#x684C;&#x4E0A;&#x6563;&#x4E71;&#x7684;&#x672C;&#x5B50;&#x4E0A;&#x5BC6;&#x5BC6;&#x9EBB;&#x9EBB;&#x5730;&#x5199;&#x7740;16&#x8FDB;&#x5236;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6211;&#x521A;&#x5750;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x524D;&#x9762;&#xFF0C;&#x8001;&#x5F20;&#x4E5F;&#x9192;&#x4E86;&#xFF0C;&#x7ACB;&#x523B;&#x5174;&#x594B;&#x7684;&#x5BF9;&#x6211;&#x8BF4;&#xFF1A;&#x201C;&#x5C0F;&#x738B;&#xFF0C;&#x6211;&#x6628;&#x5929;&#x53D1;&#x73B0;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x5982;&#x679C;&#x63D0;&#x4EA4;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x8FDC;&#x7A0B;&#x7BA1;&#x7406;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C31;&#x4F1A;&#x6302;&#x6389;&#xFF0C;&#x4F46;&#x662F;windows98&#x8FD8;&#x662F;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#x3002;&#x201D;</p>
<p>&#x201C;&#x771F;&#x7684;&#x5440;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x65B9;&#x6EA2;&#x51FA;&#x4E4B;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x8FD8;&#x80FD;&#x8FDE;&#x63A5;&#x5417;&#xFF1F;&#x201D;</p>
<p>&#x201C;&#x80FD;&#xFF0C;&#x800C;&#x4E14;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5BC6;&#x7801;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#x3002;&#x201D;&#x8001;&#x5F20;&#x538B;&#x6291;&#x4E0D;&#x4F4F;&#x5FC3;&#x4E2D;&#x7684;&#x5174;&#x594B;&#x3002;</p>
<p>&#x6211;&#x7684;&#x624B;&#x6307;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x542F;&#x52A8;&#x90A3;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E86;&#xFF0C;&#x6211;&#x628A;&#x8001;&#x5F20;&#x5199;&#x7684;&#x90A3;&#x4E2A;&#x53D1;&#x6570;&#x636E;&#x5305;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;copy&#x8FC7;&#x6765;&#xFF0C;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x7ED9;&#x8001;&#x5F20;&#x7684;&#x673A;&#x5668;&#x3002;&#x7136;&#x540E;&#x542F;&#x52A8;win98&#x7684;&#x90A3;&#x4E2A;&#x7F51;&#x7EDC;&#x89C2;&#x770B;&#x5668;&#xFF0C;&#x8F93;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x540D;&#x5B57;&#xFF0C;&#x679C;&#x7136;&#xFF0C;&#x5BC6;&#x7801;&#x7B50;&#x91CC;&#x9762;&#x968F;&#x4FBF;&#x8F93;&#x4E00;&#x4E2A;&#x5B57;&#xFF0C;&#x8FDB;&#x53BB;&#x4E86;&#xFF01;</p>
<p>&#x6211;&#x770B;&#x5230;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x78C1;&#x76D8;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#x3002;&#x5929;&#xFF01;</p>
<p>&#x8001;&#x5F20;&#xFF0C;&#x5F97;&#x610F;&#x800C;&#x4E14;&#x5174;&#x594B;&#x7684;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x6211;&#x7B11;&#x7740;&#x5BF9;&#x4ED6;&#x7AD6;&#x8D77;&#x5927;&#x62C7;&#x6307;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x5230;&#x5BF9;&#x65B9;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x4E2A;&#x540E;&#x95E8;&#x4E0A;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x5BF9;&#x65B9;&#x6267;&#x884C;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x90A3;&#x4E0D;&#x662F;&#x6210;&#x529F;&#x4E86;&#xFF1F;&#x60F3;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x6291;&#x5236;&#x4E0D;&#x4F4F;&#x4E00;&#x9635;&#x7684;&#x5174;&#x594B;&#xFF01;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5F88;&#x5FEB;&#x6211;&#x5C31;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x540D;&#x5B57;&#x8FDE;&#x63A5;&#xFF0C;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;ip&#x8FDE;&#x63A5;&#x3002;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x540D;&#x5B57;&#x548C;&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x6BB5;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x65E0;&#x6CD5;&#x88AB;&#x89E3;&#x6790;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x672C;&#x8D28;&#x4E0A;&#x4E0D;&#x662F;&#x5C45;&#x4E8E;tcp/ip&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;netbeui&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x534F;&#x8BAE;&#x65E0;&#x6CD5;&#x8DE8;&#x7F51;&#x6BB5;&#x3002;</p>
<p>&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x60F3;&#x4E86;&#x60F3;&#x3002;&#x7ACB;&#x523B;&#x5F00;&#x59CB;&#x626B;&#x63CF;&#x6211;&#x4EEC;&#x653B;&#x51FB;ip&#x6240;&#x5728;&#x7684;&#x7F51;&#x6BB5;&#x7684;&#x5176;&#x5B83;ip&#x3002;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x62FF;&#x4E0B;&#x8FD9;&#x4E2A;&#x7F51;&#x6BB5;&#x5176;&#x5B83;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x968F;&#x4FBF;&#x4E00;&#x4E2A;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x901A;&#x8FC7;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#x76EE;&#x6807;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x6211;&#x731C;&#x60F3;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x6307;&#x6325;&#x90E8;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x7684;&#x6C11;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x5176;&#x5B83;&#x8BA1;&#x7B97;&#x673A;&#x5F88;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x662F;&#x4ED6;&#x4EEC;&#x519B;&#x65B9;&#x5728;&#x7528;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x5C31;&#x662F;&#x6C11;&#x7528;&#x7684;&#x3002;&#x6F14;&#x4E60;&#x561B;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x8EB2;&#x5230;&#x6C11;&#x95F4;&#x6765;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x4E5F;&#x8EB2;&#x5230;&#x5B66;&#x6821;&#x91CC;&#x9762;&#x6765;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x626B;&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x72B9;&#x8C6B;&#x7684;&#x3002;&#x5BF9;&#x65B9;&#x4E0D;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x5927;&#x9632;&#x5907;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7528;&#x7535;&#x8111;&#x7684;&#x4EBA;&#x672A;&#x5FC5;&#x5C31;&#x662F;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x3002;</p>
<p>&#x5F88;&#x5FEB;&#xFF0C;&#x6211;&#x626B;&#x5230;&#x4E86;&#x597D;&#x51E0;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x4ECA;&#x5929;&#x8FD0;&#x6C14;&#x4E0D;&#x597D;&#xFF0C;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x626B;&#x51FA;&#x5BC6;&#x7801;&#x7684;&#x3002;&#x4F46;&#x662F;&#x7A7A;&#x8FDE;&#x63A5;&#x6CA1;&#x6709;&#x7981;&#x6B62;&#x7684;2000&#x673A;&#x5668;&#x5F88;&#x591A;&#x3002;&#x5475;&#x5475;&#x3002;&#x5C45;&#x7136;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x5F00;&#x4E86;3389&#x7AEF;&#x53E3;&#x3002;&#x7ACB;&#x523B;&#x4F7F;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x4E0A;&#x53BB;&#x4E00;&#x770B;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2D;&#x6587;windows2000&#x7CFB;&#x7EDF;&#x3002;&#x8F93;&#x5165;administrator&#x7684;&#x7528;&#x6237;&#x540D;&#xFF0C;&#x4E00;&#x770B;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x4ECA;&#x5929;&#x7684;&#x8FD0;&#x6C14;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x597D;&#xFF1F;&#x5C45;&#x7136;&#x6CA1;&#x6709;&#x6253;&#x8865;&#x4E01;&#xFF0C;&#x8FDE;&#x8F93;&#x5165;&#x6CD5;&#x6F0F;&#x6D1E;&#x90FD;&#x6CA1;&#x6709;&#x8865;&#xFF01;</p>
<p>&#x8FD9;&#x4E5F;&#x96BE;&#x602A;&#xFF0C;&#x666E;&#x901A;&#x8001;&#x767E;&#x59D3;&#x7528;&#x673A;&#x5668;&#xFF0C;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x8003;&#x8651;&#x8FD9;&#x4E48;&#x591A;&#x3002;</p>
<p>&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x72B9;&#x8C6B;&#x7684;&#xFF0C;&#x6211;&#x7528;&#x4E86;1&#x5206;&#x949F;&#x5C31;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x7ED9;&#x81EA;&#x5DF1;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x8D85;&#x7EA7;&#x6743;&#x9650;&#x7684;&#x5E10;&#x53F7;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5BF9;&#x65B9;&#x80AF;&#x5B9A;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x3002;&#x51B5;&#x4E14;&#x6211;&#x53EA;&#x8981;&#x51E0;&#x5206;&#x949F;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x6211;&#x5BF9;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x5E76;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#xFF01;</p>
<p>&#x6211;&#x7ACB;&#x523B;&#x4E0A;&#x4F20;&#x8001;&#x5F20;&#x5199;&#x7684;&#x90A3;&#x4E2A;&#x653B;&#x51FB;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E26;&#x4E0A;&#x6211;&#x4EEC;&#x76EE;&#x6807;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x540D;&#x5B57;&#xFF0C;&#x5F00;&#x59CB;&#x653B;&#x51FB;&#xFF01;&#x7136;&#x540E;&#x4F20;&#x5165;&#xFF0C;&#x8001;&#x5F20;&#x6539;&#x5199;&#x7684;&#x53EF;&#x4EE5;&#x5728;2000&#x4E0B;&#x548C;&#x5BF9;&#x65B9;&#x8FDE;&#x63A5;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x6211;&#x98DE;&#x5FEB;&#x7684;&#x5411;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x673A;&#x5668;&#x4E0A;&#x4F20;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x540E;&#x95E8;&#x7A0B;&#x5E8F;&#xFF0C;&#x548C;&#x7834;&#x574F;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#x76D1;&#x63A7;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x7136;&#x540E;&#x6539;&#x4E86;&#x5B83;&#x7684;&#x542F;&#x52A8;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x7ACB;&#x523B;&#x9000;&#x51FA;&#x3002;</p>
<p>&#x9000;&#x51FA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x548C;&#x8001;&#x5F20;&#x90FD;&#x677E;&#x4E86;&#x4E00;&#x53E3;&#x6C14;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x76F8;&#x89C6;&#x4E00;&#x7B11;&#xFF0C;&#x7ACB;&#x523B;&#x542F;&#x52A8;&#x653B;&#x51FB;98&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BA9;98&#x6B7B;&#x673A;&#xFF0C;&#x5BB9;&#x6613;&#x3002;&#x5F53;&#x6211;&#x8F7B;&#x677E;&#x7684;&#x6572;&#x5165;&#x90A3;&#x4E2A;98&#x66B4;&#x529B;&#x653B;&#x51FB;&#x7A0B;&#x5E8F;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5FC3;&#x91CC;&#x4E00;&#x9635;&#x7684;&#x8F7B;&#x677E;&#x3002;</p>
<p>&#x679C;&#x7136;&#xFF0C;&#x5F88;&#x5FEB;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x505C;&#x6B62;&#x4E86;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x5BF9;&#x65B9;&#x80AF;&#x5B9A;&#x6B7B;&#x673A;&#x4E86;&#x3002;&#x53EA;&#x8981;&#x7B49;&#x4ED6;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x540E;&#x95E8;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8FDB;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7ACB;&#x523B;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6E17;&#x5165;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x5BB9;&#x6613;&#x591A;&#x4E86;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x6211;&#x548C;&#x8001;&#x5F20;&#x4E92;&#x76F8;&#x51FB;&#x638C;&#xFF0C;&#x90FD;&#x5F88;&#x5174;&#x594B;&#x3002;</p>
<p>&#x8D81;&#x8FD9;&#x4E2A;&#x7A7A;&#x9699;&#xFF0C;&#x6211;&#x70B9;&#x4E86;&#x4E00;&#x9996;&#x6B4C;&#x66F2;&#x300A;&#x6162;&#x6162;&#x6765;&#x300B;&#xFF0C;&#x5FE7;&#x90C1;&#x7684;&#x6B4C;&#x58F0;&#x98D8;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x6211;&#x5F88;&#x559C;&#x6B22;&#x7684;&#x6B4C;&#x66F2;&#xFF0C;&#x6709;&#x70B9;&#x6CA7;&#x6851;&#x7684;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x7D27;&#xFF0C;&#x6709;&#x4E9B;&#x8BDD;&#x53EA;&#x662F;&#x5904;&#x4E8E;&#x4E60;&#x60EF;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x9010;&#x6E10;&#x5B66;&#x4F1A;&#x5766;&#x7136;&#xFF0C;&#x5E78;&#x798F;&#x6709;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x4E00;&#x6837;&#x7684;&#x65E5;&#x5B50;&#x4E5F;&#x751C;&#xFF0C;&#x8981;&#x61C2;&#x5F97;&#x611F;&#x8C22;&#xFF0C;&#x61C2;&#x5F97;&#x968F;&#x7F18;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x7D27;&#xFF0C;&#x6162;&#x6162;&#x6765;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter10.html" class="navigation navigation-prev " aria-label="Previous page: 第十章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter12.html" class="navigation navigation-next " aria-label="Next page: 第十二章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十一章","level":"1.12","depth":1,"next":{"title":"第十二章","level":"1.13","depth":1,"path":"chapter12.md","ref":"chapter12.md","articles":[]},"previous":{"title":"第十章","level":"1.11","depth":1,"path":"chapter10.md","ref":"chapter10.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter11.md","mtime":"2017-02-27T04:05:38.444Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

