
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第九章 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter10.html" />
    
    
    <link rel="prev" href="chapter8.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chapter14.html">
            
                <a href="chapter14.html">
            
                    
                    第十四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第九章</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x6F14;&#x620F;2">&#x6F14;&#x620F;[2]</h2>
<p>&#x6726;&#x80E7;&#x4E2D;&#x88AB;&#x519B;&#x53F7;&#x58F0;&#x60CA;&#x9192;&#xFF0C;&#x5916;&#x9762;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x7247;&#x811A;&#x6B65;&#x58F0;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x5608;&#x6742;&#x3002;&#x8001;&#x5F20;&#x558A;:&quot;&#x5C0F;&#x738B;&#xFF0C;&#x8D77;&#x5E8A;&#x4E86;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x6211;&#x4E5F;&#x9192;&#x4E86;&#xFF0C;&#x519B;&#x8BAD;&#x7684;&#x611F;&#x89C9;&#x5728;&#x6211;&#x8111;&#x6D77;&#x91CC;&#x9762;&#x5176;&#x5B9E;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x892A;&#x53BB;&#x3002;&#x6211;&#x8D76;&#x7D27;&#x7A7F;&#x597D;&#x8863;&#x670D;&#xFF0C;&#x80CC;&#x597D;&#x7535;&#x8111;&#x3002;&#x5916;&#x9762;&#x6C7D;&#x8F66;&#x9A6C;&#x8FBE;&#x58F0;&#xFF0C;&#x76F4;&#x5347;&#x98DE;&#x673A;&#x7684;&#x8F70;&#x9E23;&#x58F0;&#x54CD;&#x6210;&#x4E00;&#x7247;&#x3002;&#x6211;&#x4EEC;&#x51E0;&#x4E2A;&#x8DD1;&#x51FA;&#x53BB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x95E8;&#x53E3;&#x505C;&#x4E86;&#x4E00;&#x8F86;&#x8FF7;&#x5F69;&#x8272;&#x7684;EVICO&#x3002;&#x4FE1;&#x606F;&#x961F;&#x7684;5&#x4E2A;&#x54E5;&#x4EEC;&#x5DF2;&#x7ECF;&#x5728;&#x4E0A;&#x9762;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x56DB;&#x4E2A;&#x4E5F;&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x6B66;&#x5668;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6234;&#x94A2;&#x76D4;&#x3002;&#x4F46;&#x662F;&#x8DDF;&#x8F66;&#x7684;&#x8FD8;&#x6709;10&#x4E2A;&#x8B66;&#x901A;&#x8FDE;&#x7684;&#x58EB;&#x5175;&#x3002;&#x8138;&#x4E0A;&#x6D82;&#x7684;&#x8FF7;&#x5F69;&#x6CB9;&#x751A;&#x662F;&#x6050;&#x6016;&#x3002;&#x90FD;&#x662F;&#x5168;&#x8EAB;&#x62AB;&#x6302;&#xFF0C;&#x9664;&#x4E86;&#x9632;&#x5F39;&#x80CC;&#x5FC3;&#x6CA1;&#x6709;&#xFF0C;&#x4E00;&#x5E94;&#x4FF1;&#x5168;&#x3002;<br>&#x3000;&#x3000;&#x8F66;&#x4E0A;&#x7684;&#x7A97;&#x5E18;&#x90FD;&#x62C9;&#x7684;&#x4E25;&#x4E25;&#x5B9E;&#x5B9E;&#x7684;&#xFF0C;&#x8F66;&#x5B50;&#x5F00;&#x52A8;&#x4E86;&#x3002;&#x6F14;&#x4E60;&#x5F00;&#x59CB;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x628A;&#x6211;&#x4EEC;&#x62C9;&#x5230;&#x54EA;&#x91CC;&#x53BB;&#x3002;&#x6211;&#x53EA;&#x662F;&#x7D27;&#x7D27;&#x7684;&#x62B1;&#x4F4F;&#x6211;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x3002;&#x8111;&#x5B50;&#x91CC;&#x9762;&#x4E00;&#x7247;&#x8FF7;&#x832B;&#x3002;<br>&#x3000;&#x3000;&#x4E0D;&#x77E5;&#x9053;&#x8F66;&#x5B50;&#x5F00;&#x4E86;&#x591A;&#x4E45;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x6709;&#x4E9B;&#x8FF7;&#x7CCA;&#x4E86;&#x3002;&#x7A81;&#x7136;&#x542C;&#x5230;&#x6709;&#x4EBA;&#x8BF4;&#x4E86;&#x58F0;&#xFF1A;&#x5230;&#x4E86;&#x3002;&#x6211;&#x7741;&#x5F00;&#x773C;&#x775B;&#x3002;&#x8F66;&#x5B50;&#x4F3C;&#x4E4E;&#x5F00;&#x5230;&#x4E86;&#x90CA;&#x53BF;&#x7684;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x4E86;&#x662F;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x3002;<br>&#x3000;&#x3000;&#x4E0B;&#x8F66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5929;&#x5DF2;&#x7ECF;&#x5927;&#x4EAE;&#x4E86;&#x3002;&#x770B;&#x770B;&#x5468;&#x56F4;&#x7684;&#x73AF;&#x5883;&#x3002;&#x597D;&#x50CF;&#x662F;&#x4E2A;&#x5B66;&#x6821;&#x3002;&#x6709;&#x64CD;&#x573A;&#x3002;&#x6CA1;&#x9519;&#xFF0C;&#x786E;&#x5B9E;&#x662F;&#x5B66;&#x6821;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x5BF9;&#x9762;&#x697C;&#x4E0A;&#x5199;&#x7684;&#x6807;&#x8BED;&#xFF1A;&#x201C;&#x597D;&#x597D;&#x5B66;&#x4E60;&#xFF0C;&#x5929;&#x5929;&#x5411;&#x4E0A;&#x3002;&#x201D;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x5C0F;&#x5B66;&#x6821;&#x3002;&#x5B66;&#x6821;&#x91CC;&#x9762;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x53EF;&#x80FD;&#x5B66;&#x751F;&#x653E;&#x5047;&#x4E86;&#x5427;&#x3002;&#x73B0;&#x5728;sars&#x95F9;&#x7684;&#x633A;&#x5389;&#x5BB3;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4E00;&#x884C;&#x4EBA;&#x7ACB;&#x523B;&#x5C31;&#x5728;&#x8B66;&#x901A;&#x8FDE;&#x58EB;&#x5175;&#x7684;&#x5E26;&#x9886;&#x4E0B;&#x5230;&#x4E86;&#x5B66;&#x6821;&#x540E;&#x9762;&#x4E00;&#x5EA7;&#x6402;&#xFF0C;&#x770B;&#x6837;&#x5B50;&#x50CF;&#x8001;&#x5E08;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x3002;&#x5218;&#x961F;&#x957F;&#x65E9;&#x5C31;&#x5728;&#x91CC;&#x9762;&#x7B49;&#x6211;&#x4EEC;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x662F;&#x4E00;&#x95F4;&#x5F88;&#x5927;&#x7684;&#x6559;&#x5BA4;&#xFF0C;&#x73B0;&#x5728;&#x6446;&#x653E;&#x4E86;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x53F0;&#x3002;&#x770B;&#x6765;&#x5218;&#x961F;&#x957F;&#x5DF2;&#x7ECF;&#x7CBE;&#x5FC3;&#x5E03;&#x7F6E;&#x8FC7;&#x4E86;&#x3002;&#x6211;&#x770B;&#x5230;&#x89D2;&#x843D;&#x91CC;&#x9762;&#x653E;&#x7740;&#x4E00;&#x53F0;&#x65B0;&#x7684;&#x673A;&#x5668;&#x3002;&#x4F46;&#x4E0D;&#x662F;&#x6211;&#x5728;&#x673A;&#x623F;&#x770B;&#x5230;&#x7684;&#x673A;&#x5668;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x5927;&#x5BB6;&#xFF0C;&#x5728;&#x5206;&#x914D;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x53F0;&#x4E0A;&#x5750;&#x4E0B;&#x6765;&#x4E86;&#x3002;&#x6211;&#x770B;&#x5230;&#x6BCF;&#x4E2A;&#x684C;&#x5B50;&#x4E0A;&#x90FD;&#x653E;&#x7740;&#x4E00;&#x6839;5&#x7C7B;&#x53CC;&#x7EDE;&#x7EBF;&#x3002;&#x987A;&#x7740;&#x7EBF;&#x770B;&#x8FC7;&#x53BB;&#xFF0C;&#x89D2;&#x843D;&#x91CC;&#x9762;&#x4E00;&#x4E2A;24&#x53E3;&#x7684;&#x4EA4;&#x6362;&#x673A;&#x7684;&#x6307;&#x793A;&#x706F;&#x662F;&#x4EAE;&#x7684;&#x3002;&#x770B;&#x6765;&#x4E5F;&#x662F;&#x4E34;&#x65F6;&#x5E03;&#x7F6E;&#x7684;&#x3002;&#x4EA4;&#x6362;&#x673A;&#x4E0A;&#x8FD8;&#x63A5;&#x7740;&#x4E00;&#x4E2A;&#x534E;&#x4E3A;&#x7684;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x534E;&#x4E3A;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x6211;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#xFF0C;&#x6211;&#x4E00;&#x773C;&#x5C31;&#x770B;&#x51FA;&#x6765;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x5218;&#x961F;&#x957F;&#x5C31;&#x5F00;&#x59CB;&#x8BF4;&#x8BDD;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x4E34;&#x65F6;&#x5DE5;&#x4F5C;&#x5730;&#x70B9;&#x3002;&#x5927;&#x5BB6;&#x4E0D;&#x8981;&#x968F;&#x4FBF;&#x8D70;&#x52A8;&#xFF0C;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x7ED9;&#x8B66;&#x901A;&#x8FDE;&#x58EB;&#x5175;&#x8BF4;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x4EBA;&#x7269;&#x5C31;&#x662F;&#x548C;&#x7EA2;&#x519B;&#x4FE1;&#x606F;&#x5BF9;&#x5BF9;&#x6297;&#x3002;&#x76EE;&#x6807;&#x662F;&#x5BF9;&#x65B9;&#x7684;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#x3002;&#x8BA9;&#x4ED6;&#x4EEC;&#x762B;&#x75EA;&#x6216;&#x8005;&#x7A83;&#x53D6;&#x8D44;&#x6599;&#x90FD;&#x53EF;&#x4EE5;&#x3002;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x4FDD;&#x536B;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7EDC;&#x7CFB;&#x7EDF;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x7684;&#x4EFB;&#x4F55;&#x5BC6;&#x7801;&#x548C;&#x8D44;&#x6599;&#x8BF7;&#x4E0D;&#x8981;&#x5B58;&#x5728;&#x4F60;&#x4EEC;&#x624B;&#x4E2D;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x4E2D;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7535;&#x8111;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x989D;&#x5916;&#x65E0;&#x5173;&#x7684;&#x901A;&#x8BAF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#x51FA;&#x53BB;&#x7684;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x4E2A;&#x4EBA;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6BD4;&#x8F83;&#x8584;&#x5F31;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x6392;&#x9664;&#x88AB;&#x5BF9;&#x65B9;&#x6E17;&#x5165;&#x7684;&#x53EF;&#x80FD;&#x3002;<br>&#x3000;&#x3000;&#x4E0B;&#x9762;&#x8BF7;&#x5927;&#x5BB6;&#x68C0;&#x67E5;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x7F51;&#x7EDC;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x770B;&#x662F;&#x5426;&#x6709;&#x6F0F;&#x6D1E;&#x3002;<br>&#x3000;&#x3000;&#x4E8E;&#x662F;&#x5927;&#x5BB6;&#x5C31;&#x63A5;&#x4E0A;&#x7F51;&#x7EBF;&#x3002;&#x5F00;&#x59CB;&#x5BF9;&#x8DEF;&#x7531;&#x5668;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x3002;&#x7F51;&#x7BA1;&#x5C0F;&#x8D75;&#x5C31;&#x8981;&#x4E86;&#x8DEF;&#x7531;&#x5668;&#x7684;&#x5BC6;&#x7801;&#x767B;&#x9646;&#x8FDB;&#x53BB;&#xFF0C;&#x5F00;&#x59CB;&#x8BBE;&#x7F6E;&#x3002;&#x770B;&#x6765;&#x5979;&#x975E;&#x5E38;&#x719F;&#x6089;&#x3002;&#x4ED6;&#x628A;&#x9632;&#x706B;&#x5899;&#x8BBE;&#x7F6E;&#x4E86;&#x975E;&#x5E38;&#x82DB;&#x523B;&#x7684;&#x9650;&#x5236;&#x6761;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x770B;&#x4E86;&#x770B;&#x3002;&#x6CA1;&#x770B;&#x51FA;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;&#x6700;&#x540E;&#x5173;&#x4E86;&#x8DEF;&#x7531;&#x5668;&#x7684;telnet&#x529F;&#x80FD;&#x3002;&#x4E0D;&#x5141;&#x8BB8;&#x901A;&#x8FC7;tcp/tp&#x534F;&#x8BAE;&#x767B;&#x9646;&#xFF0C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E32;&#x53E3;&#x76F4;&#x63A5;&#x4E0A;&#x53BB;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E5F;&#x628A;&#x4ED6;&#x5F53;&#x4F5C;&#x4E00;&#x822C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x505A;&#x4E86;&#x68C0;&#x67E5;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;&#x8DEF;&#x7531;&#x5668;&#x529F;&#x80FD;&#x7B80;&#x5355;&#xFF0C;&#x53C8;&#x662F;&#x56FA;&#x5316;&#x4E86;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x80FD;&#x6709;&#x6F0F;&#x6D1E;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x7136;&#x540E;&#x5C31;&#x5206;&#x914D;&#x4EFB;&#x52A1;&#xFF0C;&#x4FE1;&#x606F;&#x961F;&#x5206;&#x4E86;&#x4E24;&#x4E2A;&#x4EBA;&#x4E13;&#x95E8;&#x4F5C;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5907;&#x4EFD;&#x3002;&#x9632;&#x6B62;&#x6570;&#x636E;&#x88AB;&#x7AEF;&#x4E86;&#x4E4B;&#x540E;&#x8FD8;&#x80FD;&#x6062;&#x590D;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x8D1F;&#x8D23;&#x76D1;&#x89C6;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x7684;&#x52A8;&#x9759;&#x3002;&#x5C0F;&#x4F59;&#x8D1F;&#x8D23;&#x76D1;&#x89C6;&#x90A3;&#x592A;sql2000&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x52A8;&#x9759;&#x3002;&#x5C0F;&#x8D75;&#x8D1F;&#x8D23;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x76D1;&#x89C6;&#x3002;&#x5176;&#x4F59;&#x7684;&#x4EBA;&#xFF0C;&#x9664;&#x4E86;&#x5907;&#x4EFD;&#x7684;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x4EBA;&#x540C;&#x65F6;&#x5168;&#x90FD;&#x8FDB;&#x884C;&#x67E5;&#x627E;&#x6F0F;&#x6D1E;&#x548C;&#x653B;&#x51FB;&#x5BF9;&#x65B9;&#x7684;&#x673A;&#x5668;&#x3002;<br>&#x3000;&#x3000;&#x968F;&#x7740;&#x4E00;&#x4E2A;&#x8B66;&#x901A;&#x58EB;&#x5175;&#x8FDB;&#x6765;&#x62A5;&#x544A;&#xFF0C;&#x6F14;&#x4E60;&#x6B63;&#x5F0F;&#x5F00;&#x59CB;&#x3002;&#x6211;&#x4EEC;&#x5C31;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x6CA1;&#x6709;&#x50CF;&#x7535;&#x89C6;&#x91CC;&#x9762;&#x63CF;&#x8FF0;&#x7684;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x8138;&#x8272;&#x51DD;&#x91CD;&#xFF0C;&#x624B;&#x6307;&#x7FFB;&#x98DE;&#xFF0C;&#x4E00;&#x4F1A;&#x513F;&#x53C8;&#x53D1;&#x51FA;&#x4E00;&#x9635;&#x60CA;&#x5947;&#x7684;&#x53EB;&#x58F0;&#x3002;&#x8138;&#x4E0A;&#x6C57;&#x6C34;&#x6D41;&#x4E0B;&#xFF0C;&#x8FD8;&#x6765;&#x70B9;&#x6162;&#x955C;&#x5934;&#x4EC0;&#x4E48;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x90FD;&#x662F;&#x9A97;&#x4F60;&#x7684;&#x62C9;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x76F8;&#x5F53;&#x8F7B;&#x677E;&#x3002;&#x57FA;&#x672C;&#x5927;&#x5BB6;&#x5C31;&#x50CF;&#x5E73;&#x65F6;&#x4E00;&#x6837;&#xFF0C;&#x626B;&#x63CF;&#x5BF9;&#x65B9;&#x7684;&#x673A;&#x5668;&#x3002;&#x6CA1;&#x4EC0;&#x4E48;&#x6536;&#x83B7;&#x3002;&#x5927;&#x5BB6;&#x7D2F;&#x4E86;&#xFF0C;&#x9664;&#x4E86;&#x5907;&#x4EFD;&#x90A3;&#x4E24;&#x4E2A;&#x54E5;&#x4EEC;&#x5728;&#x4F8B;&#x884C;&#x516C;&#x4E8B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x662F;&#x8FD8;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x5439;&#x5439;&#x725B;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x8FB9;&#x548C;&#x5927;&#x5BB6;&#x8BF4;&#x8BF4;&#x7B11;&#x7B11;&#xFF0C;&#x4E00;&#x8FB9;&#x76D1;&#x89C6;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;80&#x7AEF;&#x53E3;&#x6570;&#x636E;&#x91CF;&#x6E90;&#x6E90;&#x4E0D;&#x65AD;&#xFF0C;&#x663E;&#x7136;&#x5BF9;&#x65B9;&#x4E5F;&#x6CA1;&#x6709;&#x6B47;&#x7740;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x626B;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4E5F;&#x662F;&#x53EA;&#x662F;&#x5F00;&#x4E86;80&#x7AEF;&#x53E3;&#x3002;&#x662F;&#x7684;redhat 9.0&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5BF9;&#x8001;&#x5F20;&#x8BF4;&#xFF1A;&#x201C;&#x8001;&#x5F20;&#xFF0C;&#x5BF9;&#x65B9;&#x7528;&#x7684;readhat9&#xFF0C;&#x4F60;&#x641E;&#x4E2A;&#x653B;&#x51FB;&#x7A0B;&#x5E8F;&#xFF0C;&#x770B;&#x80FD;&#x5426;&#x8BA9;&#x4ED6;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x3002;&#x5475;&#x5475;&#x201D;<br>&#x3000;&#x3000;&#x8001;&#x5F20;&#x7B11;&#x7B11;&#xFF0C;&#x624B;&#x4E2D;&#x6CA1;&#x6709;&#x505C;&#x3002;&#x201C;&#x6211;&#x770B;&#x5230;&#x4E86;&#x3002;&#x6B63;&#x5728;&#x60F3;&#x529E;&#x6CD5;&#xFF0C;&#x4ED6;&#x53EA;&#x662F;&#x5F00;80&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x641E;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x4E0D;&#x5BB9;&#x6613;&#x5440;&#x3002;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x4E0D;&#x5BB9;&#x6613;&#xFF0C;&#x4E5F;&#x5F97;&#x641E;&#x3002;&#x201D;&#x6211;&#x4E5F;&#x7B11;&#x4E86;&#x3002;<br>&#x770B;&#x6765;&#x5BF9;&#x65B9;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x4FDD;&#x5B88;&#x7684;&#xFF0C;&#x7AEF;&#x53E3;&#x5F00;&#x7684;&#x8D8A;&#x5C11;&#x8D8A;&#x597D;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x5C31;&#x8FDB;&#x5165;&#x90A3;&#x4E2A;asp&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x3002;&#x770B;&#x6765;&#x4ED6;&#x4EEC;&#x4FE1;&#x606F;&#x5206;&#x961F;&#x7684;&#x4EBA;&#x90FD;&#x662F;&#x5BF9;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x6BD4;&#x8F83;&#x7684;&#x9119;&#x89C6;&#xFF0C;&#x4E5F;&#x6BD4;&#x8F83;&#x7684;&#x6709;&#x7814;&#x7A76;&#xFF0C;&#x6211;&#x6211;&#x770B;&#x5230;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x90A3;&#x5E2E;&#x54E5;&#x4EEC;&#x90FD;&#x5728;&#x641E;&#x90A3;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;&#x5BF9;&#x65B9;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x662F;&#x8981;&#x68C0;&#x67E5;&#x4F60;&#x7684;ip&#x7684;&#x6240;&#x4EE5;&#x901A;&#x8FC7;ie&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x5C3D;&#x7BA1;&#x90A3;&#x4E2A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x6709;&#x5F88;&#x591A;&#x6F0F;&#x6D1E;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x3002;&#x5BF9;&#x65B9;&#x7684;www server&#x548C;&#x6211;&#x4EEC;&#x7684;server&#x90FD;&#x662F;apache&#x3002;&#x5475;&#x5475;&#x3002;&#x6240;&#x4EE5;&#x6F0F;&#x6D1E;&#x4E5F;&#x6BD4;&#x8F83;&#x5C11;&#x3002;<br>&#x3000;&#x57FA;&#x672C;&#x4E0A;&#x4E00;&#x4E0A;&#x5348;&#x5927;&#x5BB6;&#x90FD;&#x6CA1;&#x4EFB;&#x4F55;&#x8FDB;&#x5C55;&#x3002;&#x6709;&#x51E0;&#x4E2A;&#x54E5;&#x4EEC;&#x5F00;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FDB;&#x884C;DDOS&#x653B;&#x51FB;&#x3002;&#x4F46;&#x662F;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#xFF0C;&#x6700;&#x591A;&#x5C31;&#x8BA9;&#x5BF9;&#x65B9;&#x673A;&#x5668;&#x6162;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x70B9;&#x5E26;&#x5BBD;&#xFF0C;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x72B9;&#x5982;&#x676F;&#x6C34;&#x8F66;&#x85AA;&#x3002;<br>&#x3000;&#x5F53;&#x7136;&#x4ED6;&#x4EEC;&#x540C;&#x6837;&#x62FF;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6CA1;&#x4EC0;&#x4E48;&#x529E;&#x6CD5;&#x3002;&#x5927;&#x5BB6;&#x5C31;&#x8FD9;&#x4E48;&#x8017;&#x7740;&#xFF0C;&#x8BF4;&#x662F;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#xFF0C;&#x5176;&#x5B9E;&#x5BF9;&#x6297;&#x7684;&#x6210;&#x5206;&#x6BD4;&#x8F83;&#x5C11;&#x4E86;&#xFF0C;&#x4E2A;&#x4EBA;&#x4FDD;&#x62A4;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x6BD4;&#x8F83;&#x591A;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x5176;&#x5B9E;&#x653B;&#x51FB;&#x5BF9;&#x65B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x662F;&#x975E;&#x5E38;&#x968F;&#x673A;&#x7684;&#x3002;&#x5BF9;&#x65B9;&#x662F;&#x5185;&#x884C;&#xFF0C;&#x5BF9;&#x65B9;&#x4F5C;&#x4E86;&#x9632;&#x62A4;&#x63AA;&#x65BD;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#x4F60;&#x91C7;&#x7528;&#x4E00;&#x822C;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x529E;&#x6CD5;&#x7684;&#x3002;&#x90A3;&#x4E9B;&#x53F7;&#x79F0;&#x80FD;&#x8FDB;&#x5165;&#x4EFB;&#x4F55;&#x7CFB;&#x7EDF;&#x7684;&#x4EBA;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x5439;&#x725B;&#x7684;&#x3002;&#x9664;&#x975E;&#x4ED6;&#x638C;&#x63E1;&#x4E86;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#x516C;&#x6709;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x800C;&#x4E14;&#x90A3;&#x4E2A;&#x6F0F;&#x6D1E;&#x8FD8;&#x80FD;&#x62FF;&#x6765;&#x653B;&#x51FB;&#xFF0C;&#x8FD9;&#x79CD;&#x51E0;&#x7387;&#x6211;&#x89C9;&#x5F97;&#x5C0F;&#x7684;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x3002;<br>&#x3000;&#x8001;&#x5F20;&#x4E00;&#x76F4;&#x5728;&#x641E;&#x4ED6;&#x7684;&#x6EA2;&#x51FA;&#x653B;&#x51FB;&#x7A0B;&#x5E8F;&#x3002;&#x6211;&#x4E5F;&#x4E00;&#x8FB9;&#x76D1;&#x89C6;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E00;&#x8FB9;&#x5728;&#x627E;apache&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x4ED6;&#x4EEC;&#x7528;&#x7684;apache&#x662F;&#x7684;redhat&#x81EA;&#x5E26;&#x7684;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6700;&#x65B0;&#x7684;&#x7248;&#x672C;&#x3002;&#x6211;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x6F0F;&#x6D1E;&#x3002;&#x4F46;&#x662F;&#x80FD;&#x4E0D;&#x80FD;&#x5229;&#x7528;&#x8FD8;&#x4E0D;&#x6562;&#x8BF4;&#x3002;&#x6211;&#x4E0B;&#x8F7D;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x65B9;&#x7684;apache&#x7248;&#x672C;&#x4F7F;&#x7528;softice&#x8DDF;&#x8E2A;&#x7740;&#xFF08;&#x5C3D;&#x7BA1;apache&#x63D0;&#x4F9B;&#x4E86;&#x6E90;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x7684;&#x6F0F;&#x6D1E;&#x4ECE;&#x6E90;&#x7A0B;&#x5E8F;&#x4E0A;&#x662F;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x6F0F;&#x6D1E;&#x672C;&#x751F;&#x5C31;&#x662F;c&#x51FD;&#x6570;&#x5E26;&#x6765;&#x7684;&#xFF09;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x7684;&#x6F0F;&#x6D1E;&#x3002;<br>&#x3000;&#x5C0F;&#x4F59;&#x548C;&#x5C0F;&#x8D75;&#x7EE7;&#x7EED;&#x5728;&#x505A;DDOS&#x653B;&#x51FB;&#x3002;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x98CE;&#x66B4;&#x653B;&#x51FB;&#x65B9;&#x6CD5;&#x3002;&#x4ED6;&#x4EEC;&#x628A;&#x4ED6;&#x4EEC;&#x4EE5;&#x524D;&#x9ED1;&#x8FC7;&#x7684;&#x8089;&#x9E21;&#x90FD;&#x8C03;&#x52A8;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x663E;&#x7136;&#x65E9;&#x6709;&#x9632;&#x8303;&#x63AA;&#x65BD;&#x3002;&#x6548;&#x679C;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x7684;&#x901F;&#x5EA6;&#x53D7;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#x3002;<br>&#x5176;&#x5B9E;ip&#x7F51;&#x7EDC;&#x633A;&#x8106;&#x5F31;&#x7684;&#xFF0C;&#x8981;&#x653B;&#x51FB;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x5F00;&#x4E86;&#x7AEF;&#x53E3;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x6CA1;&#x6709;&#x5F00;&#x7AEF;&#x53E3;&#xFF0C;&#x4F60;&#x59CB;&#x7EC8;&#x65E0;&#x6CD5;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x9632;&#x6B62;&#x6570;&#x636E;&#x98CE;&#x66B4;&#x7684;DDOS&#x653B;&#x51FB;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x548C;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x65F6;&#x5019;&#x80AF;&#x5B9A;&#x8981;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#x7684;&#x3002;&#x5982;&#x679C;&#x548C;&#x4F60;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x6216;&#x8005;&#x8981;&#x6C42;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x4FE1;&#x606F;&#x592A;&#x591A;&#x3002;&#x4F60;&#x65E0;&#x8BBA;&#x591A;&#x5389;&#x5BB3;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x9632;&#x6B62;ddos&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#xFF0C;&#x5728;&#x7F51;&#x4E0A;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x8054;&#x7CFB;&#x5230;&#x5982;&#x6B64;&#x591A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x653B;&#x51FB;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x653B;&#x51FB;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x9ED1;&#x5BA2;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x662F;&#x66B4;&#x529B;&#xFF0C;&#x4E0D;&#x662F;&#x667A;&#x6167;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x662F;&#x5BF9;&#x6297;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x5C31;&#x662F;DDOS&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x7BA1;&#x4E0D;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x4E86;&#x3002;<br>&#x3000;&#x4E2D;&#x5348;&#x662F;&#x8B66;&#x901A;&#x6218;&#x58EB;&#x7ED9;&#x6211;&#x4EEC;&#x9001;&#x6765;&#x7684;&#x996D;&#x83DC;&#xFF0C;&#x633A;&#x4E30;&#x76DB;&#x7684;&#x3002;&#x6709;&#x9E21;&#x86CB;&#x6C64;&#xFF0C;3&#x76C6;&#x7D20;&#x6750;&#xFF0C;&#x8FD8;&#x6709;4&#x76C6;&#x8364;&#x83DC;&#x3002;&#x6211;&#x4EEC;&#x5927;&#x5BB6;&#x60A0;&#x95F2;&#x7684;&#x5403;&#x996D;&#xFF0C;&#x4E0D;&#x60A0;&#x95F2;&#x4E0D;&#x884C;&#x5440;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x5BB6;&#x90FD;&#x6CA1;&#x4EC0;&#x4E48;&#x8FDB;&#x5C55;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E5F;&#x8FD0;&#x884C;&#x7684;&#x5F88;&#x597D;&#x3002;&#x6211;&#x76D1;&#x89C6;&#x4E2D;&#x4E5F;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x6210;&#x529F;&#x8FDE;&#x63A5;&#x7684;&#x975E;&#x6211;&#x65B9;ip&#x3002;&#x6211;&#x4F30;&#x8BA1;&#x7EA2;&#x65B9;&#x7684;&#x54E5;&#x4EEC;&#x4E5F;&#x548C;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#x7684;&#x60A0;&#x95F2;&#x3002;<br>&#x3000;&#x5218;&#x961F;&#x957F;&#x5728;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#x7684;&#x5730;&#x65B9;&#x548C;&#x9694;&#x58C1;&#x901A;&#x8BAF;&#x5BA4;&#x8FDB;&#x8FDB;&#x51FA;&#x51FA;&#xFF0C;&#x6765;&#x6765;&#x5F80;&#x5F80;&#x3002;&#x4ED6;&#x9700;&#x8981;&#x548C;&#x4E0A;&#x7EA7;&#x901A;&#x8BAF;&#xFF0C;&#x4E86;&#x89E3;&#x6F14;&#x4E60;&#x7684;&#x8FDB;&#x5C55;&#x3002;&#x4E0A;&#x5395;&#x6240;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x51FA;&#x53BB;&#x4E86;&#x3002;&#x53D1;&#x73B0;&#x8B66;&#x901A;&#x6218;&#x58EB;&#x5DF2;&#x7ECF;&#x5728;&#x628A;&#x8FD9;&#x5EA7;&#x6402;&#x6212;&#x4E25;&#x4E86;&#x3002;&#x5230;&#x5904;&#x90FD;&#x662F;&#x5C97;&#x54E8;&#x548C;&#x9632;&#x5FA1;&#x70B9;&#x3002;</p>
<p>&#x4E0B;&#x5348;&#x7EE7;&#x7EED;&#x3002;&#x8001;&#x5F20;&#x7684;&#x7A0B;&#x5E8F;&#x6709;&#x4E86;&#x8FDB;&#x5C55;&#xFF0C;&#x4F46;&#x662F;&#x8BD5;&#x9A8C;&#x4E86;&#x51E0;&#x6B21;&#x90FD;&#x6CA1;&#x6709;&#x6210;&#x529F;&#xFF0C;&#x53EF;&#x80FD;&#x4ED6;&#x7684;&#x7A0B;&#x5E8F;&#x8FD8;&#x6709;&#x70B9;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x90E8;&#x961F;&#x3002;&#x8001;&#x5F20;&#x7EE7;&#x7EED;&#x8C03;&#x8BD5;&#x7740;&#x3002;&#x8001;&#x5F20;&#x6211;&#x975E;&#x5E38;&#x4F69;&#x670D;&#xFF0C;&#x5929;&#x5929;&#x5206;&#x6790;&#x75C5;&#x6BD2;&#xFF0C;&#x7EC3;&#x5C31;&#x4E86;&#x4ED6;&#x624E;&#x5B9E;&#x7684;&#x529F;&#x5E95;&#x548C;&#x575A;&#x97E7;&#x7684;&#x6BC5;&#x529B;&#x3002;&#x4ED6;&#x4E0D;&#x614C;&#x4E0D;&#x5FD9;&#x7684;&#x4F5C;&#x7740;&#x7A0B;&#x5E8F;&#x3002;&#x5F88;&#x5C11;&#x8BF4;&#x8BDD;&#xFF0C;&#x6211;&#x8FC7;&#x53BB;&#x770B;&#x4ED6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4E5F;&#x5C31;&#x53EA;&#x662F;&#x7B11;&#x7B11;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6162;&#x6162;&#x7684;&#x5206;&#x6790;&#x7740;apache&#x90A3;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x5173;&#x952E;&#x4EE3;&#x7801;&#x3002;<br>&#x3000;&#x3000;&#x4FE1;&#x606F;&#x961F;&#x4E2A;&#x54E5;&#x4EEC;&#x548C;&#x5C0F;&#x4F59;&#x5C0F;&#x8D75;&#xFF0C;&#x7EE7;&#x7EED;&#x7ED9;&#x5BF9;&#x65B9;&#x53D1;&#x9001;&#x6570;&#x636E;&#x98CE;&#x66B4;&#xFF0C;&#x6D88;&#x8017;&#x5BF9;&#x65B9;&#x7684;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x665A;&#x4E0A;&#x5927;&#x5BB6;&#x6709;&#x4E9B;&#x7CBE;&#x795E;&#x597D;&#x7684;&#x3002;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#x3002;&#x778C;&#x7761;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x65C1;&#x8FB9;&#x6709;&#x5730;&#x94FA;&#x3002;<br>&#x3000;&#x3000;&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5B50;&#x8FC7;&#x5F97;&#x5E73;&#x6DE1;&#x548C;&#x666E;&#x901A;&#xFF0C;&#x5927;&#x5BB6;&#x5C31;&#x8FD9;&#x4E48;&#x76F8;&#x5B89;&#x65E0;&#x4E8B;&#x7684;&#x8FC7;&#x4E86;4&#x5929;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x56DB;&#x5929;&#x4E2D;&#xFF0C;&#x8001;&#x5F20;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#x3002;&#x4E00;&#x76F4;&#x5728;&#x8C03;&#xFF0C;&#x4E00;&#x76F4;&#x5C31;&#x8BD5;&#x9A8C;&#x3002;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x3002;&#x4F46;&#x662F;&#x6BCF;&#x6B21;&#x8BD5;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x8001;&#x5F20;&#x8138;&#x4E0A;&#x7684;&#x559C;&#x60A6;&#x5C31;&#x591A;&#x4E86;&#x4E00;&#x5206;&#xFF0C;&#x53EF;&#x89C1;&#x662F;&#x6709;&#x95E8;&#x513F;&#x7684;&#x3002;&#x53EA;&#x662F;&#x65F6;&#x95F4;&#x95EE;&#x9898;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5C31;&#x4E00;&#x76F4;&#x8C03;&#x8BD5;&#x6211;&#x5BF9;apache&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x5165;&#x8FF7;&#x3002;&#x4F46;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x6E05;&#x6670;&#x3002;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x6211;&#x5DF2;&#x7ECF;&#x627E;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x4F55;&#x5229;&#x7528;&#x4E00;&#x4E2A;&#x5934;&#x75BC;&#x7684;&#x95EE;&#x9898;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x51E0;&#x4E2A;&#x641E;DDOS&#x653B;&#x51FB;&#x7684;&#x54E5;&#x4EEC;&#x540C;&#x6837;&#x575A;&#x6301;&#x7740;&#x3002;<br>&#x3000;&#x3000;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4E0D;&#x662F;&#x795E;&#x4ED9;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x5BF9;&#x65B9;&#x53EA;&#x662F;&#x5F00;&#x4E86;80&#xFF0C;&#x800C;&#x4E14;&#x8FDE;80&#x7AEF;&#x53E3;&#x7684;&#x8FDE;&#x63A5;&#x90FD;&#x8981;ip&#x9A8C;&#x8BC1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x548C;&#x5BF9;&#x65B9;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x4F5C;&#x4E3A;&#x3002;&#x6700;&#x591A;&#x5C31;&#x662F;&#x641E;&#x70B9;&#x6570;&#x636E;&#x98CE;&#x66B4;&#x653B;&#x51FB;&#x3002;<br>&#x3000;&#x3000;&#x4ED6;&#x4EEC;&#x5BF9;&#x6211;&#x4EEC;&#x4E5F;&#x662F;&#x540C;&#x6837;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#xFF0C;&#x8BF4;&#x53E5;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x9632;&#x7684;&#x6BD4;&#x4ED6;&#x4EEC;&#x8FD8;&#x8981;&#x6B7B;&#x3002;&#x6211;&#x4EEC;&#x8FDE;linux&#x90FD;&#x6CA1;&#x7528;&#x3002;&#x4ED6;&#x4EEC;&#x81F3;&#x5C11;&#x7528;&#x7684;linux&#x3002;&#x81F3;&#x5C11;&#x7ED9;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x5E0C;&#x671B;&#x3002;&#x4ED6;&#x4EEC;&#x7528;&#x7684;&#x4E0D;&#x662F;&#x6700;&#x65B0;&#x7684;apache&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x7ED9;&#x6211;&#x4E86;&#x4E00;&#x4E2A;&#x5E0C;&#x671B;&#x3002;&#x8FD9;&#x4E2A;&#x5E0C;&#x671B;&#x5BF9;&#x666E;&#x901A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x6211;&#x548C;&#x8001;&#x5F20;&#x8FD9;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x8C03;&#x8BD5;&#x884C;&#x5BB6;&#x8FD8;&#x8BF4;&#xFF0C;&#x5B9E;&#x73B0;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x5F88;&#x5927;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5C31;&#x7B49;&#x7740;&#x77A7;&#x5427;&#x3002;</p>
<p>&#x6211;&#x5FC3;&#x5B89;&#x7406;&#x5F97;&#x7684;&#x9020;&#x7740;apache&#x7684;&#x7A81;&#x7834;&#x70B9;&#x3002;&#x5230;&#x7B2C;5&#x5929;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6709;&#x70B9;&#x8FDB;&#x5C55;&#x4E86;&#x3002;&#x6211;&#x53D1;&#x73B0;apache&#x91CC;&#x9762;&#x8C03;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6709;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x6267;&#x884C;&#x4EFB;&#x610F;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x73B0;&#x5728;&#x6211;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x8BF7;&#x6C42;80&#x7AEF;&#x53E3;&#x3002;&#x8BA9;&#x5BF9;&#x65B9;&#x7684;apache&#x4EA7;&#x751F;&#x6EA2;&#x51FA;&#xFF0C;&#x540C;&#x65F6;&#x6267;&#x884C;&#x6211;&#x8BA9;&#x4ED6;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x8FD9;&#x4E2A;&#x662F;&#x4E2A;&#x7EDD;&#x5BF9;&#x7684;&#x6280;&#x672F;&#x6D3B;&#x3002;&#x6211;&#x5FC5;&#x987B;&#x5C0F;&#x5FC3;&#x5955;&#x5955;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5E78;&#x597D;&#x5BF9;&#x65B9;&#x7684;ip&#x68C0;&#x67E5;&#x662F;&#x57FA;&#x4E8E;asp&#x4E0A;&#x6765;&#x68C0;&#x67E5;&#x3002;&#x4E0D;&#x662F;&#x57FA;&#x4E8E;&#x6570;&#x636E;&#x5305;&#x7684;ip&#x68C0;&#x67E5;&#xFF0C;&#x5426;&#x5219;&#x5373;&#x4F7F;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#xFF0C;&#x5BF9;&#x6837;&#x4E5F;&#x4E0D;&#x4F1A;&#x7ED9;&#x6211;&#x8FDE;&#x63A5;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x6211;&#x5728;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5B89;&#x88C5;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;ip&#x5305;&#x68C0;&#x67E5;&#x7684;&#x3002;&#x4E0D;&#x662F;&#x6211;&#x65B9;ip&#xFF0C;&#x5BF9;&#x65B9;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x8FDE;&#x63A5;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x867D;&#x7136;&#x6211;&#x5176;&#x5B9E;&#x5F00;&#x4E86;&#x6211;&#x81EA;&#x5DF1;&#x7684;ftp&#x3002;&#x4F46;&#x662F;&#x5730;&#x65B9;&#x90FD;&#x65E0;&#x6CD5;&#x626B;&#x63CF;&#x5230;&#x3002;<br>&#x3000;&#x3000;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8BA9;&#x5BF9;&#x65B9;apache&#x6EA2;&#x51FA;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x6211;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6EA2;&#x51FA;&#x539F;&#x7406;&#x3002;&#x6211;&#x524D;&#x9762;&#x8BF4;&#x8FC7;&#xFF0C;&#x53D1;&#x660E;&#x8FD9;&#x4E2A;&#x539F;&#x7406;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#x7684;&#x4EBA;&#x7EDD;&#x5BF9;&#x662F;&#x4E2A;&#x5929;&#x624D;&#x3002;&#x6EA2;&#x51FA;&#x8F7B;&#x5219;&#x8BA9;&#x4F60;&#x6B7B;&#x673A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x3002;&#x91CD;&#x5219;&#x8BA9;&#x4F60;&#x6267;&#x884C;&#x6307;&#x4EE4;&#x3002;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x54EA;&#x91CC;&#x6765;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x5C31;&#x662F;&#x5B58;&#x5728;&#x6211;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x3002;&#x5F53;&#x7136;&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x672C;&#x8EAB;&#x6709;&#x6267;&#x884C;&#x6307;&#x4EE4;&#x7684;&#x529F;&#x80FD;&#x3002;&#x90A3;&#x5C31;&#x7701;&#x4E8B;&#x591A;&#x4E86;&#x3002;&#x6709;&#x4E9B;&#x6839;&#x672C;&#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x8005;&#x5B89;&#x88C5;&#x7684;&#x540E;&#x95E8;&#x3002;&#x6BD4;&#x5982;iis&#x6709;&#x4E2A;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x672C;&#x5730;&#x547D;&#x4EE4;&#x7684;bug&#xFF0C;&#x6211;&#x6000;&#x7591;&#x5176;&#x5B9E;&#x5C31;&#x662F;ms&#x5B89;&#x88C5;&#x7684;&#x540E;&#x95E8;&#x3002;&#x5982;&#x679C;&#x6211;&#x7A0B;&#x5E8F;&#x91CC;&#x9762;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5373;&#x4F7F;&#x627E;&#x5230;bug&#xFF0C;&#x6050;&#x6015;&#x4E5F;&#x5F88;&#x96BE;&#x80FD;&#x591F;&#x8BA9;&#x5BF9;&#x65B9;&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x6211;&#x5BF9;&#x6211;&#x81EA;&#x5DF1;&#x8BBE;&#x8BA1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x975E;&#x5E38;&#x7684;&#x81EA;&#x4FE1;&#x3002;&#x6211;&#x5C31;&#x4E0D;&#x76F8;&#x4FE1;&#x5BF9;&#x65B9;&#x80FD;&#x653B;&#x8FDB;&#x6765;&#x3002;&#x9664;&#x975E;&#x4ED6;&#x627E;&#x5230;apache&#x548C;openbsd&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x5426;&#x5219;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x53EF;&#x80FD;&#x3002;&#x5475;&#x5475;&#x3002;<br>&#x3000;&#x3000;&#x90A3;&#x5929;&#x665A;&#x4E0A;&#x6211;&#x5FC3;&#x60C5;&#x5F88;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5206;&#x6790;apache&#x6709;&#x4E86;&#x672C;&#x8D28;&#x7684;&#x8FDB;&#x5C55;&#x3002;<br>&#x3000;&#x3000;12&#x70B9;&#x8FC7;&#xFF0C;&#x542C;&#x4E86;&#x4E00;&#x9996;&#x6C34;&#x6728;&#x7684;&#x7684;&#x4E00;&#x751F;&#x6709;&#x4F60;&#x4E4B;&#x540E;&#xFF0C;&#x778C;&#x7761;&#x5C31;&#x6765;&#x4E86;&#x3002;&#x6211;&#x6709;&#x70B9;&#x60F3;&#x5C0F;&#x654F;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5C0F;&#x654F;&#xFF0C;&#x4F60;&#x73B0;&#x5728;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x53EF;&#x66FE;&#x60F3;&#x8FC7;&#x6211;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x5012;&#x5728;&#x5730;&#x94FA;&#x4E0A;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x8FDB;&#x5165;&#x4E86;&#x68A6;&#x4E61;&#x3002;&#x7761;&#x524D;&#x6211;&#x770B;&#x5230;&#x8001;&#x5F20;&#x6B63;&#x5728;&#x5F88;&#x6709;&#x7CBE;&#x795E;&#x7684;&#x8C03;&#x8BD5;&#x7740;&#x3002;</p>
<p>&#x7761;&#x68A6;&#x4E2D;&#xFF0C;&#x7A81;&#x7136;&#x88AB;&#x5218;&#x961F;&#x957F;&#x7684;&#x558A;&#x58F0;&#x60CA;&#x9192;&#xFF1A;&#x201C;&#x5FEB;&#x8D77;&#x6765;&#xFF0C;&#x5FEB;&#x8D77;&#x6765;&#xFF0C;&#x6709;&#x60C5;&#x51B5;&#xFF01;&#x201D;<br>&#x3000;&#x3000;&#x51E0;&#x4E2A;&#x54E5;&#x4EEC;&#x4E00;&#x4E0B;&#x5C31;&#x60CA;&#x9192;&#x4E86;&#x3002;&#x6211;&#x4E5F;&#x662F;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x5D29;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x600E;&#x4E48;&#x62C9;&#xFF0C;&#x600E;&#x4E48;&#x62C9;&#x3002;&#x96BE;&#x9053;&#x6709;&#x4EBA;&#x88AD;&#x51FB;&#x6211;&#x4EEC;&#xFF1F;<br>&#x3000;&#x3000;&#x5475;&#x5475;&#xFF0C;&#x4E00;&#x770B;&#x5916;&#x8FB9;&#x8B66;&#x901A;&#x961F;&#x7684;&#x5144;&#x5F1F;&#x4EEC;&#x6CA1;&#x4EC0;&#x4E48;&#x52A8;&#x9759;&#xFF0C;&#x4E0D;&#x50CF;&#x3002;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x7EE7;&#x7EED;&#x558A;&#x7740;&#xFF0C;&#x6211;&#x660E;&#x767D;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5FC3;&#x91CC;&#x4E00;&#x673A;&#x7075;&#x3002;&#x4E56;&#x4E56;&#xFF0C;&#x6628;&#x5929;&#x8FD8;&#x9AD8;&#x5174;&#x81EA;&#x5DF1;&#x7684;&#x9AD8;&#x660E;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x6765;&#x6211;&#x6709;&#x70B9;&#x9AD8;&#x5174;&#x7684;&#x592A;&#x65E9;&#x4E86;&#x3002;</p>
<p>&#x53EA;&#x542C;&#x89C1;&#x5218;&#x961F;&#x957F;&#x96C6;&#x543C;&#x543C;&#x7684;&#x558A;&#xFF1A;&#x201C;&#x5FEB;&#x70B9;&#xFF0C;&#x5FEB;&#x70B9;&#xFF0C;&#x5927;&#x5BB6;&#x5FEB;&#x70B9;&#x68C0;&#x67E5;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x4E2A;&#x4E0B;&#x5C5E;&#x6307;&#x6325;&#x6240;&#x88AB;&#x5BF9;&#x65B9;&#x7AEF;&#x4E86;&#x3002;&#x4ED6;&#x5976;&#x5976;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x5728;&#x6211;&#x5FC3;&#x4E2D;&#x4E00;&#x76F4;&#x662F;&#x4E2A;&#x5112;&#x5C06;&#x5F62;&#x8C61;&#x3002;&#x5F88;&#x5C11;&#x770B;&#x5230;&#x4ED6;&#x8FD9;&#x4E48;&#x7740;&#x6025;&#x3002;<br>&#x3000;&#x3000;&#x600E;&#x4E48;&#x80FD;&#x4E0D;&#x6025;&#xFF0C;&#x6211;&#x4EEC;&#x51E0;&#x4E2A;&#x54E5;&#x4EEC;&#x4E5F;&#x6025;&#x5F97;&#x4E0D;&#x884C;&#x5440;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x6240;&#x90FD;&#x662F;&#x548C;&#x6211;&#x4EEC;&#x670D;&#x52A1;&#x5668;&#x8054;&#x7F51;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x6240;&#x53EF;&#x4EE5;&#x5408;&#x6CD5;&#x8BBF;&#x95EE;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5440;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x53E3;&#x4EE4;&#x9650;&#x5236;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x7684;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x90A3;&#x4E9B;&#x884C;&#x5BB6;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x7684;ip&#x8FDE;&#x63A5;&#x4E0A;&#x6765;&#xFF0C;&#x8981;&#x641E;&#x7834;&#x574F;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x90A3;&#x4E2A;asp&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5B89;&#x5168;&#x9690;&#x60A3;&#x5440;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4E00;&#x8FB9;&#x6251;&#x5411;&#x6211;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x4E00;&#x8FB9;&#x95EE;&#xFF1A;&quot;&#x90A3;&#x4E2A;ip&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x90A3;&#x4E2A;ip&#x662F;&#x591A;&#x5C11;?&quot;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x6211;&#x7684;&#x76D1;&#x89C6;&#x5C4F;&#x5E55;&#x4E0A;&#x6709;&#x9891;&#x7E41;&#x7684;&#x6211;&#x65B9;ip&#x8FDE;&#x63A5;&#x3002;<br>&#x3000;&#x3000;&#x542C;&#x5230;&#x5218;&#x961F;&#x957F;&#x62A5;&#x7684;ip&#xFF0C;&#x6211;&#x6E05;&#x695A;&#x7684;&#x770B;&#x5230;&#x5C4F;&#x5E55;&#x4E0A;&#x95EA;&#x73B0;&#x7684;&#x6700;&#x9891;&#x7E41;&#x7684;ip&#x6B63;&#x662F;&#x90A3;&#x4E2A;ip&#x3002;<br>&#x3000;&#x3000;&#x770B;&#x6765;&#x5BF9;&#x65B9;&#x6BD4;&#x8F83;&#x72E1;&#x733E;&#xFF0C;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x6CD5;&#x653B;&#x7834;&#xFF0C;&#x91C7;&#x7528;&#x8FD9;&#x4E48;&#x4E00;&#x62DB;&#x3002;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x4F69;&#x670D;&#x5BF9;&#x65B9;&#x6307;&#x6325;&#x5B98;&#x7684;&#x601D;&#x7EF4;&#x3002;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x3002;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x7684;&#x4E0A;&#x7EA7;&#x53EF;&#x80FD;&#x60F3;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x51E0;&#x4E2A;&#x4EBA;&#x771F;&#x7684;&#x662F;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x3002;<br>&#x3000;&#x3000;&#x6765;&#x4E0D;&#x53CA;&#x601D;&#x8003;&#x8FC7;&#x591A;&#x4E86;&#xFF0C;&#x6211;&#x7ACB;&#x523B;&#x5F00;&#x52A8;&#x6211;&#x7684;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF0C;&#x767B;&#x9646;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x628A;&#x90A3;&#x4E2A;ip&#x65AD;&#x6389;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;ip&#x5217;&#x5165;&#x9ED1;&#x540D;&#x5355;&#x4E2D;&#x3002;&#x5F00;&#x59CB;&#x68C0;&#x67E5;&#x5BF9;&#x65B9;&#x662F;&#x5426;&#x6709;&#x6E17;&#x5165;&#x7684;&#x75D5;&#x8FF9;&#x3002;<br>&#x3000;&#x3000;&#x8FD8;&#x597D;&#xFF0C;&#x5BF9;&#x65B9;&#x4F3C;&#x4E4E;&#x53EA;&#x662F;&#x5728;&#x8FDE;&#x63A5;&#x6211;&#x4EEC;&#x7684;80&#x7AEF;&#x53E3;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x518D;&#x653B;&#x51FB;&#x6211;&#x4EEC;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#xFF0C;&#x7CFB;&#x7EDF;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#xFF0C;&#x5BF9;&#x65B9;&#x8FD8;&#x6CA1;&#x6709;&#x653B;&#x7834;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x90A3;&#x4E2A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x653B;&#x51FB;&#x5728;openbsd&#x4E0A;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#x6709;&#x8FC7;&#x591A;&#x7684;&#x6743;&#x5229;&#x7684;&#xFF0C;&#x8FD9;&#x70B9;&#x6211;&#x5012;&#x662F;&#x6BD4;&#x8F83;&#x81EA;&#x4FE1;&#x3002;&#x4E0D;&#x8FC7;&#x90A3;&#x53F0;windows&#x7684; sql&#x5C31;&#x96BE;&#x8BF4;&#x4E86;&#x3002;&#x672C;&#x6765;windows&#x7684; sql server&#x662F;&#x5927;&#x5BB6;&#x7684;&#x8584;&#x5F31;&#x73AF;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x901A;&#x8FC7;&#x4E3B;&#x673A;&#x548C;&#x5916;&#x754C;&#x9694;&#x79BB;&#xFF0C;&#x5916;&#x754C;&#x4E0D;&#x53EF;&#x80FD;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x7684;&#x5230;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x65B9;&#x5982;&#x679C;&#x65E0;&#x6CD5;&#x7A81;&#x7834;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x6709;&#x6240;&#x52A8;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x5BF9;&#x65B9;&#x5DF2;&#x7ECF;&#x7A81;&#x7834;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5C3D;&#x7BA1;&#x53EA;&#x662F;&#x7A81;&#x7834;80&#x3002;&#x4F46;&#x662F;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x8FDE;&#x63A5;sql server&#x7684;&#x53EF;&#x80FD;&#x3002;<br>&#x3000;&#x3000;&#x4FE1;&#x606F;&#x961F;&#x548C;&#x5C0F;&#x4F59;&#x548C;&#x5C0F;&#x8D75;&#x540C;&#x65F6;&#x53D1;&#x73B0;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x88AB;&#x7834;&#x574F;&#x4E86;&#x3002;&#x770B;&#x6765;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x6536;&#x5230;&#x6D88;&#x606F;&#x7684;&#x524D;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5BF9;&#x65B9;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9664;&#x4E86;&#x5907;&#x4EFD;&#x7684;&#x4EBA;&#xFF0C;&#x90FD;&#x5728;&#x7761;&#x89C9;&#x3002;&#x5373;&#x4F7F;&#x4E0D;&#x7761;&#x89C9;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x5BB6;&#x7528;&#x7684;&#x6211;&#x65B9;ip&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6211;&#x4EEC;&#x6536;&#x5230;&#x6D88;&#x606F;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x611F;&#x89C9;&#x5230;&#x5F02;&#x5E38;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x660E;&#x767D;&#x6211;&#x4EEC;&#x90A3;&#x4E2A;asp&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x5982;&#x679C;&#x5141;&#x8BB8;&#x8FDE;&#x63A5;&#xFF0C;&#x8981;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x529E;&#x5230;&#x3002;&#x5C3D;&#x7BA1;&#x5C0F;&#x4F59;&#x505A;&#x8FC7;&#x4E0D;&#x5C11;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4F60;&#x6539;&#x7684;&#x4E86;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x6CA1;&#x6709;&#x8BF4;&#x8BDD;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x8138;&#x8272;&#x94C1;&#x9752;&#xFF0C;&#x51FA;&#x53BB;&#x5230;&#x9694;&#x58C1;&#x901A;&#x8BAF;&#x5BA4;&#x53BB;&#x4E86;&#x597D;&#x51E0;&#x6B21;&#x3002;&#x4F30;&#x8BA1;&#x6211;&#x4EEC;&#x7684;&#x5404;&#x4E2A;&#x6307;&#x6325;&#x90E8;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x5C0F;&#x58F0;&#x800C;&#x65E0;&#x5948;&#x7684;&#x5BF9;&#x5218;&#x961F;&#x957F;&#x8BF4;&#xFF1A;&#x201C;&#x542F;&#x7528;&#x5907;&#x7528;&#x65B9;&#x6848;&#x5427;&#xFF1F;&#x201D;&#x3002;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x8138;&#x8272;&#x8FD8;&#x662F;&#x94C1;&#x9752;&#xFF0C;&#x6C89;&#x9ED8;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x7136;&#x540E;&#x5230;&#x901A;&#x8BAF;&#x5BA4;&#x53BB;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x5148;&#x628A;80&#x7AEF;&#x53E3;&#x5168;&#x90E8;&#x5173;&#x95ED;&#xFF0C;&#x6307;&#x6325;&#x90E8;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x6211;&#x4EEC;&#x7684;&#x7279;&#x5236;ftp&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5F00;&#x59CB;&#x68C0;&#x67E5;&#x7CFB;&#x7EDF;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90E8;&#x5206;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x7684;sql server&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#x635F;&#x5931;&#x4E25;&#x91CD;&#xFF0C;&#x5BF9;&#x65B9;&#x4F7F;&#x7528;sql&#x6CE8;&#x5165;&#x653B;&#x51FB;&#x65B9;&#x6CD5;&#xFF0C;&#x628A;&#x91CC;&#x9762;&#x6539;&#x7684;&#x662F;&#x4E00;&#x584C;&#x7CCA;&#x6D82;&#x3002;&#x57FA;&#x672C;&#x6570;&#x636E;&#x90FD;&#x5E9F;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x91CC;&#x591A;&#x8BF4;&#x51E0;&#x53E5;&#xFF0C;&#x7F51;&#x4E0A;&#x7684;&#x5927;&#x90E8;&#x5206;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x6709;&#x6570;&#x636E;&#x5E93;&#x652F;&#x6301;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x7F51;&#x9875;&#xFF0C;&#x6700;&#x666E;&#x904D;&#x4F7F;&#x7528;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x79CD;sql&#x6CE8;&#x5165;&#x653B;&#x51FB;&#x3002;&#x8FD9;&#x662F;&#x5B8C;&#x5168;&#x5408;&#x6CD5;&#x7684;sql&#x8BBF;&#x95EE;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x4EC0;&#x4E48;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x4EC0;&#x4E48;&#x9632;&#x62A4;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4F5C;&#x7528;&#x7684;&#x3002;&#x552F;&#x4E00;&#x7684;&#x5C31;&#x662F;&#x8981;&#x505A;&#x597D;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x7684;&#x68C0;&#x67E5;&#x3002;&#x73B0;&#x5728;&#x7F51;&#x4E0A;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x8BBA;&#x575B;&#x90FD;&#x4E0D;&#x540C;&#x7A0B;&#x5EA6;&#x7684;&#x6709;&#x8FD9;&#x4E2A;&#x6BDB;&#x75C5;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x7CBE;&#x529B;&#x548C;&#x5FC3;&#x601D;&#x53BB;&#x627E;&#x8FD9;&#x4E9B;&#x6F0F;&#x6D1E;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x4ED4;&#x7EC6;&#x627E;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x3002;&#x8F7B;&#x7684;&#x53EF;&#x4EE5;&#x7834;&#x574F;&#x5BF9;&#x65B9;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x91CD;&#x7684;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x5BF9;&#x65B9;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x7684;&#x5BC6;&#x7801;&#x3002;&#x5C3D;&#x7BA1;&#x5BC6;&#x7801;&#x662F;&#x52A0;&#x4E86;&#x5BC6;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6709;&#x5FC3;&#x4EBA;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x8DD1;&#x4E00;&#x8DD1;&#x3002;&#x5B8C;&#x5168;&#x6709;&#x53EF;&#x80FD;&#x7834;&#x8BD1;&#x7684;&#x3002;<br>&#x3000;&#x53CD;&#x6B63;&#xFF0C;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x56DE;&#x5408;&#x8F93;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x8F93;&#x7684;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#xFF0C;&#x8F93;&#x7684;&#x5982;&#x6B64;&#x7684;&#x4E0D;&#x670D;&#x3002;<br>&#x3000;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x90FD;&#x662F;&#x6280;&#x672F;&#x72C2;&#x70ED;&#x5206;&#x5B50;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4F69;&#x670D;&#x6280;&#x672F;&#x7684;&#x653B;&#x51FB;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x670D;&#x6C14;&#x8FD9;&#x79CD;&#x51E0;&#x4E4E;&#x6CA1;&#x4EC0;&#x4E48;&#x6280;&#x672F;&#x542B;&#x91CF;&#x7684;&#x8BA1;&#x8C0B;&#x3002;<br>&#x3000;&#x6240;&#x4EE5;&#xFF0C;&#x9ED1;&#x5BA2;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x65E0;&#x5948;&#x7684;&#x3002;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x6709;&#x592A;&#x591A;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x8D85;&#x8D8A;&#x6280;&#x672F;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x53EA;&#x6709;&#x6280;&#x672F;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x662F;&#x884C;&#x4E0D;&#x901A;&#x7684;&#x3002;&#x6280;&#x672F;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#x3002;<br>&#x3000;&#x6211;&#x5FC3;&#x91CC;&#x7740;&#x6025;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x7B49;&#x5927;&#x5BB6;&#x51B7;&#x9759;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x6709;&#x70B9;&#x607C;&#x6012;&#x4E86;&#x3002;&#x5976;&#x5976;&#x7684;&#xFF0C;&#x6B3A;&#x8D1F;&#x6211;&#x4EEC;&#x6CA1;&#x4EBA;&#x5417;&#xFF1F;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8981;&#x53CD;&#x51FB;&#xFF01;<br>&#x3000;&#x6211;&#x52A0;&#x7D27;&#x5F00;&#x59CB;&#x60F3;&#x5982;&#x4F55;&#x5229;&#x7528;&#x90A3;&#x4E2A;apahe&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x5176;&#x5B9E;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x5982;&#x679C;&#x653B;&#x51FB;&#x5BF9;&#x65B9;&#xFF0C;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x8BA9;&#x5BF9;&#x65B9;apache&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x8BA9;&#x5BF9;&#x65B9;&#x548C;&#x6211;&#x4EEC;&#x4E00;&#x6837;&#xFF0C;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x762B;&#x75EA;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x8FD9;&#x6837;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x66B4;&#x9732;&#xFF0C;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x65B9;&#x8981;&#x6062;&#x590D;&#x53EA;&#x662F;&#x51E0;&#x5206;&#x949F;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x800C;&#x4E14;&#x5982;&#x679C;&#x88AB;&#x4ED6;&#x4EEC;&#x89C9;&#x5BDF;&#xFF0C;&#x90A3;&#x4E48;&#x7EE7;&#x7EED;&#x5229;&#x7528;&#x7684;&#x673A;&#x4F1A;&#x5C31;&#x975E;&#x5E38;&#x5C0F;&#x4E86;&#x3002;<br>&#x3000;&#x4E0D;&#x884C;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x73CD;&#x60DC;&#x8FD9;&#x4E2A;&#x6765;&#x4E4B;&#x4E0D;&#x6613;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x8981;&#x4E00;&#x6B65;&#x5230;&#x4F4D;&#xFF0C;&#x6211;&#x4E0D;&#x8981;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#xFF0C;&#x6211;&#x8981;&#x6E17;&#x5165;&#x5BF9;&#x65B9;&#x3002;<br>&#x3000;&#x8001;&#x5F20;&#x8138;&#x8272;&#x51DD;&#x91CD;&#xFF0C;&#x4E5F;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x8C03;&#x8BD5;&#x4ED6;&#x7684;&#x7A0B;&#x5E8F;&#x3002;<br>&#x3000;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x6709;&#x4E86;&#x7D27;&#x5F20;&#x7684;&#x6C14;&#x6C1B;&#xFF0C;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x611F;&#x5230;&#x4E86;&#x5BF9;&#x6297;&#x7684;&#x538B;&#x529B;&#x3002;<br>&#x3000;&#x5C0F;&#x4F59;&#x548C;&#x4FE1;&#x606F;&#x5BF9;&#x7684;&#x90A3;&#x5E2E;&#x54E5;&#x4EEC;&#x5F00;&#x59CB;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5F00;&#x59CB;&#x91CD;&#x5EFA;&#x3002;<br>&#x3000;&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x6000;&#x7591;&#x5BF9;&#x65B9;&#x80AF;&#x5B9A;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x4E86;&#x6211;&#x4EEC;asp&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x7684;&#x5BC6;&#x7801;&#x3002;&#x6211;&#x95EE;&#x4FE1;&#x606F;&#x961F;&#x7684;&#x54E5;&#x4EEC;&#xFF1A;&#x201C;&#x4F60;&#x4EEC;&#x90A3;&#x4E2A;asp&#x7CFB;&#x7EDF;&#x662F;&#x7528;&#x4EC0;&#x4E48;&#x5BC6;&#x7801;&#x7B97;&#x6CD5;&#x52A0;&#x7684;&#x5BC6;&#x5440;&#xFF1F;&#x201D;<br>&#x3000;&#x4ED6;&#x4EEC;&#x8BF4;&#x662F;MD5&#x3002;<br>&#x3000;&#x6211;&#x653E;&#x5FC3;&#x4E86;&#x3002;MD5&#x662F;128&#x4F4D;&#x7684;&#x52A0;&#x5BC6;&#x3002;&#x8981;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x8DD1;&#x51FA;8&#x4F4D;&#x4EE5;&#x4E0A;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x7B80;&#x76F4;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x51B5;&#x4E14;&#x6211;&#x4EEC;&#x7684;&#x5BC6;&#x7801;&#x662F;20&#x4F4D;&#x7684;&#x3002;&#x4ED6;&#x4EEC;&#x8FD9;&#x4E48;&#x51E0;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x8DD1;&#x51FA;&#x6765;&#x3002;&#x4ED6;&#x4EEC;&#x8FD0;&#x6C14;&#x4E0D;&#x53EF;&#x80FD;&#x8FD9;&#x4E48;&#x597D;&#x7684;&#x3002;<br>&#x3000;&#x4F46;&#x662F;sql 2000&#x6709;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x672C;&#x5730;&#x547D;&#x4EE4;&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x5BF9;&#x65B9;&#x7ED9;&#x6211;&#x7684;2000 server&#x4F5C;&#x4E2A;&#x6728;&#x9A6C;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4E5F;&#x662F;&#x6709;&#x7684;&#x3002;<br>&#x3000;&#x4E0D;&#x8FC7;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x628A;&#x90A3;&#x4E2A;ip&#x9650;&#x5236;&#x6389;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;ip&#x65E0;&#x6CD5;&#x548C;&#x6211;&#x4EEC;&#x8FDE;&#x63A5;&#xFF0C;&#x5373;&#x4F7F;&#x5B89;&#x88C5;&#x4E86;&#x6728;&#x9A6C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x3002;<br>&#x3000;&#x5C0F;&#x4F59;&#x4ED6;&#x4EEC;&#x5F00;&#x59CB;&#x91CD;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x5907;&#x4EFD;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6062;&#x590D;&#x8D77;&#x6765;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;<br>&#x3000;&#x5F88;&#x5FEB;&#xFF0C;&#x4ED6;&#x4EEC;&#x51E0;&#x4E2A;&#x8BA9;sql&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x3002;<br>&#x3000;&#x6211;&#x5BF9;&#x5C0F;&#x4F59;&#x8BF4;&#xFF1A;&#x201C;&#x5BC6;&#x7801;&#x4E00;&#x5B9A;&#x8981;&#x66FF;&#x6362;&#x6389;&#x3002;&#x201D;&#x5C3D;&#x7BA1;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x65E0;&#x6240;&#x8C13;&#x4E86;&#xFF0C;&#x5BF9;&#x65B9;&#x8FDE;&#x4E0A;&#x6211;&#x4EEC;&#x7684;&#x673A;&#x5668;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x5FC5;&#x8981;&#x8981;&#x5C0F;&#x5FC3;&#x4E00;&#x70B9;&#x3002;&#x4E0D;&#x6015;&#x4E00;&#x4E07;&#x5C31;&#x6015;&#x4E07;&#x4E00;&#x3002;<br>&#x3000;&#x201C;&#x90A3;&#x662F;&#x5F53;&#x7136;&#x7684;&#x201D;&#x3002;<br>&#x3000;&#x201C;&#x5218;&#x961F;&#xFF0C;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x6062;&#x590D;&#x201D;&#x5C0F;&#x4F59;&#x5927;&#x558A;&#x3002;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x8138;&#x8272;&#x7F13;&#x548C;&#x4E9B;&#x4E86;&#x3002;&#x5FEB;&#x6B65;&#x5411;&#x901A;&#x8BAF;&#x5BA4;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x770B;&#x5230;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x6CA1;&#x4E8B;&#x60C5;&#x4E4B;&#x540E;&#xFF0C;&#x7D27;&#x5F20;&#x7684;&#x6C14;&#x6C1B;&#x5F00;&#x59CB;&#x677E;&#x5F1B;&#x4E0B;&#x6765;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5988;&#x7684;&#xFF0C;&#x5BF9;&#x65B9;&#x771F;&#x662F;&#x5389;&#x5BB3;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x62DB;&#x6570;&#x90FD;&#x60F3;&#x7684;&#x51FA;&#x201D;&#x5C0F;&#x4F59;&#x7B11;&#x9A82;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x5475;&#x5475;&#xFF0C;&#x5175;&#x4E0D;&#x538C;&#x8BC8;&#x561B;&#xFF0C;&#x54B1;&#x4EEC;&#x4E0D;&#x662F;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x5E72;&#x8017;&#x7740;&#x5417;&#x201D;&#x5C0F;&#x8D75;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x4FE1;&#x606F;&#x961F;&#x6709;&#x4E2A;&#x54E5;&#x4EEC;&#x8BF4;&#xFF1A;&#x201C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x4E5F;&#x5E94;&#x8BE5;&#x8FD9;&#x4E48;&#x5E72;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x6709;&#x4E86;&#x5BF9;&#x65B9;&#x7684;ip&#xFF0C;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x8981;&#x7834;&#x574F;&#x8FD9;&#x4E2A;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#x8FD8;&#x662F;&#x4E00;&#x6837;&#x5BB9;&#x6613;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x8981;&#x662F;&#x80FD;&#x591F;&#x4F2A;&#x88C5;&#x5BF9;&#x65B9;&#x7684;ip&#x5C31;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x201D;&#x4E00;&#x4E2A;&#x54E5;&#x4EEC;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8981;&#x4F2A;&#x88C5;&#x5BF9;&#x65B9;&#x7684;ip&#x7ED9;&#x5BF9;&#x65B9;&#x53D1;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x8FD9;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x548C;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x5C31;&#x4E0D;&#x884C;&#x7684;&#x3002;&#x201D;&#x8001;&#x5F20;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x54C8;&#x54C8;&#x54C8;&#x5927;&#x7B11;&#x3002;&#x90FD;&#x662F;&#x5185;&#x884C;&#xFF0C;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x8FC7;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x8BF4;&#x7740;&#x73A9;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#x8001;&#x5F20;&#x8BF4;&#x7684;&#x6CA1;&#x9519;&#xFF0C;ip&#x901A;&#x8BAF;&#x5FC5;&#x987B;&#x8981;&#x548C;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x662F;&#x65E0;&#x6CD5;&#x4F2A;&#x88C5;ip&#x7684;&#x3002;&#x73B0;&#x5728;&#x5176;&#x5B9E;&#x8BF4;&#x7684;ip&#x4F2A;&#x88C5;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x7528;&#x7684;&#x522B;&#x4EBA;&#x7684;&#x673A;&#x5668;&#x5E2E;&#x4F60;&#x901A;&#x8BAF;&#x7684;&#x3002;&#x76F4;&#x63A5;&#x4FEE;&#x6539;ip&#x5305;&#x4E2D;&#x7684;&#x6E90;ip&#x5730;&#x5740;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x5BF9;&#x65B9;&#x4E5F;&#x80FD;&#x6536;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x8981;&#x548C;&#x4F60;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x53CD;&#x9988;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x7ED9;&#x4F60;&#xFF0C;&#x4F60;&#x6539;&#x4E86;ip&#x5305;&#xFF0C;&#x4E5F;&#x5C31;&#x65E0;&#x6CD5;&#x6536;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x786E;&#x8BA4;&#x6D88;&#x606F;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x65E0;&#x6CD5;&#x548C;&#x5BF9;&#x65B9;&#x6B63;&#x786E;&#x901A;&#x8BAF;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;ip&#x60F3;&#x600E;&#x4E48;&#x53D8;&#x5C31;&#x600E;&#x4E48;&#x53D8;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x7B26;&#x5408;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#x539F;&#x7406;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x53EA;&#x6709;&#x5728;&#x9ED1;&#x5BA2;&#x7535;&#x5F71;&#x548C;&#x9ED1;&#x5BA2;&#x5C0F;&#x8BF4;&#x91CC;&#x9762;&#x624D;&#x80FD;&#x770B;&#x5230;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x53C8;&#x6062;&#x590D;&#x4E86;&#x5E73;&#x9759;&#x3002;&#x5927;&#x5BB6;&#x53C8;&#x5F00;&#x59CB;&#x6309;&#x90E8;&#x5C31;&#x73ED;&#x7684;&#x5DE5;&#x4F5C;&#x3002;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x770B;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#x6CA1;&#x4EC0;&#x4E48;&#x8FDB;&#x5C55;&#x3002;&#x66FE;&#x7ECF;&#x8BF4;&#x8D77;&#x8FC7;&#xFF0C;&#x8981;&#x5411;&#x4E0A;&#x7EA7;&#x63D0;&#x51FA;&#x4E5F;&#x62CD;&#x7279;&#x79CD;&#x5206;&#x961F;&#x593A;&#x53D6;&#x5BF9;&#x65B9;&#x7684;&#x4E00;&#x4E2A;&#x6307;&#x6325;&#x90E8;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x6709;&#x5BF9;&#x65B9;&#x7684;ip&#xFF0C;&#x4E5F;&#x80FD;&#x8BA9;&#x5BF9;&#x65B9;&#x762B;&#x75EA;&#x3002;&#x5373;&#x4F7F;&#x5BF9;&#x65B9;&#x80FD;&#x591F;&#x6062;&#x590D;&#x6210;&#x529F;&#xFF0C;&#x81F3;&#x5C11;&#x5927;&#x5BB6;&#x6253;&#x4E2A;&#x5E73;&#x624B;&#x3002;<br>&#x3000;&#x3000;&#x8001;&#x5F20;&#x8BF4;&#xFF1A;&#x7B49;&#x7B49;&#x5427;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x6709;&#x70B9;&#x7709;&#x76EE;&#x4E86;&#x3002;&#x4E00;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x4ED6;&#x4EEC;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x3002;<br>&#x3000;&#x3000;&#x8FD9;&#x4E2A;&#x5F53;&#x7136;&#x6700;&#x597D;&#x4E86;&#xFF0C;&#x5218;&#x961F;&#x957F;&#x5929;&#x5929;&#x90FD;&#x8981;&#x6765;&#x770B;&#x8001;&#x5F20;&#x7684;&#x8FDB;&#x5C55;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x6CA1;&#x6709;&#x8BF4;&#x6211;&#x7684;apache&#x7684;&#x4E0A;&#x9762;&#x7684;&#x653B;&#x51FB;&#x65B9;&#x6CD5;&#x3002;&#x7B49;&#x6210;&#x719F;&#x4E86;&#x518D;&#x8BF4;&#x4E5F;&#x4E0D;&#x8FDF;&#x3002;<br>&#x3000;&#x3000;&#x5176;&#x5B9E;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x660E;&#x767D;&#xFF0C;&#x641E;&#x5BF9;&#x65B9;&#x6307;&#x6325;&#x90E8;&#x7684;&#x70B9;&#x5B50;&#x5BF9;&#x65B9;&#x9996;&#x5148;&#x4F7F;&#x7528;&#xFF0C;&#x663E;&#x7136;&#x5BF9;&#x65B9;&#x662F;&#x6709;&#x9632;&#x8303;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x4F7F;&#x7528;&#x522B;&#x4EBA;&#x7684;&#x70C2;&#x62DB;&#x6570;&#xFF0C;&#x548C;&#x9001;&#x6B7B;&#x4E5F;&#x5DEE;&#x4E0D;&#x591A;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x5728;&#x5FD9;&#x788C;&#x7740;&#xFF0C;&#x53CC;&#x65B9;&#x53C8;&#x5F00;&#x59CB;&#x5E72;&#x8017;&#x7740;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x5916;&#x9762;&#x8B66;&#x901A;&#x58EB;&#x5175;&#x53C8;&#x589E;&#x52A0;&#x4E86;&#x5341;&#x51E0;&#x4E2A;&#x4EBA;&#x3002;&#x662F;&#x5440;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6D3E;&#x4EBA;&#x6765;&#x628A;&#x6211;&#x4EEC;&#x7AEF;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x6297;&#x5C31;&#x5168;&#x5B8C;&#x4E86;&#x3002;<br>&#x5230;&#x4E86;&#x7B2C;10&#x5929;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x6B63;&#x5728;&#x8BD5;&#x9A8C;&#x6EA2;&#x51FA;&#x6570;&#x636E;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#x6709;&#x7709;&#x76EE;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x542C;&#x5230;&#x8001;&#x5F20;&#x4E00;&#x58F0;&#x5927;&#x558A;&#xFF1A;&#x201C;&#x6210;&#x529F;&#x4E86;&#xFF01;&#x201D;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x56F4;&#x4E0A;&#x53BB;&#x4E86;&#xFF0C;&#x5305;&#x62EC;&#x5218;&#x961F;&#x957F;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x770B;&#x5230;&#x8001;&#x5F20;&#x5728;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#x548C;&#x5BF9;&#x65B9;&#x7684;80&#x7AEF;&#x53E3;&#x901A;&#x8BAF;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x65B9;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x3002;&#x663E;&#x7136;&#x6302;&#x6389;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x6211;&#x521A;&#x624D;&#x6D4B;&#x8BD5;&#x4E86;&#x6211;&#x7684;&#x6EA2;&#x51FA;&#x7A0B;&#x5E8F;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;redhat 9&#x80AF;&#x5B9A;&#x6302;&#x6389;&#x4E86;&#x3002;&#x201D;&#x8001;&#x5F20;&#x5F88;&#x5174;&#x594B;&#x3002;<br>&#x3000;&#x3000;&#x6211;&#x4EEC;&#x90FD;&#x56DE;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x6D4B;&#x8BD5;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x6CA1;&#x9519;&#xFF0C;&#x5BF9;&#x65B9;&#x7684;redhat 9 &#x786E;&#x5B9E;&#x6302;&#x6389;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x8138;&#x4E0A;&#x6709;&#x4E86;&#x96BE;&#x5F97;&#x7684;&#x7B11;&#x5BB9;&#xFF0C;&#x201C;&#x8BF4;&#xFF0C;&#x597D;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x7B97;&#x4E5F;&#x7ED9;&#x5BF9;&#x65B9;&#x4E00;&#x4E2A;&#x6559;&#x8BAD;&#xFF01;&#x201D;</p>
<p>&#x6211;&#x8D76;&#x7D27;&#x5BF9;&#x8001;&#x5F20;&#x8BF4;&#xFF0C;&#x5148;&#x4E0D;&#x8981;&#x653B;&#x51FB;&#x4E86;&#x3002;&#x5C0F;&#x5FC3;&#x88AB;&#x5BF9;&#x65B9;&#x53D1;&#x73B0;&#x4E86;&#x3002;&#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x96BE;&#x4E8E;&#x6210;&#x529F;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x624B;&#x91CC;&#x6709;&#x4E86;&#x5BF9;&#x65B9;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x597D;&#x597D;&#x5229;&#x7528;&#x4E00;&#x4E0B;&#xFF0C;&#x8981;&#x641E;&#x5C31;&#x5F7B;&#x5E95;&#x641E;&#x6389;&#x5BF9;&#x65B9;&#x3002;<br>&#x3000;&#x3000;&#x521D;&#x6218;&#x544A;&#x6377;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x79EF;&#x6781;&#x6027;&#x975E;&#x5E38;&#x9AD8;&#x3002;&#x4F60;&#x60F3;&#xFF0C;&#x90FD;&#x6C89;&#x9ED8;&#x4E86;10&#x5929;&#x4E86;&#x3002;&#x57FA;&#x672C;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x7A81;&#x7834;&#x3002;&#x4ECA;&#x5929;&#x5C45;&#x7136;&#x7528;&#x6211;&#x4EEC;&#x7684;ip&#x90FD;&#x8BA9;&#x5BF9;&#x65B9;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x3002;&#x80FD;&#x4E0D;&#x9AD8;&#x5174;&#x5417;&#xFF1F;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x4E00;&#x8FB9;&#x9AD8;&#x5174;&#x7684;&#x8BF4;&#xFF1A;&#x201C;&#x5BF9;&#xFF0C;&#x5BF9;&#xFF0C;&#x5C0F;&#x738B;&#x8BF4;&#x7684;&#x5BF9;&#x201D;&#xFF0C;&#x4E00;&#x8FB9;&#x53C8;&#x5230;&#x901A;&#x8BAF;&#x5BA4;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x60F3;&#x662F;&#x62A5;&#x529F;&#x53BB;&#x4E86;&#x5427;&#x3002;&#x5475;&#x5475;&#x3002;</p>
<p>&#x5BF9;&#x65B9;&#x7684;&#x6062;&#x590D;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#x3002;2&#x5206;&#x949F;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x91CD;&#x65B0;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4F30;&#x8BA1;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x68C0;&#x67E5;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x3002;<br>&#x3000;&#x3000;&#x5218;&#x961F;&#x957F;&#x7EC4;&#x7EC7;&#x6211;&#x4EEC;&#x5F00;&#x4F1A;&#xFF0C;&#x7814;&#x7A76;&#x4E0B;&#x4E00;&#x90E8;&#x7684;&#x653B;&#x51FB;&#x8BA1;&#x5212;&#x3002;&#x8001;&#x5F20;&#x8138;&#x4E0A;&#x6D0B;&#x6EA2;&#x7740;&#x7B11;&#x3002;&#x6210;&#x529F;&#x7684;&#x559C;&#x60A6;&#x6211;&#x662F;&#x80FD;&#x4F53;&#x4F1A;&#x7684;&#x3002;&#x611F;&#x89C9;&#x771F;&#x662F;&#x975E;&#x5E38;&#x597D;&#x3002;<br>&#x3000;&#x3000;&#x201C;&#x8001;&#x5F20;&#xFF0C;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x5229;&#x7528;&#x6EA2;&#x51FA;&#xFF0C;&#x8BA9;redhat&#x5F00;&#x4E2A;&#x65B0;&#x7684;&#x7AEF;&#x53E3;&#x3002;&#x201D;&#x6211;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&quot;&#x6709;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#xFF0C;&#x6211;&#x4E0D;&#x6562;&#x4FDD;&#x8BC1;&#x3002;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#x5F88;&#x5BB9;&#x6613;&#x53D1;&#x73B0;&#x7684;&#x3002;&quot;&#x8001;&#x5F20;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&quot;&#x90A3;&#x5C31;&#x4F20;&#x4E2A;&#x6728;&#x9A6C;&#x4E0A;&#x53BB;&#xFF0C;&#x6211;&#x4EEC;&#x7279;&#x5236;&#x7684;&#x90A3;&#x4E2A;&#xFF0C;&#x9632;&#x706B;&#x5899;&#x4E5F;&#x626B;&#x4E0D;&#x51FA;&#x6765;&#x201C;&#x5C0F;&#x8D75;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x8BA9;&#x5BF9;&#x65B9;&#x6EA2;&#x51FA;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6267;&#x884C;&#x547D;&#x4EE4;&#xFF0C;&#x53EF;&#x80FD;&#x6027;&#x4E0D;&#x5927;&#x201C;&#x8001;&#x5F20;&#x53C8;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x6211;&#x8FD9;&#x91CC;&#x53D1;&#x73B0;apache&#x4E00;&#x4E2A;&#x6F0F;&#x6D1E;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;&#x3002;&#x81F3;&#x5C11;&#x628A;&#x5BF9;&#x65B9;asp&#x4E2D;ip&#x9650;&#x5236;&#x6539;&#x6389;&#xFF0C;&#x95EE;&#x9898;&#x4E0D;&#x5927;&#x201C;&#x6211;&#x8BF4;&#x3002;<br>&#x3000;&#x3000;&#x5927;&#x5BB6;&#x90FD;&#x5174;&#x594B;&#x4E86;&#x3002;&#x8001;&#x5F20;&#x4E5F;&#x773C;&#x775B;&#x53D1;&#x5149;&#x3002;<br>&#x3000;&#x3000;&#x201D;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x641E;&#x6389;&#x5BF9;&#x65B9;&#x7684;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x5E76;&#x4E14;&#x5F00;&#x4E2A;&#x666E;&#x901A;&#x5E10;&#x53F7;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x6211;&#x5C31;&#x80FD;&#x8BA9;&#x4ED6;&#x6EA2;&#x51FA;&#x83B7;&#x5F97;root&#x6743;&#x5229;&#x6CA1;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#x52A8;&#x4F5C;&#x8981;&#x5FEB;&#x3002;&#x5BF9;&#x65B9;&#x7684;&#x7BA1;&#x7406;&#x5458;&#x4E0D;&#x662F;&#x5403;&#x5E72;&#x996D;&#x7684;&#x3002;&#x201D;<br>&#x3000;&#x3000;&#x201C;&#x662F;&#x5440;&#xFF0C;&#x52A8;&#x4F5C;&#x5DF2;&#x7ECF;&#x8981;&#x770B;&#x5FEB;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x65E6;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x7F3A;&#x53E3;&#xFF0C;&#x5BF9;&#x65B9;&#x53EF;&#x80FD;&#x9A6C;&#x4E0A;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4EE5;&#x6700;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x628A;&#x5BF9;&#x65B9;&#x7684;&#x7CFB;&#x7EDF;&#x5F7B;&#x5E95;&#x7834;&#x574F;&#x6389;&#x3002;&#x201D;&#x5218;&#x961F;&#x957F;&#x8BF4;&#x3002;</p>
<p>&#x5546;&#x91CF;&#x4E00;&#x9635;&#xFF0C;&#x5927;&#x5BB6;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#xFF0C;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#xFF0C;&#x4E0D;&#x5BF9;&#x5BF9;&#x65B9;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x653B;&#x51FB;&#xFF0C;&#x9EBB;&#x75F9;&#x5BF9;&#x65B9;&#x3002;&#x7136;&#x540E;&#x6211;&#x548C;&#x8001;&#x5F20;&#x52A0;&#x7D27;&#x5199;&#x653B;&#x51FB;&#x7A0B;&#x5E8F;&#x3002;&#x6210;&#x529F;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x5236;&#x5B9A;&#x4E00;&#x5957;&#x65B9;&#x6848;&#xFF0C;&#x6E17;&#x5165;&#x5BF9;&#x65B9;&#x7CFB;&#x7EDF;&#x83B7;&#x53D6;&#x5BF9;&#x65B9;&#x7684;&#x8D44;&#x6599;&#x3002;&#x6216;&#x8005;&#x5F7B;&#x5E95;&#x8BA9;&#x5BF9;&#x65B9;&#x7CFB;&#x7EDF;&#x762B;&#x75EA;&#x3002;<br>&#x3000;&#x3000;&#x4E8E;&#x662F;&#xFF0C;&#x5927;&#x5BB6;&#x53C8;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x6211;&#x548C;&#x8001;&#x5F20;&#x7684;&#x7A0B;&#x5E8F;&#x8C03;&#x8BD5;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#x3002;&#x8981;&#x8BA9;&#x5BF9;&#x65B9;&#x6267;&#x884C;&#x6211;&#x7684;&#x547D;&#x4EE4;&#x4E0D;&#x662F;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x51B5;&#x4E14;&#x6EA2;&#x51FA;&#x65F6;&#x5019;&#x6267;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x80FD;&#x592A;&#x591A;&#x3002;&#x53EA;&#x80FD;&#x6267;&#x884C;&#x975E;&#x5E38;&#x5C11;&#x7684;&#x4E00;&#x70B9;&#x70B9;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6267;&#x884C;&#x6700;&#x6709;&#x7528;&#x6700;&#x7CBE;&#x5E72;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x975E;&#x5E38;&#x96BE;&#x4E8E;&#x9009;&#x62E9;&#x7684;&#x3002;<br>&#x3000;&#x3000;&#x4E3A;&#x4E86;&#x8BD5;&#x9A8C;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x90A3;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5B89;&#x88C5;&#x4E86;&#x548C;&#x5BF9;&#x65B9;&#x4E00;&#x6837;&#x7684;redhat9&#x548C;apache&#x8FD8;&#x6709;&#x6307;&#x6325;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FDB;&#x884C;&#x8BD5;&#x9A8C;&#x6D4B;&#x8BD5;&#x3002;&#x4E0D;&#x80FD;&#x518D;&#x7528;&#x5BF9;&#x65B9;&#x7684;&#x673A;&#x5668;&#x6765;&#x505A;&#x8BD5;&#x9A8C;&#x4E86;&#x3002;<br>&#x3000;&#x3000;&#x6709;&#x4E86;&#x5B9E;&#x9645;&#x7684;&#x8BD5;&#x9A8C;&#x73AF;&#x5883;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5DE5;&#x4F5C;&#x8981;&#x8F7B;&#x677E;&#x4E9B;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x9A6C;&#x4E0A;&#x8BD5;&#x9A8C;&#xFF0C;&#x9A6C;&#x4E0A;&#x4FEE;&#x6539;&#x3002;&#x751A;&#x81F3;&#x5F53;&#x521D;&#x6CA1;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x53D1;&#x73B0;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x53EF;&#x4EE5;&#x5199;&#x4E2A;&#x7A0B;&#x5E8F;&#x8BA9;apache&#x91CC;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6EA2;&#x51FA;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x5165;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x6570;&#x636E;&#xFF0C;apache&#x53EF;&#x4EE5;&#x5199;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x8054;&#x60F3;&#x5230;&#x90A3;&#x4E2A;&#x6EA2;&#x51FA;&#x51FD;&#x6570;&#x6709;printf&#x5B57;&#x6837;&#xFF0C;&#x5FC3;&#x91CC;&#x4E00;&#x9635;&#x7684;&#x5174;&#x594B;&#xFF0C;&#x770B;&#x6765;apache&#x7684;&#x8F93;&#x51FA;&#x4E0A;&#x6709;&#x6EA2;&#x51FA;&#x3002;&#x800C;&#x4E14;&#x95EE;&#x9898;&#x4E25;&#x91CD;&#x3002;&#x4F46;&#x662F;&#x65B0;&#x7248;&#x672C;&#x5DF2;&#x7ECF;&#x8865;&#x4E86;&#x8FD9;&#x4E2A;&#x6F0F;&#x6D1E;&#x4E86;&#x3002;redhat&#x4E0A;&#x5E26;&#x7684;apache&#x6CA1;&#x6709;&#x8865;&#x8FC7;&#x3002;&#x5475;&#x5475;&#xFF0C;&#x5929;&#x52A9;&#x6211;&#x4E5F;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter8.html" class="navigation navigation-prev " aria-label="Previous page: 第八章">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter10.html" class="navigation navigation-next " aria-label="Next page: 第十章">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第九章","level":"1.10","depth":1,"next":{"title":"第十章","level":"1.11","depth":1,"path":"chapter10.md","ref":"chapter10.md","articles":[]},"previous":{"title":"第八章","level":"1.9","depth":1,"path":"chapter8.md","ref":"chapter8.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter9.md","mtime":"2017-02-27T04:04:32.635Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-03-01T14:18:25.391Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

